[
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0792190505",
        "title": "Grease 2",
        "overall": 5,
        "reviewText": "Great product",
        "description": "[]",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "1400050596",
        "title": "Whatever You Say I Am: The Life and Times of Eminem",
        "overall": 5,
        "reviewText": "Great",
        "description": "[\"The demand for all things Eminem is big, and rock journalist Bozza aims to fill in the gaps with some personal notes of his own. Culling from his own past interviews with the often-reviled rapper, Bozza's portrait begins four years ago, when he first met and interviewed 27-year-old Marshall Mathers III. He stumbled upon a young man growing into his fame and struggling with the demons of his past life. Eminem's music-propelled by Dr. Dre's beats and Mathers's own controversial lyrics-gave rise to a new era. But it was before this big break, before the awards, movie offers and protests, that Bozza met and connected with Eminem. The two would become irrevocably linked-Bozza gained prominence after writing a remarkable in-depth piece on Em for Rolling Stone, which took the cover and helped catapult the artist to superstardom. It is Bozza's relationship with Eminem that lends credibility to this bio, as well as his ability to fold personal reminiscence into longer analytical sections on Eminem's life, the Detroit rap scene and pop culture. Bozza's unprecedented access to Mathers then and now has given rise to one of the only fully honest accounts of the now brilliant star. <br />Copyright 2003 Reed Business Information, Inc.\", 'The sine qua non of white rappers gets star treatment by <i>Rolling Stone</i>-r Bozza. Eminem\\'s \"sense of timing and image management are nothing short of exceptional,\" you see, and he \"lives in the world he dreamed of . . . when he birthed [musical alter ego] Slim Shady,\" which is supposed to be a compliment to Eminem\\'s grasp on reality. Still, this is a serious enough book, crammed with facts and the musings of its subject. Yes, it is legend-making stuff, urgently delivered and pretty constantly giving the subject more than his \"props\" as Bozza dotes on the oh-so-awesome importance of the Great White Rapper\\'s every act. But as the rap analog of Elvis (the white guy who sounds black), Eminem commands a huge audience, and as they did with the King, informed observers (the critics) debate his musical value and import. Oh, what the heck, get the book, display it, and reel in some of the highly prized YA breeder-male demographic. Hey, it\\'s only rock and roll (and <i>they</i> like it). <i>Mike Tribby</i><br /><i>Copyright  American Library Association. All rights reserved</i>', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0316268399",
        "title": "Twilight Tenth Anniversary/Life and Death Dual Edition",
        "overall": 5,
        "reviewText": "Love it great read",
        "description": "['Stephenie Meyer is the author of the #1 bestselling Twilight Saga and <i>The Host</i>. She graduated from Brigham Young University with a degree in English literature, and she lives with her husband and three sons in Arizona.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0451225503",
        "title": "Wait Till Your Vampire Gets Home (Broken Heart, Oklahoma, Book 4)",
        "overall": 5,
        "reviewText": "Love it",
        "description": "[\"Libby Monroe, the daughter of paranormal hunters, has seen everything by the time she gets to Broken Heart, Oklahoma, except dragons fighting overhead. At 23, she has no idea what she wants to do, except to avoidgetting toasted bydragon fire. She spots Ralph Genessa, ayoung widower who happens to be a vampire tending his wife's grave in the middle of the night. A female dragon appear,falls to the ground, and, as Libby tries to help,kisses her with her last breath, transforming Libby and Ralph. Ralph takes Libby to a compoundpopulated by vampires, werewolves, and assorted otherworldly beings. There Libby isprodded and analyzed untilhavoc breaks out as dragons attack and she seems to be the answer as well as the problem. The only person she can turn to is Ralph, who understands her metamorphosis and their mutual desire. The fourth in Bardsley's vampire series has action aplenty and a free-spirited, wittilysarcastic heroine who willdelighther fans. --Patty Engelmann\", '\"A yummylicious treat!\" -- Dakota Cassidy<br /><br />\"Hot, hilarious, one helluva ride.\" -- L.A. Banks<br /><br />\"A fabulous combination of vampire lore, parental angst, romance, and mystery.\" -- Jackie Kessler', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0312674376",
        "title": "Hold Me Closer, Necromancer (Necromancer Series)",
        "overall": 5,
        "reviewText": "Must ad to any reading list",
        "description": "['', \"McBride's humor and ear for dialogue carry the book. There's a <i>Mad</i>-magazine-meets-Twilight' sensibility to Hold Me Closer, Necromancer' that will keep readers turning pages and laughing all the way. <i>Los Angeles Times</i>\", 'A fast-paced and fun first novel . . . This is a welcome humorous addition to the paranormal trend. <i>The Oregonian</i>', 'The richness of the supernatural underworld, complete with politics, history, and personal vendettas, is another draw, and honorable, desperate, smart-alecky, clueless Sam is the perfect vehicle for entry. Readers seeking a thoughtful, original, and compelling supernatural adventure need look no further. <i>BCCB, STARRED review</i>', \"With fine writing, tight plotting, a unique and uniquely odd cast of teens, adults, and children, and a pace that smashes through any curtain of disbelief, this sardonic and outrageous story's only problem is that it must, like all good things, come to an end. <i>Booklist, Starred Review</i>\", \"McBride pulls no punches and hits where readers will least expect it; the story can be gory and violent, but isn't gratuitously graphic. A solid start that concludes with the promise of Sam's power growing greater and darker, secrets getting deeper, and more fun to follow. <i>Publishers Weekly</i>\", '. . . this quirky urban fantasy will compel fans of horror and supernatural romance--and heroic skateboarding slackers. <i>Kirkus Reviews</i>', 'Sam is the ultimate laid-back slacker who also happens to be smart, funny, sweet, and adorable. Every character in this book seems to live in the moment, offering sarcastic humor that lightens up the intense action and dark suspense. <i>Hold Me Closer, Necromancer</i> is entertaining, offbeat, hilarious, and flat-out fun. We loved it. <i>Justine magazine</i>', \"Part scary, part funny, with a touch of tenderness, <i>Hold Me Closer, Necromancer</i> holds readers spellbound with unforgettable characters, snappy dialogue and killer (sometimes literally) song lyrics that open and offer clues to each chapter. Drawing on the timeless adolescent quest for identity and the popularity of supernatural fiction, McBride makes Sam's adventures a scream--and a hoot. <i>BookPage</i>\", '', 'Lish McBride grew up in the Pacific Northwest. It rains a lot there, but she likes it anyway. She spent three years away while she got her MFA in fiction from the University of New Orleans, where she managed to survive the hurricane. She enjoys reading, having geek-laden conversations about movies, comics, and zombies with her friends, and of course trying to wear pajamas as much as humanly possible. She lives happily in Seattle with her family, two cats, and one very put-upon Chihuahua. <i>Hold Me Closer, Necromancer</i> was her debut novel and was named an American Library Association Best Book for Young Adults and was a finalist for the YALSA William C. Morris Award.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0307282961",
        "title": "Twilight (The Twilight Saga, Book 1)",
        "overall": 5,
        "reviewText": "Love it",
        "description": "[]",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "1937867358",
        "title": "Kanokon Omnibus 1-2",
        "overall": 5,
        "reviewText": "Loved it",
        "description": "['', '<b>KATSUMI NISHINO </b>is a light novel author best known as the writer of the <i>Kanokon </i>novels and manga<i>.</i><br><i></i><br><b>RIN YAMAKI </b>is best known as the artist of the <i>Kanokon </i>manga series.']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B002J29XIM",
        "title": " Books\" />",
        "overall": 5,
        "reviewText": "Coolest action figure ever",
        "description": "['2009 SDCC Comic Con Exclusive Bleach White Hollow Ichigo Figure']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "1591829380",
        "title": "Gundam Seed Astray (Gundam (Tokyopop) (Graphic Novels)), Vol. 1",
        "overall": 5,
        "reviewText": "Great book",
        "description": "['The Gundam series has been on Cartoon Network for several years. <br />Gundam has been immensely popular worldwide for over 20 years. <br />Gundam Seed Astray features edgier, hipper more irreverent stories that will appeal to more discerning readers. <br />Anime coming soon to the U.S.! <br />Illustrated by Koichi Tokita (Gundam Wing) <br />Will fan the flames of sales of existing Gundam titles and introduce readers to a brand new Gundam universe <br />Featuring story arcs not available in the animated series', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "1937867366",
        "title": "Kanokon Omnibus 3-4",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['', '<b>Katsumi Nishino </b>is a light novel author best known as the writer of the <i>Kanokon </i>novels and manga<i>.</i><br /><i></i><b></b><br /><b>Rin Yamaki </b>is best known as the artist of the <i>Kanokon </i>manga series.', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0451226771",
        "title": "Over My Dead Body (Broken Heart Vampires)",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['In Broken Heart, Oklahoma, a group of paranormals called The Consortium owns most of the land, and through an unfortunate act, many of the single townspeople have been turned into vampires. Simone Sweet is one, a single mother with a buried past recently returned to Broken Heart. She has told no one about her violent marriage except Grandma Elaine, who welcomed her in her time of need. Simone becomes the towns mechanic and repair guru, and while helping build a shield to protect the town, she encounters Brady Hayes, a nonparanormal who is helping The Consortium. He is determined to win her over, even though, still wounded, she cringes when men pay attention to her. Easygoing Brady finally breaks through Simones reluctance, until her past and Bradys come back to haunt them and the town. Bardsleys romantic vampire series (Wait till Your Vampire Gets Home, 2008) is a roller-coaster ride filled with humor and action, and sure to entertain. --Patty Engelmann', '\"A yummylicious treat!\" -- Dakota Cassidy<br /><br />\"Michele Bardsley\\'s vampire stories rock!\" -- Carly Phillips']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0743566572",
        "title": "City of Bones (The Mortal Instruments)",
        "overall": 5,
        "reviewText": "Best book ever",
        "description": "[\"This Buffy-esque YA novel does not translate well to the audio medium, and part of the problem lies in the story's pacing. Teenager Clary discovers she can see supernatural beings that no one else can, gets drawn into the world of the Shadowhunters (teens who kill demons and monsters) and learns that her mother is somehow mysteriously connected to all the strange happenings around her. As a result, a good chunk of the novel consists of long explanatory passages, as various characters fill Clary in on supernatural creatures, the history and rules of the Shadowhunters and her mother's entanglementsall of which come across as tedious lectures. In addition, narrator Graynor makes almost no attempt to differentiate the various teen characters' voices. Only the minor character Dorothea, played as a faux witch with a gravelly New York accent, is memorable. Graynor also frequently ignores the author's explicit textual directives, such as [Simon] came back, sounding worried or The tone of arrogant superiority was back in [Jace's] voice, for her performance, making this a program with an intriguing premise and cast but disappointing execution. Ages 14-up. <i>(May)</i> <br />Copyright  Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.\", '\"Funny, dark, and sexy. One of my favorite books.\" -- Holly Black<br /><br />\"City of Bones has everything: vampires, werewolves, faeries, true love, and stuff that blows up. What\\'s more, Clare\\'s characters are brilliant -- she better not kill any of them off in the next two volumes!\" -- Justine Larbalestier, author of <i>Magic or Madness</i>', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0451228782",
        "title": "Come Hell or High Water: A Broken Heart Novel (Broken Heart Vampires)",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['\"Michele Bardsley\\'s vampire stories rock!\" -- Carly Phillips<br /><br />\"Wouldn\\'t let me go.\" -- Maryjanice Davidson<br /><br />\"Cutting-edge humor...a yummylicious treat.\" -- Dakota Cassidy', '<b>Michele Bardsley</b> is the <i>New York Times</i> bestselling author of the Broken Heart series.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "0451231058",
        "title": "Cross Your Heart: A Broken Heart Novel (Broken Heart Vampires)",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['Broken Heart, Oklahoma, has become the epicenter for the supernatural, inhabited by vampires, lycanthropes, were-cats, and other beings. Some residents were made into vampires by accident, including Elizabeth Bretton. She came to town to check on her familys abandoned mansion, which is now inhabited by Queen Patsy and her family. Being a vampire definitely has its benefits. Elizabeth loves not aging and living in the Victorian mansion until a secret room is discovered. Suddenly Elizabeth is confronted with a ghost that wants to kill her, the whole town is subject to a mysterious evil, and an amazingly attractive man appears. A rare were-jaguar, Tez Jones is invited to join the town were-cats, but he only wants to spend time with Elizabeth. The seventh book in Bardsleys Broken Heart series is as fun and entertaining as the first, making it a must for fans and newcomers alike. --Patty Engelmann', '<b>Michele Bardsley</b> is the <i>New York Times</i> bestselling author of the Broken Heart series.', '', '']",
        "domain": "Books"
    }
]