[
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506643200000,
        "asin": "B001VLFE76",
        "title": "Underworld Trilogy: (Underworld / Underworld: Evolution / Underworld: Rise of the Lycans)",
        "overall": 5,
        "reviewText": "Excellent",
        "description": "[\"<i><b>Underworld</b></i><br> Underneath the city streets, amid the labyrinth of subway tunnels and gothic ruins, the two most notorious creatures of the night are embroiled in an all-out war that has been going on for centuries. It is the culmination of a blood-thirsty battle between the vampires and their mortal enemies, the werewolves. Stars: Kate Beckinsale (<i>Pearl Harbor</i>, <i>My Life Without Me</i>), Scott Speedman (<i>My Life Without Me</i>, TV's <i>Felicity</i>). <br> <br> <b><i>Underworld: Evolution</i></b><br> The saga continues as the battle rages on between the death dealers (vampires) & the lycans (werewolves) in this fast-paced modern-day tale of deadly action ruthless intrigue & forbidden love all leading to the battle to end all wars as the immortals finally face their retribution.<br><br> <i><b>Underworld: Rise of the Lycans</b></i><br> <i>Underworld: Rise of the Lycans</i> delves into the origins of the centuries-old blood feud between the aristocratic vampires, known as Death Dealers, and the barbaric Lycans (werewolves). A young Lycan, Lucian (Michael Sheen), emerges as a powerful leader who rallies the werewolves to rise up against Viktor (Bill Nighy), the cruel vampire king who has persecuted them for hundreds of years. Lucian is joined by his secret lover, the beautiful vampire Sonja (Rhona Mitra), in his battle to free the Lycans from their brutal enslavement.\", '<i><b>Underworld</b></i><br> <i>Blade</i> meets <i>The Crow</i> and <i>The Matrix</i> in <i>Underworld</i>, a hybrid thriller that rewrites the rulebook on werewolves and vampires. It\\'s a \"cuisinart\" movie (blend a lot of familiar ideas and hope something interesting happens) in which immortal vampire \"death dealers\" wage an ancient war against \"Lycans\" (werewolves), who\\'ve got centuries of revenge--and some rather ambitious genetic experiments--on their lycanthropic agenda. Given his preoccupation with gloomy architecture (mostly filmed in Budapest, Hungary), frenetic mayhem and gothic costuming, it\\'s no surprise that first-time director Len Wiseman gained experience in TV commercials and the art departments of <i>Godzilla</i>, <i>Men in Black</i>, and <i>Independence Day</i>. His work is all surface, no substance, filled with derivative, grand-scale action as conflicted vampire Selene (Kate Beckinsale, who later became engaged to Wiseman) struggles to rescue an ill-fated human (Scott Speedman) from Lycan transformation. It\\'s great looking all the way, and a guaranteed treat for horror buffs, who will eagerly dissect its many strengths and weaknesses. <i>--Jeff Shannon</i><br><br> <i><b>Underworld: Evolution</b></i><br> Better action, a bit of sex, and gorier R-rated violence make <i>Underworld: Evolution</i> a reasonably satisfying sequel to 2003\\'s surprise hit <i>Underworld</i>. Looking stunning as ever in her black leather battle gear, Kate Beckinsale is every goth guy\\'s fantasy as Selene, the vampire \"death dealer\" who\\'s now fighting to stop the release of the original \"Lycan\" werewolf, William (Brian Steele) from the prison that\\'s held him for centuries. As we learn from the film\\'s action-packed prologue, William and his brother Marcus (Tony Curran) began the bloodline of vampires and werewolves, and after witnessing centuries of warfare between them, their immortal father Corvinus (Derek Jacobi) now seeks Selene and the human vampire/lycan hybrid Michael (Scott Speedman) to put an end to the war perpetuated by Victor (Bill Nighy), the vampire warrior whose betrayal of Selene turns Underworld: Evolution into an epic tale of familial revenge. This ambitious attempt at Shakespearean horror is compromised by a script (by Danny McBride and returning director Len Wiseman, Beckinsale\\'s real-life husband) that\\'s more confusing than it needs to be, with too many characters and not enough storytelling detail to flesh them all out. Aspiring to greatness and falling well short of that goal, <i>Underworld: Evolution</i> succeeds instead as a full-throttle action/horror thriller, with enough swordplay, gunplay, and CGI monsters to justify the continuation of the <i>Underworld</i> franchise. If you\\'re an established fan, this is a must-see movie; if not, well... at least it\\'s better than<i> Van Helsing</i>! <i>--Jeff Shannon</i><br><br> <i><b>Underworld: Rise of the Lycans</b></i><br> This prequel to Len Wiseman&rsquo;s <i>Underworld</i> and <i>Underworld: Evolution</i> is distinctively different, especially minus the nimble vampire warrior star, Selene (Kate Beckinsale). <i>Underworld: Rise of the Lycans</i> takes its cues from the vampire/werewolf battles that occur in the other films, but director Patrick Tatopoulos focuses here on the young werewolf Lucian\\'s (Michael Sheen) rise to leadership. <i>Rise of the Lycans</i> is set mostly within the walls of vampire lord Viktor&rsquo;s (Bill Nighy) castle, so the film&rsquo;s silver, black, and blue palette reflects a world happening under moonlight. From the outset, when Viktor brings Lucian, the first werewolf, into the world, this villainous bloodsucker&rsquo;s daughter, Sonja (Rhona Mitra), is smitten with Lucian&rsquo;s hairy appearance and instinctual intelligence. As years pass, Lucian grows tired of watching his race suffer slavery and imprisonment, and recruits a human named Raze (Kevin Grevioux) to assist rebellion. This archetypal plot is not so riveting, and what carries <i>Underworld: Rise of the Lycans</i> are the battle scenes between vampires and werewolves, which are excitingly fast-paced and brutal. The whole film adopts a medieval battlefield aesthetic that carries an otherwise clich&eacute;d story about illicit love and freedom fighting. Some characters, like the traitor vampire Tannis (Steven Mackintosh), also intrigues throughout, as one guesses who he will ally with. <i>Underworld: Rise of the Lycans</i> may not be the finest film in the werewolf and vampire archives independently, but its mixed monstrosity makes it unique and entertaining, especially on a big screen.<i> --Trinie Dalton</i>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00005JKZU",
        "title": "The Lord of the Rings - The Two Towers VHS",
        "overall": 5,
        "reviewText": "Perfect",
        "description": "[\"Frodo Baggins and the Fellowship continue their quest to destroy the One Ring and stand against the evil of the dark lord Sauron. The Fellowship has divided and now find themselves taking different paths to defeating Sauron and his allies. Their destinies now lie at two towers - Orthanc Tower in Isengard, where the corrupted wizard Saruman waits and Sauron's fortress at Baraddur, deep within the dark lands of Mordor. <P>(C) MMII New Line Productions, Inc. The Lord of the Rings, The Two Towers, and the characters, events, items, and places therein are trademarks of The Saul Zaentz Company d/b/a Tolkien Enterprises under license to New Line Productions, Inc. All Rights Reserved.\", \"<I>The Lord of the Rings: The Two Towers</I> is a seamless continuation of Peter Jackson's epic fantasy based on the works of J.R.R. Tolkien. After the breaking of the Fellowship, Frodo (Elijah Wood) and Sam (Sean Astin) journey to Mordor to destroy the One Ring of Power with the creature Gollum as their guide. Meanwhile, Aragorn (Viggo Mortensen), Legolas (Orlando Bloom), and Gimli (John Rhys-Davies) join in the defense of the people of Rohan, who are the first target in the eradication of the race of Men by the renegade wizard Saruman (Christopher Lee) and the dark lord Sauron. Fantastic creatures, astounding visual effects, and a climactic battle at the fortress of Helm's Deep make <I>The Two Towers</I> a worthy successor to <I>The Fellowship of the Ring</I>, grander in scale but retaining the story's emotional intimacy. These two films are perhaps the greatest fantasy films ever made, but they're merely a prelude to the cataclysmic events of <I>The Return of the King</I>. <I>--David Horiuchi</I>\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B000MTOM8A",
        "title": "Dragon Ball Z: Season 2",
        "overall": 5,
        "reviewText": "Love it",
        "description": "[\"''You won't believe how powerful it is now!'' -- NewType<br><br><br>Having suffered heavy losses in the battle with the Saiyans, and with Goku still recovering from his injuries, the remaining Z-Fighters must embark on a perilous journey to Planet Namek in search of the Namekian Dragon Balls. Unbeknownst to them, however, a powerful new enemy has set his sights on the same prize the ruthless tyrant Frieza!<br><br><br>Beset on all sides by danger, Gohan, Krillin, and Bulma must fight for their lives as they struggle to keep the Dragon Balls from falling into evil hands. Meanwhile, Goku races against time to join his friends in their quest, but waiting for him on Planet Namek is an army of the most powerful villains the universe has ever known, led by Frieza s most elite fighting unit the unstoppable Ginyu Force!<br><br><br>Season Two contains: <br><br><br>-The Complete Namek Saga - first time on DVD! and Captain Ginyu Saga <br><br><br>-35 Action-Packed Episodes on 6 discs <br><br><br>-Revised English Dialogue with Original Japanese Music\", 'The second season of the wildly popular <I>Dragon Ball Z</I> comprises the \"Namek\" and \"Captain Ginyu\" sagas. Gohan, Krillin, and Bulma travel to the planet Namek to find an even more powerful set of Dragon Balls that can restore the lives of Tenshinhan, Yamucha, Chaozu and Piccolo, who were killed by Vegeta during the first season. (Their souls continue to train with King Kai in the Other World.) All is not well on Namek: the arch-villain Frieza, who looks and sounds a bit like Truman Capote, also desires the Dragon Balls. If he uses them to obtain eternal life, he\\'ll rule the universe forever. With a cadre of lieutenants that includes Vegeta, he slaughters the Namekians to gain the supernatural orbs. After his injuries have been healed by a magic senzu bean, Goku heads to Namek. En route, he trains at 100 gravities, raising his powers enormously. Vegeta believes Goku may be the legendary Super Saiyan that appears once a millennium--except he lacks the requisite love of battle. This version of Goku is less aggressive, and he uncharacteristically uses his brain (never his greatest asset) to defeat Ginyu, Frieza\\'s second-in-command. Unlike <a href=\"/gp/product/B000KWZ1TI/\"><I>Season 1--Vegeta Saga</I></a>, <I>Season 2</I>ends on a cliff-hanger. Skeptics may find Goku\\'s adventures needlessly protracted, over the top, and even silly. But for millions of boys, they provide the special blend of comradeship, martial arts training, and take-no-prisoners battles they love. The newly remastered edition includes the original Japanese dialogue for the first time. (Rated TV PG. suitable for ages 8 and older: violence, minor risqu humor, brief nudity, tobacco and alcohol use) <I>--Charles Solomon</I>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00003CWT6",
        "title": "The Lord of the Rings: The Fellowship of the Ring",
        "overall": 5,
        "reviewText": "Perfect",
        "description": "['<![CDATA[', 'Lord of the Rings: The Fellowship of the Ring (DVD) (WS)', \"In the first part of J.R.R. Tolkien's epic masterpiece, The Lord of the Rings, a shy young hobbit named Frodo Baggins inherits a simple gold ring. He knows the ring has power, but not that he alone holds the secret to the survival--or enslavement--of the entire world. Now Frodo, accompanied by a wizard, an elf, a dwarf, two men and three loyal hobbit friends, must become the greatest hero the world has ever known to save the land and the people he loves.\", \"As the triumphant start of a trilogy, <I>The Lord of the Rings: The Fellowship of the Ring</I> leaves you begging for more. By necessity, Peter Jackson's ambitious epic compresses J.R.R. Tolkien's classic <I>The Lord of the Rings</I>, but this robust adaptation maintains reverent allegiance to Tolkien's creation, instantly qualifying as one of the greatest fantasy films ever made. At 178 minutes, it's long enough to establish the myriad inhabitants of Middle-earth, the legendary Rings of Power, and the fellowship of hobbits, elves, dwarves, and humans--led by the wizard Gandalf (Ian McKellen) and the brave hobbit Frodo (Elijah Wood)--who must battle terrifying forces of evil on their perilous journey to destroy the One Ring in the land of Mordor. Superbly paced, the film is both epic and intimate, offering astonishing special effects and production design while emphasizing the emotional intensity of Frodo's adventure. Ending on a perfect note of heroic loyalty and rich anticipation, this wondrous fantasy continues in <I>The Two Towers</I> (2002). <I>--Jeff Shannon</I>\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B01BDUS0NY",
        "title": "Deadpool 2016",
        "overall": 5,
        "reviewText": "Best movie ever",
        "description": "['Based upon Marvel Comics most unconventional anti-hero, Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00005JKZY",
        "title": "The Lord of the Rings: The Return of the King",
        "overall": 5,
        "reviewText": "Perfect",
        "description": "['<![CDATA[', 'Lord of the Rings: The Return of the King (DVD) (WS)', '\"One ring to rule them all. One ring to find them. One ring to bring them all and in the darkness bind them.\" In the conclusion of J.R.R. Tolkien\\'s epic masterpiece, The Lord of the Rings, as armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied only by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.', \"With <I>The Return of the King</I>, the greatest fantasy epic in film history draws to a grand and glorious conclusion. Director Peter Jackson's awe-inspiring adaptation of the Tolkien classic <I>The Lord of the Rings</I> could never fully satisfy those who remain exclusively loyal to Tolkien's expansive literature, but as a showcase for physical and technical craftsmanship it is unsurpassed in pure scale and ambition, setting milestone after cinematic milestone as the brave yet charmingly innocent Hobbit Frodo (Elijah Wood) continues his mission to Mordor, where he is destined to destroy the soul-corrupting One Ring of Power in the molten lava of Mount Doom. While the heir to the kingdom of Men, Aragorn (Viggo Mortensen), endures the massive battle at Minas Tirith with the allegiance of the elf Legolas (Orlando Bloom), dwarf Gimli (John Rhys-Davies) and the great wizard Gandalf (Ian McKellen), Frodo and stalwart companion Samwise Gamgee (Sean Astin) must survive the schizoid deceptions of Gollum, who remains utterly convincing as a hybrid of performance (by Andy Serkis) and subtly nuanced computer animation.\", '', \"Jackson and cowriters Fran Walsh and Philippa Boyens have much ground to cover; that they do so with intense pacing and epic sweep is impressive enough, but by investing greater depth and consequence in the actions of fellow Hobbits Merry (Dominic Monaghan) and Pippin (Billy Boyd), they ensure that <I>Return of the King</I> maintains the trilogy's emphasis on intimate fellowship. While several major characters appear only briefly, and one (Christopher Lee's evil wizard, Saruman) relegated entirely to the extended version on DVD, Jackson is to be commended for his editorial acumen; like Legolas the archer, his aim as a filmmaker is consistently true, and he remains faithful to Tolkien's overall vision. If <I>Return</I> suffers from too many endings, as some critic suggested, it's only because the epic's conclusion is so loyally inclusive of the actors--most notably Astin--who gave it such strength to begin with. By ending the <I>LOTR</I> trilogy with noble integrity and faith in the power of imaginative storytelling, <I>The Return of the King</I>, like its predecessors, will stand as an adventure for the ages. <I>--Jeff Shannon</I>\"]",
        "domain": "Movies_and_TV"
    }
]