[
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B01AC3ZDCE",
        "title": "Nintendo Selects: The Legend of Zelda Ocarina of Time 3D",
        "overall": 5,
        "reviewText": "Fun game",
        "description": "[\"Nintendo Selects highlights a variety of great games at a great price, including this one. The Legend of Zelda: Ocarina of Time 3D brings a completely re-mastered version of an epic entry in the beloved The Legend of Zelda game series to Nintendo's newest hand-held system, Nintendo 3DS. The game couples phenomenally enhanced graphics with stunning, glasses-free 3D visuals to bring to life the daring adventures of its hero, Link. A streamlined touch-screen interface and newly implemented motion controls provide a fresh and intuitive feel as players immerse themselves in the tale of the creation of Hyrule and the struggle for control of its all-powerful ancient relic. The game will also feature new challenges not included in the original game. The Legend of Zelda veterans can look forward to the Master Quest - a second quest with revamped puzzles and redesigned dungeons that feature the same graphical and interface upgrades as the main game. The Legend of Zelda: Ocarina of Time 3D is a masterful improvement on one of the landmark releases in video game history.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B0050SXI6K",
        "title": "Ratchet &amp; Clank Collection",
        "overall": 5,
        "reviewText": "Perfect",
        "description": "['The original and multi-million units selling Ratchet &amp; Clank trilogy returns in the Ratchet &amp; Clank Collection for the PlayStation 3. <br /><br />Experience the classic adventures of the universe&rsquo;s favorite Lombax, Ratchet and his robotic sidekick Clank in this classic PlayStation 2 trilogy now fully remastered in high definition! Wield the original tools of destruction as you travel from planet to planet unraveling their original story and explosive adventures in this PS3 exclusive.', '<div class=\"aplus\"> <h4>Three <i>Ratchet &amp; Clank</i> PS2 Classics Remastered for PS3</h4>', \"Experience the classic adventures of the universe's favorite Lombax, Ratchet and his robotic sidekick Clank in this classic PlayStation 2 Action-Adventure trilogy now fully remastered in high definition. Wield the original tools of destruction as you travel from planet to planet unraveling their original story and explosive adventures in this PlayStation 3 exclusive.\", \"It's time to rip the galaxy a new one. <i>Ratchet &amp; Clank</i> contains over 36 weapons and gadgets to choose from. With all that hardware at hand, it's no wonder Ratchet, a wrench-wielding Lombax, and his robot buddy Clank, have itchy trigger fingers. Think about it. You can choose from burning, bombing, exploding or obliterating your enemies. So go ahead, blow it up. Blow it all up. It isn't the size of your weapons that count. It's how many you have and better yet... How you use 'em.\", \"Ratchet and Clank are back, and they're going commando. <i>Ratchet &amp; Clank: Going Commando</i> features more than 50 of the coolest weapons and gadgets ever imagined. The more stuff you blow up, the stronger Ratchet gets and the bigger and badder the weapons you'll have. Plus, <i>Ratchet &amp; Clank: Going Commando</i> features all-new side challenges: destroy hordes of enemies in gladiator arenas, upgrade your ship and pick off enemies in space combat and leave competitors to eat your dust in hi-speed challenge...You up for it?!\", 'The third installment of the <i>Ratchet &amp; Clank</i> franchise incorporates new elements of gameplay not seen previously in the series, including online and offline multiplayer capabilities that will appeal to a wide variety of players. <i>Ratchet &amp; Clank: Up Your Arsenal</i> returns gamers to Planet Veldin, the setting of the original <i>Ratchet &amp; Clank</i>, where the duo set off on a gripping new adventure through a multitude of diverse planets to fight for galactic peace. Players will be able to earn up to 20 weapons (including online and offline) with up to four levels of upgrades for most weapons, plus new high-tech gadgets to help them through their journey.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B005HN5LKY",
        "title": "Gen AC Adapter Power Supply Cord for Xbox 360 Slim",
        "overall": 5,
        "reviewText": "Great product",
        "description": "['The Xbox 360 AC Adapter replaces any lost or broken AC power adapter for the Xbox 360 systems. Input: AC 100-245V~2A, 50-60Hz. Output: DC 12V 10.83A(10.83A).5Vsb-1A. Compatible For XBOX 360.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00004ZDFY",
        "title": "Dark Cloud",
        "overall": 5,
        "reviewText": "Love it",
        "description": "[\"The threat of world destruction lurks in almost all role-playing games as the inevitable consequence should the hero fail in his quest. In DarkCloud, however, the world is destroyed by a malevolent genie in the very beginning, and it's your job to put it back together. This action/RPG will require you to battle your way through dungeons to collect vital artifacts with which you'll rebuild the game's world in real-time 3-D. From there, you can view the world from above, zoom in, revolve 360 degrees around it, and, of course, explore it for more artifacts to build other parts of the world.\", \"The threat of world destruction lurks in almost all role-playing games as the inevitable consequence should the hero fail in his quest. In <I>DarkCloud</I>, however, the world is destroyed by a malevolent genie in the very beginning, and it's your job to put it back together. This action/RPG will require you to battle your way through dungeons to collect vital artifacts with which you'll rebuild the game's world in real-time 3-D. From there, you can view the world from above, zoom in, revolve 360 degrees around it, and, of course, explore it for more artifacts to build other parts of the world.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B0000CDZBC",
        "title": "Champions of Norrath - PlayStation 2",
        "overall": 3,
        "reviewText": "Ok game",
        "description": "[\"Enter furious hack-and-slash combat set in the world of EverQuest! Choose from 5 different character races with hundreds of spells and abilities at your disposal and over 10,000 items to find. Random dungeon creation means you'll never play the same game twice. Take your adventure online and experience the thrill of multi-player adventure!\", \"Published by the creators of EverQuest and developed by the team behind Baldur's Gate: Dark Alliance, <i>Champions of Norrath</i> is an Action RPG like none other on the PlayStation 2. Create your own champion, each with unique powers, appearances and skills. Experience an epic adventure filled with powerful action and ominous intrigue. Battle vicious monsters where your mastery of weaponry and spells is the only thing between you and supreme evil.\", \"<i>Champions of Norrath</i> allows gamers to create their own unique hero to journey from the city of Faydwer into the wilds of Norrath to save the land from a gathering army of evil orcs and goblins. Players can adventure alone or with a band of up tothree other players either over the Internet or on a single PlayStation 2 with a Multitap. Import player characters into friends' games using a memory card and then take them home to play solo-the play options offer console gamers the freedom to play anytime and from any location. <i>Champions of Norrath</i> offers players more than 100 hours of gameplay per player character, unlimited battles, deadly missions and unmatched character customization in an enthralling fantasy world.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B0053B66KE",
        "title": "Pokemon Y",
        "overall": 5,
        "reviewText": "Love the internet trade feature I rip-off hundreds of people for rare Pokemon",
        "description": "['The Next Evolution in Pokemon comes to Nintendo 3DS.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B0009VXAM0",
        "title": "PlayStation 3 60GB System",
        "overall": 5,
        "reviewText": "Love it",
        "description": "[\"Sony PlayStation 3 60GB (NEW, Unopened, Sealed) Experience the next generation of gaming with the Sony PlayStation 3. It boasts impressive high-definition graphics and multichannel sound that engage you in the on-screen action. And this home entertainment powerhouse goes beyond gaming, offering a wealth of multimedia and networking features. Cutting-edge, high-def graphics and wraparound sound The PlayStation 3&#39;s remarkable performance starts with the Cell ; an efficient, state-of-the-art processor designed from the ground up with next-gen gaming in mind. The Cell and the PS3&#39;s powerful graphics engine work together to pump out high-definition images with realistic textures and elaborate detail. This console can even output games in 1080p to perfectly complement today&#39;s top-of-the-line HDTVs. And you can connect the PS3 to a home theater system to enhance the experience with energetic surround sound ; hear the roar of engines fall behind you as you speed past the competition, or revel in the applause of a stadium full of cheering fans. Backwards Compatible The PlayStation 3 60GB is backward compatible with most PlayStation and PlayStation 2 games, which means you&#39;ll be able to play your favorite games without keeping all the old systems. The console will have slots for Memory Stick Duo, an SD slot and a Compact Flash memory slot. It comes with a pre-installed hard disc drive, which allows you to save games as well as download content from the internet. Even more entertainment choices When you&#39;re ready to take a break from gaming, this multimedia champ has you covered. Its built-in 80GB hard drive offers easy storage for your favorite CDs and digital photos; listen to your tunes through your best speakers, or share your photos on your TV&#39;s crisp, colorful screen. You can also watch DVDs, or even pop in NOTE: This product description has been cut-off (is not complete) due to the size limit of Amazon(.)com's description field.\", '', 'As DVD playback made the PlayStation 2 more than just a game machine, hefty multi-media features make the Sony PlayStation 3 an even more versatile home entertainment machine. Features such as video chat, Internet access, digital photo viewing, and digital audio and video will likely make it the central component of your media set-up. Still, it is first and foremost a game console--a powerful one at that.', '<b>Under the Hood</b><br>The PS3 features IBM\\'s \"Cell\" processor and a co-developed Nvidia graphics processor that makes the system able to perform two trillion calculations per second. That\\'s approximately 320 times more calculations per second than the PS2. Along with the traditional AV and composite connections, it also boasts an HDMI port, which delivers uncompressed, unconverted digital picture and sound to compatible high-definition TV and projectors. The system is capable of 128-bit pixel precision and 1080p resolution for a full HD experience.', \"<b>Blu-Ray is the New Way</b><br> Sony's PlayStation 3 games are encoded onto the Blu-Ray disc media format, which can hold six times as much data as traditional DVDs. This increase in capacity--combined with the awesome power of its processor and graphics card--promises mind-blowing games once developers have learned how to fully harness the new console's power. The PS3 will also support CD-ROM, CD-RW, DVD, DVD-ROM, DVD-R, DVD+R formats.\", \"<b>Sensational Controller</b><br>New gamers intuitively move the controller while playing, even though that movement has traditionally had no relation to what's going on in the game. Sony has picked up on this tendency and is using it to bring a new level of control into the PS3. Inside the controller is a high-precision six-axis sensing system that accurately detects fine movements in pitch, roll, and yaw, as well as three dimensions of movement, to control games. This means that future PS3 games will be controlled by the movements of your hands rather than just your thumbs. For example, you might be able to steer a car by holding the controller like a steering wheel.\", \"While the PS3 controller looks much like its Dual Shock predecessors, it will lack the force-feedback vibration since that would only interfere with the sensing system. It uses Bluetooth 2.0 wireless technology and can support up to seven wireless controllers at a time. It's a hot-swappable system, so if your controller is running low on power, just pause your game and connect a USB 2.0 cable. You can continue playing while your controller recharges automatically.\", \"<b>Plays All PlayStation Games</b><br> The PlayStation 3 will be backward compatible with PlayStation and PlayStation 2 games, which means you'll be able to play all your favorite games without keeping all the old systems. The console will have slots for Memory Stick Duo, an SD slot and a Compact Flash memory slot. It comes with a pre-installed hard disc drive, which allows you to save games as well as download content from the Internet.\", '<b>A Slew of New Games</b><br>A whole host of game publishers are already backing the PS3 and several have even confirmed games for the console. At the 2006 Electronic Entertainment Expo (E3), more than 30 titles were displayed for the system, including <i>Gran Turismo HD</i>, <i>Resistance: Fall of Man</i>, and <i>Final Fantasy XIII</i>. Previously announced titles include <i>Metal Gear Solid 4</i>, <i>Devil May Cry 4</i> and <i>Tekken 6</i>.', '<b>Online</b><br>Sony has stated that the PS3 will have similar online connectivity and services as the next generation of Xbox Live. Calling it \"an always on, always connected device,\" SCEI\\'s chief technical officer Masa Chatani said the PS3 would be constantly in touch with a \"PlayStation World\" network \"fundamentally based on community, communication commerce, and content.\" Technically, the infrastructure is there to make that connection. The PS3 supports 10BASE-T, 100BASE-TX, 1000BASE-T Ethernet, as well as IEEE 802.11 b/g wireless networking protocols.']",
        "domain": "Video_Games"
    }
]