[
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B006JKAS16",
        "title": "Jak &amp; Daxter Collection - Playstation 3",
        "overall": 5,
        "reviewText": "Perfect",
        "description": "['Shipping Height: 0.6 Shipping Width: 5.3 Master Pack Qty: 24 General Information Manufacturer: Sony Corporation Manufacturer Part Number: 98281 Brand Name: Sony Product Name: Jak and Daxter Collection Marketing Information: The critically-acclaimed Jak and Daxter series makes its return with the Jak and Daxter Collection for the PlayStation 3 system. The Jak and Daxter Collection features all three best-selling PlayStation 2 classic hits: Jak and Daxter, Jak II and Jak 3 fully remastered in high definition and stereoscopic 3D. This collection follows fan-favorite Jak and his sidekick Daxter through a series of action-packed adventures. The Jak and Daxter Collection blends action, shooting, driving, and platforming into one complete PS3 package. Distribution Media/Method: Blu-ray Disc Product Type: Software Product Information Software Main Type: Game Software Sub Type: Action/Adventure Game Software Name: Jak and Daxter Collection ESRB Rating: T (Teen 13+) Release Date: 2012-02-07 Platform Supported: PlayStation 3 Miscellaneous Compatibility: DUALSHOCK 3 Wireless Controller PlayStation 3D Display PlayStation 3D Glasses', '<div class=\"singlecolumnminwidth\">   <div class=\"aplus\" >', \"Don't let the pointy ears fool you &mdash; Jak is one elf that no one wants to mess with, as plenty of villains have learned the hard way. Since they first raided your living room on the PlayStation 2, the slightly mischievous, darkly hilarious and ever-tenacious duo, Jak and Daxter have taken you on a wild ride, annihilating enemies, wielding insanely powerful weapons and driving tricked-out machines in their platforming world. There's only one place these heroes haven't taken you &mdash; but that's about to change. Get ready to charge back into action on a whole new plane as Jak and Daxter transport you to the third dimension.\", \"Combining the three complete games of the best-selling PlayStation 2 franchise, the Jak and Daxter Collection offers all the nonstop action you love, now remastered in stereoscopic 3D and high-definition. Journey back to where it all began in Jak and Daxter: The Precursor Legacy, then explore the dark, futuristic world of Jak II as the weapons, abilities and vehicle physics get kicked up a notch. Re-experience the epic climax to the series that leaves Jak and his sidekick battling their way through an unforgiving wasteland and left for dead. In a place where survival of the fittest is the rule of the land, Jak is armed with potent weapons, armor and vehicles as they set out to escape this treacherous world. As they travel, Jak discovers inside himself a new power that is the balance to Dark Jak &mdash; Light Jack. Join Jak for a final adventure where you'll discover the answers to the mysterious Precursors, the mythical Mar, the fate of the world and even more about Jak himself. With Trophy support for each game, the Collection gives you more ways than ever to claim glory on the battleground. Jak and Dexter are back and primed to conquer a new dimension &mdash; are you?<br />\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B003O6EATE",
        "title": "PlayStation Vita - Wifi",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['Sony\\'s PlayStation Vita, previously codenamed \"Next Generation Portable\", is the successor to the PlayStation Portable hardware series. Vita retains the familiar general form of the PlayStation Portable hardware series while dramatically improving on virtually every aspect of its use with powerful and exciting new features including: dual touch pads at the front and rear, dual cameras at the front and rear, dual analog sticks, OLED Multi touch screen (capacitive type).']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00008KTW2",
        "title": "The Hobbit",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['Journey through the dark and harrowing Mirkwood forest and battle Smaug the dragon, who lies in Lonely Mountain. Acquire items, knowledge, and courage to complete the quest.', \"Set in the world of Middle Earth, this detailed, one player fighting/strategy game follows the story of the Tolkien's <i>The Hobbit</i> novel and is best suited for children ages 10 and up. Players steer Bilbo Baggins through places like Mirkwood Forest and Lonely Mountain, battling trolls and collecting gems for courage and health. The graphics are cartoony (like <i>Zelda</i>), but this doesn't take away from the game. We tested the Game Cube version, and found it to be very rich, with eleven different areas to explore.  Strengths include a design that is really easy to either zoom through, or take more time and explore. For example, in the first level, all you need to do is fix a bridge and find a walking stick, and you're done. But you can take much more time and explore if you want to. The only thing we'd fix is to add a running mode -- Bilbo is a little slow at times, and our 16 year old seasoned tester found some of the puzzles really tough. One maze of islands, that requires specially timed jumps, stood out as being frustratingly hard. The bottom line? Buy it, if you're at all interested in <i>The Hobbit</i> book.Copyright &#169; 2001 Children's Software Revue -- <i><a href=https://secure.tradenet.net/childrenssoftware/csroffer.html>From Children's Software Review</a> </i>\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B000TVBCH0",
        "title": "Cabela's Big Game Hunter",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['You feel your pulse quicken as you ready for the shot.\\nThis is your chance for that big game trophy!!']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B005NROW5E",
        "title": "Rig-N-Roll Cut-throat Highway - PC",
        "overall": 5,
        "reviewText": "Friend loves it",
        "description": "[\"It's time to hit the open road! Live out the American dream in the most realistic, biggest and baddest trucking simulator around.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B000P46NMA",
        "title": "Assassin's Creed - Playstation 3",
        "overall": 5,
        "reviewText": "Great game",
        "description": "['<p/> The setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You, Altair, intend to stop the hostilities by suppressing both sides of the conflict. You are an Assassin, a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos, and your existence will shape events during this pivotal moment in history. As an assassin you will master the skills, tactics, and weapons of history&#146;s deadliest and most secretive clan of warriors. Plan your attacks, strike without mercy, and fight your way to escape. <p/> <b>Features:</b><br> <p/> <ul> <li>Experience a living, breathing world in which all your actions have consequences. Crowds react to your moves and will either help or hinder you on your quests <li>Eliminate your targets wherever, whenever, and however. Stalk your prey through detailed and historically accurate environments. Scale buildings, mount horses, blend in with crowds <li>This game immerses you in the Holy Land of the 12th century, featuring life-like graphics, ambiance, and the detail of a living world <li>Find action blended with fluid and precise animations. Use a wide range of medieval weapons, and face your enemies in sword fight duels </ul>', '<i>Assassin?s Creed</i> is the next-gen game developed by Ubisoft Montreal that will redefine the action genre. While other games claim to be next-gen with impressive graphics and physics, <i>Assassin?s Creed</i> merges technology, game design, theme, and emotions into a world where you instigate chaos and become a vulnerable, yet powerful, agent of change.<p/> The setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You, Altair, intend to stop the hostilities by suppressing both sides of the conflict.<p/> You are an Assassin, a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos, and your existence will shape events during this pivotal moment in history.<p/> Key Features <ul> <li><b>Be an Assassin</b>: Master the skills, tactics, and weapons of history?s deadliest and most secretive clan of warriors. Plan your attacks, strike without mercy, and fight your way to escape. <li><b>Realistic and responsive environments</b>: Crowds react to your moves and will either help or hinder you on your quests. <li><b>Action with a new dimension - total freedom</b>: Eliminate your targets wherever, whenever, and however. Stalk your prey through richly detailed, historically accurate, open-ended environments. Scale buildings, mount horses, blend in with crowds. Do whatever it takes to achieve your objectives. <li><b>Relive the epic times of the Crusades</b>: <i>Assassin?s Creed</i> immerses you in the realistic and historical Holy Land of the 12th century, featuring life-like graphics, ambience, and the subtle, yet detailed nuances of a living world. <li><b>Intense action rooted in reality</b>: Experience heavy action blended with fluid and precise animations. Use a wide range of medieval weapons, and face your enemies in realistic swordfight duels. <li><b>Next-gen gameplay</b>: The proprietary engine developed from the ground up for the next-gen console allows organic game design featuring open gameplay, intuitive control scheme, realistic interaction with environment, and a fluid, yet sharp, combat mechanic. </ul>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00GMFKYK8",
        "title": "Middle Earth: Shadow of Mordor - PlayStation 4",
        "overall": 5,
        "reviewText": "Love it",
        "description": "[\"You are Talion, a Ranger of the Black Gate, keeping watch over Mordor which has remained undisturbed for ages. In the blink of an eye, everything is taken from you - your friends, your family, and even your own life. Resurrected by a vengeful spirit, you must now embark on a relentless vendetta against those who have wronged you. Fight through Mordor and uncover the truth of the spirit that compels you, discover the origins of the Rings of Power, build your legend and ultimately confront the evil of Sauron in this new chronicle in Middle-earth. Harness the Spirit of vengeance to inflict brutal combos while mastering powerful new skills and weaponry. Exploit the individual fears, weakness and memories of your enemies as you dismantle Sauron's forces from within. Become the most feared force in Mordor in a new chronicle set before the events of the Lord of the Rings.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1506902400000,
        "asin": "B00KI2OZ9M",
        "title": "Pok&eacute;mon Omega Ruby - Nintendo 3DS",
        "overall": 5,
        "reviewText": "Fun game",
        "description": "[\"Soar high above the Hoenn region on an unforgettable quest to be the very best Pokemon Trainer. As you catch, battle, and train a variety of Pokemon, you'll unleash powerful new Mega Evolutions. Seek out Legendary Pokemon from regions near and far while and uncover the secret powers of Primal Groudon and Primal Kyogre! The Pokemon Omega Ruby and Pokemon Alpha Sapphire games deliver the excitement of the original Pokemon Ruby and Pokemon Sapphire games now reimagined and remastered from the ground up to take full advantage of the Nintendo 3DS and Nintendo 2DS. With new Mega Evolutions of past Pokemon, new characters and stories, new areas to explore, new ways to find and catch Pokemon, and new ways to travel, these games offer hours of entertainment for both current Pokemon fans and players just getting into the series! Broadband Internet access required for online features. For more info, visit official website\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1K99LYWHHRMT7",
        "reviewerName": "jacob",
        "reviewTime": 1507766400000,
        "asin": "B004WLRQMI",
        "title": "The Legend of Zelda: Twilight Princess (Nintendo Selects)",
        "overall": 5,
        "reviewText": "Love it",
        "description": "['When an evil darkness enshrouds the land of Hyrule, a young farm boy named Link must awaken the hero and the animal within. When Link travels to the Twilight Realm, he transforms into a wolf and must scour the land with the help of a mysterious girl named Minda. Using the power and unique control of the Wii console, The Legend of Zelda: Twilight Princess has incredibly precise aiming control. The Wii Remote and the Nunchuk controller are used for a variety of game activities, including fishing and special sword attacks. Players ride into battle against troops of foul creatures using an amazing horseback combat system, then take on massive bosses that must be seen to be believed!', '', 'When an evil darkness enshrouds the land of Hyrule, a young farm boy named Link must awaken the hero and the animal within. When Link travels to the Twilight Realm, he transforms into a wolf and must scour the land with the help of a mysterious girl named Midna. Besides his trusty sword and shield, Link will use his bow and arrows by aiming with the Wii Remote controller, fight while on horseback and use a wealth of other items, both new and old.', \"<b>Link's journeys, reinvented</b><br> Hailed by many as the best Zelda game since 1998's <i>Ocarina of Time</i>, <i>Twilight Princess</i> thrusts players into a troubled world ravaged by a dangerous magic. Sporting a new, more realistic visual style than the previous Zelda title, Link looks much more like an adult than in previous installments and fits well into an environment that provides Zelda fans with a much more gritty and grim environment to explore. The entirety of the quest fits this darker mood, as both Link and NPC's alike share the same concern for the changes about in Hyrule.\", 'More than just a spiritual successor to previous Zelda installments, <i>Twilight Princess</i> offers players a new way of controlling Link through dungeons, forests, towns, and the bizarre Twilight Realm: precise weapon controls with the Wii remote! Players can use the remote to control Links\\' weapons including the sword, arrows, and boomerang. This new control scheme allows for much faster and more accurate control than on previous Nintendo hardware. For example, waving the remote in the air will result in Link performing the same move with the sword. To fire off on arrow, players \"pull back\" on a virtual controller string as the Wii remote\\'s speaker lets players know that the projectile is ready for release. It all works incredibly well and adds to the title\\'s immersion and style- you feel more in the center of the action than in previous Zelda games.', 'As impressive as the new control scheme is, the scope and size of the new land of the Hyrule is equally as impressive- truly the Wii\\'s first epic adventure. Beautifully crafted and four years in the making, the land players travel through is vast and diverse as the dungeons and monsters that lie within. As players collect triforce pieces from the distant sections of the continent, they will get to know many different villages and foes. Thankfully, Link will be able to move over long stretches of land faster thanks to \"Epona,\" your faithful horse. Epona also helps Link become a more effective fighter, as a number of powerful and impressive sword strikes can be launched while galloping through fields of enemies.', '<b>The Twilight Realm awaits</b><br> Like most games in the Zelda franchise, Link begins his adventure with little more than the clothes he has on an an inkling that something has gone awry. After an initial trip to the Twilight Realm, in which Link appears as a wolf, a friendly shadow dweller named Midna will meet up with players and give helpful advice on gameplay. Fortunately for players, this virtual assistant spells out ways to be a more effective adventurer in and out of the shadow world. Early stages of the game have Link spending a lot of time in the Twilight Realm, and outdoor areas of Hyrule, attempting to clear areas of the strange darkness that has seemingly fallen over every village, forest, and field. As the story progresses, players will learn the cause of the shadows, and what they must to do vanquish them for good.', \"<b>Puzzling puzzles</b><br> Link once again finds himself in a number of classic Zelda-esque puzzle scenarios in which he must light torches to unlock doors, raise and lower water levels, and fight enemies to collect keys and open chests for valuable rupees. A number of the dungeons present unique puzzle challenges that rely on the player's ability to hone their Wii remote's control, such as an air castle in the sky that can only be accessed by an extremely accurate grappling hook toss.\", \"In general, <i>Twilight Princess</i> is more challenging than the average Zelda game, with a number of boss battles having protracted hit sequences with little support potions about, and even less warning. Still, there's never been an adventure experience such as this, wherein players can literally charge at a dungeon boss with their fists and punch the air to defeat an enormous foe. As the finest Zelda experience in almost ten years and the game fans have been waiting for, <i>Twilight Princess</i> will delight young and old gamers alike.\"]",
        "domain": "Video_Games"
    }
]