[
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1422835200000,
        "asin": "160061180X",
        "title": "Shojo Fashion Manga Art School: How to Draw Cool Looks and Characters",
        "overall": 5,
        "reviewText": "Was a gift, she loved it, and found it very helpful.",
        "description": "['Grade 6 UpFlores explains how to create characters with a manga flair. Through black-and-white and color artwork, she provides the basics of figure drawing, specifically teenaged characters. Step-by-step instruction includes heads, facial features, and bodies. Posing and settings are briefly covered. The illustrations incorporate blue pencils for the initial sketches, then finishing with detailed pencils and inks. The premise is that an understanding of human anatomy is key to good character design, and essential for drawing attire. Half of the book is devoted to drawing garments, starting with folds, then pieces of clothing. The underlying body, sketched in blue or red, shows how it affects the shape of what the person is wearing. Characters sport trendy, but not otherworldly, outfits. Absent are the magical girls and costumed ninjas. The author\\'s approach is that with a few variations on the standard figure, you can make your character design \"mangalike.\" Chris Hart\\'s<i>Manga Mania Romance: Drawing Shojo Girls and Bishie Boys</i> (Sixth &amp; Spring, 2008) and Colleen Doran\\'s <i>Girl to Grrrl Manga: How to Draw the Hottest Shoujo Manga</i> (Impact, 2007) provide wider and deeper coverage of art techniques, special effects, and other conventions distinctive to Japanese manga.<i>June Shimonishi, Torrance Public Library, CA</i> <br />Copyright  Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.', '', '\"Good for any age group as it\\'s not text heavy, [and is] well written. I must say that this book is one of the nicer drawn and laid out Western How to Draw Manga books out there. Pick it up if you\\'re into this subject and need a decent drawing book. It\\'s one book I doubt will ever become out of print.\" --<i>Manga Tutorials</i>', '\"This guide contains everything you need to know to create fabulous shojo manga characters with personality.\" --Arts Book Mix', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1422835200000,
        "asin": "0786960345",
        "title": "Ed Greenwood Presents Elminster's Forgotten Realms: A Dungeons &amp; Dragons Supplement",
        "overall": 4,
        "reviewText": "I don't really play any more, I mostly just collect the Forgotten realms series of novels for my fix of D&D worlds. First I have to say I love the cover feels like a sexy leather bound book that just begs to be handled! lol  As for the book(So far) My only complaint falls on content which the book addresses by stating it more of a seldom shared aspects & details about the Realms & it's peoples, but in the end I still would of preferred more content. with that being said, it's a Very enjoyable throne room read. ;-)",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1427500800000,
        "asin": "0786954981",
        "title": "The Erevis Cale Trilogy",
        "overall": 5,
        "reviewText": "Very good series, Erevis Cale is a welcome character to the Forgotten realms world, pick it up if your a fan!",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1434758400000,
        "asin": "0786965223",
        "title": "The Companions: The Sundering, Book I",
        "overall": 5,
        "reviewText": "They're back! always a great read another not to be missed!",
        "description": "[\"R.A. Salvatore is the <i>New York Times</i> best-selling author of more than forty novels, including the popular Forgotten Realms series The Legend of Drizzt. He's an avid gamer, father of three, and loyal citizen of Red Sox Nation.\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1434758400000,
        "asin": "0375813616",
        "title": "Junie B. Jones's First Boxed Set Ever! (Books 1-4)",
        "overall": 2,
        "reviewText": "She was not to happy with this series, she didn't like the main characters attitude.",
        "description": "['Outrageously sassy Junie B. Jones will make young kids crave their daily dose of reading. And with this handy four-volume boxed set, whether they start with <i><a href=\"/exec/obidos/ASIN/0679851011/${0}\">Junie B. Jones and Some Sneaky Peeky Spying</a></i> or <i><a href=\"/exec/obidos/ASIN/0679844074/${0}\">Junie B. Jones and Her Big Fat Mouth</a></i>, readers will laugh out loud at Junie B.\\'s hilarious mishaps and breathtakingly horrible grammar. Although the books should come with a caveat--Kids, don\\'t try this syntax at home!--alert parents and teachers can use her malapropisms as learning opportunities for their impressionable charges. The set contains the first four titles in Barbara Park\\'s extensive series (energetically illustrated by Denise Brunkus), including <i><a href=\"/exec/obidos/ASIN/0679838864/${0}\">Junie B. Jones and a Little Monkey Business</a></i> and <i><a href=\"/exec/obidos/ASIN/0679826424/${0}\">Junie B. Jones and the Stupid Smelly Bus</a></i>. All are great for reading aloud. (Ages 5 to 8) <i>--Emilie Coulter</i>', 'BARBARA PARK (19472013) is beloved by millions as the author of the wildly popular Junie B. Jones series. She is also the author of award-winning middle-grade novels and picture books, including<i>Skinnybones</i>and<i>Mick Harte Was Here</i>. We are thankful for the laughter shes given us and to millions of children.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1434758400000,
        "asin": "0736431217",
        "title": "JOURNEY TO THE ICE P",
        "overall": 5,
        "reviewText": "Girls love it...",
        "description": "['', '']",
        "domain": "Books"
    }
]