[
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1418860800000,
        "asin": "B00543R3WG",
        "title": "Harry Potter - Complete 8-Film Collection",
        "overall": 5,
        "reviewText": "Great series, one of the few movie series that they simply keep getting better, & it looks & sounds fantastic on Blu Ray!",
        "description": "['Quick Shipping !!! New And Sealed !!! This Disc WILL NOT play on standard US DVD player. A multi-region PAL/NTSC DVD player is request to view it in USA/Canada. Please Review Description.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1427500800000,
        "asin": "B00LSW76MO",
        "title": "Dracula Untold 2014",
        "overall": 5,
        "reviewText": "Was a very good rendition of the Tale of Dracula, As usual Hollywood raped the real history of Dracs, so long as you can over look this aspect and take it as just another retelling of a tale it's very enjoyable, it's very similar to Lords of Shadow Castlevainia game, there are scenes that were definitely ripped out of the game and on to the screen...which ironically is some of the best aspects of the movie. lol",
        "description": "[\"Gary Shore directs and Luke Evans stars in this fantasy horror origin story. The film follows Vlad Tepes (Evans) and his struggle to protect his family and his people from the malevolent Ottoman sultan Mehmed (Dominic Cooper), whose ever-expanding empire has put Vlad's homeland in danger of being conquered. Desperate to find a solution, Vlad seeks the help of a mysterious man (Charles Dance) who grants him the powers to defeat his enemy. But do these newly-gained powers come at too high a price?\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1427500800000,
        "asin": "B00SJFG6L0",
        "title": "Blade Trilogy",
        "overall": 5,
        "reviewText": "Been waiting for this collection for a while, they did a good job with the conversion to HD Visuals & sound, A Must have of any Fan! Not to mention no over bloated pricing for the collection! <3",
        "description": "['<![CDATA[', 'Blade / Blade 2 / Blade: Trinity (BD)(3FE)', 'BLADE - Wesley Snipes stars as the tortured soul Blade, who is half man, half immortal. Blade sharpens his lethal skills under the guidance of Whistler  his mentor, guardian and fellow hunter of the night. When the bloodthirsty Immortals lord, Deacon Frost, declares war on the human race, Blade is humanitys last hope for survival. BLADE II - Guillermo del Toro directs this high-voltage adventure from screenwriter David S. Goyer. When the world is threatened by a new and deadlier breed of super vampire, Blade and Whistler join forces with an elite team of vampire warriors made up of Blades sworn enemies to stop the carnage and destroy the ravenous fiends. BLADE: TRINITY - For years, Blade has fought the vampires under the cover of night. But after falling into the crosshairs of the FBI, he is forced into the daylight, where he joins forces with a clan of human vampire hunters, the Nightstalkers. Together with two deftly trained Nightstalkers, Blade follows a trail of blood to the original vampire: Dracula.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1427500800000,
        "asin": "B00YI71PN2",
        "title": "STAR WARS: The Complete Saga (Episodes I-VI) [Russian Import, English included by default, Region Free]",
        "overall": 5,
        "reviewText": "Looks & sounds great! wanted to pick up this series for a while now, and I was not disappointed, don't understand whats all the hate going on over the added scenes and some changes, it still feels like the same Star wars I grew up with!",
        "description": "['Star Wars: The Complete Blu-ray Saga will feature all six live-action Star Wars feature films utilizing the highest possible picture and audio presentation. Star Wars Episode I: The Phantom Menace Star Wars Episode II: Attack of the Clones Star Wars Episode III: Revenge of the Sith Wars Episode IV: A New Hope Star Wars Episode V: The Empire Strikes Back Star Wars Episode VI: Return of the Jedi']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1431216000000,
        "asin": "B00003CXWJ",
        "title": "Spy Kids",
        "overall": 5,
        "reviewText": "Kids love it have already watched it about 10 times now, great show for the whole family.",
        "description": "['Genre: Family Stars Antonio Banderas, Carla Gugino, Alexa Vega and Daryl Sabara. Written and directed by Robert Rodriguez. DVD features: - Theatrical trailer - Theatrical teasers &#169;2002 Disney Enterprise Inc.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1434758400000,
        "asin": "B001GCUO16",
        "title": "X-Men Origins: Wolverine",
        "overall": 5,
        "reviewText": "They did a good job with Wolverine, unlike most other Marvel characters in the series....",
        "description": "['Heroic Hugh Jackman breathes the fire into Wolverine (Miami Herald)  with a vengeance! This pulse-pounding action thriller sinks razor-sharp adamantium claws into the mysterious origins of Logan/Wolverine: his epically violent and romantic past, his complex relationship with Victor Creed/Sabretooth (Liev Schreiber), and the ominous Weapon X program that unleashes his primal fury. Along the way, Wolverine also encounters legendary new mutants, including Deadpool (Ryan Reynolds) and Gambit (Taylor Kitsch). Youll go berserker for this deeper, darker, more-spectacular-than-ever chapter of the X-Men saga!']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1461542400000,
        "asin": "B00V950K3C",
        "title": "Lucy",
        "overall": 5,
        "reviewText": "Good Movie, underrated!",
        "description": "['Lucy Blu-ray + DVD + Digital Copy (Steelbook)']",
        "domain": "Movies_and_TV"
    }
]