[
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1422835200000,
        "asin": "B00F2Y1CH4",
        "title": "dreamGEAR  Xbox One Dual Charging Dock.  Charge up to two Xbox One Controllers Simultaneously",
        "overall": 5,
        "reviewText": "Fast charging! Looks fantastic! Compact! it's simply Great!",
        "description": "['The dreamGEAR Dual Charging Dock for Xbox One conveniently charges up to 2 Xbox One controllers simultaneously. Each controller has its own LED charge indicator. The Charging Dock includes 2 rechargeable batteries and plugs directly into the Xbox One with a USB cable.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1422835200000,
        "asin": "B00KSQHX1K",
        "title": "Halo: The Master Chief Collection",
        "overall": 5,
        "reviewText": "SIMPLY AMAZING!!!!!!!!! MUST OWN FOR EVERY XBOX ONE OWNER! only complaint was they didn't remaster part 3 & 4 as they did with 1 & 2, but they made up for it in so many other ways with so many options for multi-player & mission modes.",
        "description": "['', 'THE SEEDS OF OUR FUTURE ARE SOWN IN HIS PAST.', 'For the first time ever, The Master Chiefs entire story is on one console. Featuring a re-mastered Halo 2: Anniversary, along with Halo: Combat Evolved Anniversary, Halo 3, and Halo 4, new digital series, Halo: Nightfall, and access to the Halo 5: Guardians Beta, this is the definitive Halo experience.', '*Halo: Nightfall: 5 episode live action series is streaming only, with episodes releasing on a weekly basis. Xbox One or Windows 8.1 and broadband internet required; ISP fees apply. Halo 5: Guardians Beta: Game disc required. Limited Time Beta Starts: December 27, 2014; Ends: January 22, 2015. Must be 17+. Xbox One, broadband internet (ISP fees apply) and Xbox Live Gold membership (sold separately) required. Halo: Nightfall and Halo 5: Guardians Beta dates, content, and features subject to change. See www.xbox.com/halo', '*Some game features, including hidden terminal videos, require broadband internet; ISP fees apply. Online multiplayer features require Xbox Live Gold membership (sold separately). Halo 5: Guardians sold separately; release date not yet announced. Halo: Nightfall: 5 episode live action series is streaming only, with episodes releasing on a weekly basis. Xbox One or Windows 8.1 and broadband internet required; ISP fees apply. Halo 5: Guardians Beta: Game disc required. Limited Time Beta Starts: December 27, 2014; Ends: January 22, 2015. Must be 17+. Xbox One, broadband internet (ISP fees apply) and Xbox Live Gold membership (sold separately) required. Halo: Nightfall and Halo 5: Guardians Beta dates, content, and features subject to change. See www.xbox.com/halo']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1422835200000,
        "asin": "B000B6MLPU",
        "title": "Microsoft Xbox 360 Component HD AV Cable",
        "overall": 5,
        "reviewText": "Worked perfect for an older 50\" Plasma I pawned off in the kids room for their Xbox 360.",
        "description": "[\"The Xbox 360 Component Cable is the all-in-one solution for high-definition and standard TVs. Featuring a high-definition gaming output of 720p or 1080i, the Xbox 360 Component HD AV Cable is equipped with a progressive-scan DVD playback in 480p. Featuring Dolby Digital 5.1 Surround Sound output and component (Y, Pr, Pb) high-definition video output, this shielded Xbox Component Cable is also 8' long.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1422835200000,
        "asin": "B00CJ7IUGS",
        "title": "The Elder Scrolls V: Skyrim - Legendary Edition, XBOX 360",
        "overall": 5,
        "reviewText": "Nothing to say other then if you own a Xbox 360 you should own this game! it's simply AMAZING IN EVERY POSSIBLE WAY!!!! only complaint is that consoles don't support modifications.",
        "description": "['Winner of more than 200 Game of the Year awards, experience the complete Skyrim collection with The Elder Scrolls V: Skyrim Legendary Edition, including the original critically-acclaimed game, official add-ons  Dawnguard, Hearthfire, and Dragonborn  and added features like combat cameras, mounted combat, Legendary difficulty mode for hardcore players, and Legendary skills  enabling you to master every perk and level up your skills infinitely.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1427500800000,
        "asin": "B00CMQTUSS",
        "title": "Xbox One Wireless Controller (Without 3.5 millimeter headset jack)",
        "overall": 5,
        "reviewText": "Huge improvement over the old Xbox 360 controllers in every way!",
        "description": "[\"Experience the action like never before with the Xbox One Wireless Controller. New Impulse triggers deliver fingertip vibration feedback, so you can feel every jolt and crash in high definition. Redesigned thumbsticks and an all new D-pad provide greater precision. And the entire controller fits more comfortably in your hands. There's also a new expansion port with high-speed data transfer for clearer chat audio when using a compatible headset. With over 40 innovations, it's simply the best controller Xbox. has ever made. Includes two AA batteries.\", '<div class=\"aplus\"> <div class=\\'leftImage\\'> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CMQTUSS_XboxOne_Controller_F_TransBG_RGB_2013.jpg\\'> <img src=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CMQTUSS_XboxOne_Controller_F_TransBG_RGB_2013_sm.jpg\\' alt=\\'\\' width=\\'350\\' height=\\'265\\'/> </a> <div class=\\'imageCaption\\'> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CMQTUSS_XboxOne_Controller_F_TransBG_RGB_2013.jpg\\' target=\\'\\'><br>view larger</a> </div> </div> <div class=\\'rightImage\\'> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CMQTUSS_XboxOne_Controller_RHS78_TransBG_RGB_2013.jpg\\'> <img src=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CMQTUSS_XboxOne_Controller_RHS78_TransBG_RGB_2013_sm.jpg\\' alt=\\'\\' width=\\'350\\' height=\\'226\\'/> </a> <div class=\\'imageCaption\\'> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CMQTUSS_XboxOne_Controller_RHS78_TransBG_RGB_2013.jpg\\' target=\\'\\'><br>view larger</a> </div> </div> <h5>Unparalleled precision and comfort.</h5>', \"The best gaming controller just got better with over 40 technology innovations. New Impulse Triggers deliver precise fingertip feedback for more realistic experiences. We have streamlined the thumbsticks, D-pad, and contours for improved precision and comfort in your hands. Simply put, it is the best controller we've ever made.<sup>3</sup>\", \"<b><a href='http://www.amazon.com/dp/B00CMQTVK0'>Find the Xbox One console here.</a></b>\", '<b>Xbox One</b> delivers an entertainment experience like nothing before. Its innovative technology is rivaled only by its iconic design. Sharp corners and clean lines make for a sleek, modern console that complements any decor. Xbox One was designed from the ground up to be the centerpiece of every living room.', 'An 8-core x86 processor lets you instantly switch between a game and your entertainment apps with ease.', 'Connect your cable or satellite box to your Xbox One and prepare for lift off. HDMI pass-thru enables you to watch TV through your Xbox, which makes switching inputs seem almost pre-historic.<sup>1</sup>', '8GB of RAM and a 500GB hard drive give you plenty of memory for your games, demos, movies, apps, music, and more.<sup>2</sup>', 'Watch movies and play games in stunning HD with a Blu-ray player.', '<small>1: Supported television tuner or cable/satellite set top box with HDMI output and HDMI cable required (all sold separately).</small>', '<small>2: Xbox One system software uses a significant amount of storage; less internal storage will be available to users. 500 GB = 500 billion bytes.</small>', '<small>3: In supported games.</small>', '<small>Features and requirements are under development and may change prior to release. Available features and content may vary by country. Broadband internet (ISP fees apply) and advanced TV hardware required. Games sold separately.</small>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1427500800000,
        "asin": "B00DTWEOZ8",
        "title": "Titanfall [Online Game Code]",
        "overall": 4,
        "reviewText": "Great Game for both as a FPS & Mech fighter fast pace & lots of fun easy to get in and frag without a steep learning curve, would be better if they took the time to add a single player campaign mode with both factions similar to the old school Mech-warrior, and add some jump jets while there at it. ;-)",
        "description": "['', 'Prepare for <i>Titanfall</i>. Crafted by one of the co-creators of Call of Duty and other key developers behind the Call of Duty franchise, Titanfall is an all-new universe juxtaposing small vs. giant, natural vs. industrial and man vs. machine. The visionaries at Respawn have drawn inspiration from their proven experiences in first-person action and with Titanfall are focused on bringing something exciting the next generation of multiplayer gaming.', '<b>KEY FEATURES</b>', '<b>RECORD SETTING 6 GAME CRITIC AWARD WINS!</b>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1434758400000,
        "asin": "B0050SWA1E",
        "title": "Kinect Nat Geo TV - Xbox 360",
        "overall": 3,
        "reviewText": "It's ok, 2/3 of it is merely movies for them to watch after a couple of times they quickly got bored of them and wanted to skip to the interactive parts which were fairly short and similar to a short game on Kinect Party.  while great for a couple times it lacks any real replay value for the price your better off getting Kinect party which the kids & adults love, only down side is it lack some educational aspects.",
        "description": "['Kinect Nat Geo TV blends world-renowned Nat Geo WILD TV show episodes with intuitive Kinect for Xbox 360 technology, transporting kids and their families around the world to expand their knowledge while inspiring a sense of wonder and excitement. Through the magic of Kinect reach in and explore interactivity, do more than just watch episodes  engage, play and learn as Kinect Nat Geo TV turns your living room into an animal habitat and you into a variety of animals, such as a bear, without ever leaving your living room. The National Geographic Society aims to excite and empower kids about their world through stunning photography and video, amazing facts, and engaging storytelling combined with a dynamic interactive experience. Together, Nat Geo WILD TV and National Geographic Kids and Games with Kinect Nat Geo TV deliver the ultimate dynamic interactive TV experience that inspires kids to care about the planet. Solve mystifying puzzles, learn about the natural environment, and get to know exotic animals and find inspiration to care for the planet. During the episodes, visual effects will superimpose over the screen representing interactive experiences that players can select and engage with. In addition, Kinect Nat Geo TV will provide access to archived episodes of Nat Geo WILD TV programs through Kinect.* Kinect Nat Geo TV is just one of the new playful learning experiences available for Kinect that provide children and families with entirely new ways to learn while having fun and being entertained through interactive TV. *Xbox LIVE (free) membership and additional fees apply.', '<div class=\"aplus\" > <div class=\"leftImage\" style=\"width: 450px; padding-right:20px;\"> <img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/NatGeoTV_showcase_main.jpg\" alt=\"Kinect Nat Geo TV\" width=\"450\" height=\"571\" border=\"0\" usemap=\"#Map\"> <map name=\"Map\"> <area shape=\"rect\" coords=\"10,483,148,561\" href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/NatGeoTV_showcase_1.jpg\" alt=\"Kinect Nat Geo TV Screenshot 1\" onClick=\"window.open(this.href,null,\\'width=801,height=451\\'); return false;\"> <area shape=\"rect\" coords=\"155,483,293,561\" href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/NatGeoTV_showcase_2.jpg\" alt=\"Kinect Nat Geo TV Screenshot 1\" onClick=\"window.open(this.href,null,\\'width=801,height=451\\'); return false;\"> <area shape=\"rect\" coords=\"302,483,440,561\" href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/NatGeoTV_showcase_3.jpg\" alt=\"Kinect Nat Geo TV Screenshot 1\" onClick=\"window.open(this.href,null,\\'width=801,height=451\\'); return false;\"> </map> </div> <h4>Kinect Nat Geo TV</h4> &#8220;Kinect Nat Geo TV&#8221; blends world-renowned Nat Geo WILD TV show episodes with intuitive Kinect for Xbox 360 technology, transporting kids and their families around the world to expand their knowledge while inspiring a sense of wonder and excitement. Through the magic of Kinect &#8220;reach in and explore&#8221; interactivity, do more than just watch episodes &#8212; engage, play and learn as &#8220;Kinect Nat Geo TV&#8221; turns your living room into an animal habitat and you into a variety of animals, such as a bear, without ever leaving your living room.', '<br> The National Geographic Society aims to excite and empower kids about their world through stunning photography and video, amazing facts, and engaging storytelling combined with a dynamic interactive experience. Together, Nat Geo WILD TV and National Geographic Kids and Games with &#8220;Kinect Nat Geo TV&#8221; deliver the ultimate dynamic interactive TV experience that inspires kids to care about the planet.', 'Solve mystifying puzzles, learn about the natural environment, and get to know exotic animals and find inspiration to care for the planet. During the episodes, visual effects will superimpose over the screen representing interactive experiences that players can select and engage with. In addition, &#8220;Kinect Nat Geo TV&#8221; will provide access to archived episodes of Nat Geo WILD TV programs through Kinect.*', '&#8220;Kinect Nat Geo TV&#8221; is just one of the new playful learning experiences available for Kinect that provide children and families with entirely new ways to learn while having fun and being entertained through interactive TV.', '<em>* Xbox LIVE (free) membership and additional fees apply.</em>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1434758400000,
        "asin": "B00TEDK8FQ",
        "title": "Ortz PS4 Vertical Stand with Cooling Fan [Dual Charger Ports] Premium Quality Controller Charging Station for PlayStation 4 Dualshock Charger [Not for Slim PS4]",
        "overall": 4,
        "reviewText": "It's great only complaint I have is it doesn't have it's own separate power adapter it uses a usb connection, which can be fixed by buying a separate usb power adapter.",
        "description": "['Ortz PS4 Vertical Stand with Cooling Fan [Dual Charger Ports] Premium Quality Controller Charging Station for PlayStation 4 Dualshock Charger [Not for Slim PS4].<br><br>ULTIMATE COOLER - Keep your Playstation 4 cool and calm with the vertical cooling stand. No worrying about your ps4 overheating and burning your table from long hours of game play.<br><br>FREE CHARGING STATION - Not only does this keep your playstation 4 from over-heating, it also sports a dual charging station to charge both your controllers simultaneously using the built in usb ports.<br><br>Vertical Play - Normally your ps4 sits horizontal taking up space within your room. However, with this vertical stand, your ps4 now stands vertically, saving you lots of room space while cooling your ps4 at the same time.<br><br>UNIQUE APPEARANCE - This Vertical Stand is cool in both ways. Its fan keeps the system cooling at the same time looking cool in itself due to the unique design and charging docks included.<br><br>CONVIENIENCEP- Save Space, time and charge your two controllers at the same time without having to worry where to keep your accessories. Its simply convenience at its best.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1466985600000,
        "asin": "B0050SYGY8",
        "title": "Karaoke Revolution Glee: Volume 3 Bundle -Xbox 360",
        "overall": 3,
        "reviewText": "Mediocre at best, very limited songs only positive is it came with extra mic.",
        "description": "['Get ready to &#x2019;gleek out&#x2019; like never before with the McKinley High GLEE Club in Karaoke Revolution Glee:  Volume 3!  The hit franchise returns with the largest lineup of all-new show hits and music performances to date. Karaoke Revolution Glee: Volume 3 boasts up to 35 chart-topping tunes, filled with the show&#x2019;s main characters and show-stopping performances from Season 2!  Put yourself at center stage and experience the GLEE phenomenon this Holiday 2011.', '<div class=\"singlecolumnminwidth\">    <div class=\"aplus\" >', \"Last season, you were a newbie to the drama, the competition and the slushies that go along with being a Gleek. But this is season two, and you can sing your way through anything that might come your way &mdash; whether it's a Britney Spears invasion, the Time Warp, a beastly new football coach or your old arch nemesis, Sue Sylvester. School is back in session at McKinley High &mdash; so sharpen your pencils and your vocal skills and get ready to shine like never before in an all-new volume of Glee performances.\", \"Get ready to Gleek out with the largest-ever lineup of your favorite Glee tunes &mdash; a whopping 35-song set list that would even have Rachel Berry squealing with joy. This time, Karaoke Revolution Glee: Volume 3 goes deeper into McKinley High than ever before as the a cappella action comes to you in stunning high-definition for the first time. Take center stage with Rachel, Finn, Mr. Schuester and the rest of the New Directions, grab the included microphone and sing your heart out to the greatest hits of season two. Prove you have a voice worthy of Regionals as you take on unforgettable performances from your favorite new episodes, including &quot;Britney/Brittany,&quot; &quot;Auditions,&quot; and &quot;The Rocky Horror Glee Show.&quot; Gather up all of your fellow Gleeks and find out who among you has Nationals-worthy talent as you compete in six-player singing games. Once you've blown your friends' vocal chords out of the water, check out how you rank in the world with online leaderboards. You're a loyal Glee fan &mdash; but do you have what it takes to top the charts as you bring season two to life in your living room?<br />                               <br /><br />\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1466985600000,
        "asin": "B00RKK11O2",
        "title": "Halo 5: Guardians - Limited Edition (Physical Disc) - Xbox One",
        "overall": 5,
        "reviewText": "Long time fan, and Halo is still living up to it's great storyline & gameplay.",
        "description": "['', 'Lock and load with the Halo 5: Guardians Limited Edition which includes the Warzone REQ Bundle - 14 Premium Requisition packs to enhance Spartan combat. <br /><br /> <b>The Limited Edition also contains:</b><br />']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1466985600000,
        "asin": "B00BGAA3S2",
        "title": "PlayStation 4 Camera (Old Model)",
        "overall": 3,
        "reviewText": "Nothing really to say other then meh doesn't really do much for you maybe recognize you as a user for auto log in,....will become more valued once they introduce their VR unit.",
        "description": "[\"Broadcast yourself in play with PlayStation Camera. Become a community sensation by adding a picture-in-picture video of yourself in gameplay live streams. Create and share narrated game walkthroughs in HD video and voice chat through four built-in microphones. Enjoy stunning new levels of immersion as the 3D depth-sensing camera and DUALSHOCK4 wireless controller's light bar track player movements through space. Log in instantly with facial recognition and navigate PS4 system menu hands-free with voice inputs.\"]",
        "domain": "Video_Games"
    }
]