[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "1408089025",
        "title": "Introduction to Psychology",
        "overall": 5,
        "reviewText": "Knowledge is power.....especially when it's free!",
        "description": "['Susan Nolen-Hoeksema, Ph.D. who died unexpectedly in January 2013 was Professor of Psychology at Yale University. She received her B.A. in psychology from Yale University and her Ph.D. in clinical psychology from University of Pennsylvania. Nolen-Hoeksemas research focuses on womens greater rates of depression compared to men and on the effects of rumination in depression. In addition to her peer-reviewed journal articles, she has published 12 books, including scholarly books, textbooks and books for lay audiences. Nolen-Hoeksema has won three major teaching awards and several awards for her research, including the David Shakow Early Career Award from the American Psychological Association (APA), the Leadership Award from the Committee on Women of the APA, and a Research Career Award from the National Institute for Mental Health.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "1455751553",
        "title": "Robbins and Cotran Review of Pathology (Robbins Pathology)",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['Vinay Kumar, MBBS, MD, FRCPath, Alice Hogge and Arthur A. Baer Distinguished Service Professor of Pathology, Biological Sciences Division and The Pritzker Medical School, University of Chicago, Chicago, Illinois', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "1437717810",
        "title": "Robbins Basic Pathology: with STUDENT CONSULT Online Access (Robbins Pathology)",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['\"This excellent book is ideal for medical students to read cover-to-cover. Although the main textbook is an unbeatable resource, its size makes it unrealistic that medicals students could completely digest it. This version strikes a good balance, still providing students with an in-depth discussion of disease process, but avoiding an overwhelming list of entities.\"- Carmen Winters, BS (University of Kansas Medical Center) Doody Review Services', 'Vinay Kumar, MBBS, MD, FRCPath, Alice Hogge and Arthur A. Baer Distinguished Service Professor of Pathology, Biological Sciences Division and The Pritzker Medical School, University of Chicago, Chicago, Illinois', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "111865708X",
        "title": "Adult Psychopathology and Diagnosis",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['', '<b>Reflecting <i>DSM-5</i> definitions and criteria, the mostup-to-date coverage of adult psychopathology</b>', 'Like its predecessors, this edition of <i>Adult Psychopathologyand Diagnosis</i> presents a balanced integration of empirical dataand diagnostic criteria, resulting in a comprehensive understandingof diagnosis. It has been revised to include the most currentresearch in psychopathology, capturing both major changes to thefield and nuanced findings that affect clinical practice.', '<i>Adult Psychopathology</i> provides detailed coverage of 16disorder categories, including:', '', '', '<b>DEBORAH C. BEIDEL, P<small>H</small>D,</b> is a professor ofpsychology and Director of Clinical Programs at the University ofCentral Florida. She is the author of over 200 scientificpublications.', '<b>B. CHRISTOPHER FRUEH, P<small>H</small>D,</b> is the Directorof Clinical Research at The Menninger Clinic and a professor ofpsychology at the University of Hawaii. He has over 150professional publications.', '<b>MICHEL HERSEN, P<small>H</small>D, ABPP,</b> was a professorand Dean of the School of Professional Psychology at PacificUniversity. He has co-authored and co-edited 146 books and haspublished 226 scientific journal articles.', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "0323023932",
        "title": "Rapid Review Pathology",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['Edward F. Goljan, MD, Professor and Chairman of Pathology, Oklahoma State University, College of Osteopathic Medicine, Tulsa, OK', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "0071630201",
        "title": "Junqueira's Basic Histology: Text and Atlas, 12th Edition",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['', '<b>Anthony L. Mescher, Ph.D.</b> is Professor of Anatomy and Cell Biology at the Indiana University School of Medicine, Bloomington, IN', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418688000000,
        "asin": "0470577711",
        "title": "Chemistry: The Molecular Nature of Matter",
        "overall": 5,
        "reviewText": "Got this for $25 used in excellent condition!  Can't go wrong.  The current price new is atrocious, and I bought it for only $8 more than the rental price.  What a deal!  Just what I needed for my general chem courses and MCAT studies.",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1422576000000,
        "asin": "0536968640",
        "title": "Fundamentals of College Physics, Vol. 1, 5th Updated Edition",
        "overall": 1,
        "reviewText": "The price of this textbook is DISGUSTING.  I don't understand how the bookstore can charge students $205 for this textbook.  It's paperback and there are NO color photos in it.  Everything is black-and-white.  On top of that, Chapter 13 on Fluids has a misprint on the bottom of each page, where the chapter is instead titled Simple Harmonic Motion.  I don't know what gives Dr. Nolan the right to charge all of his students $205 for this textbook due to the above facts.  Even the bookstore cashier gave a disgusted remark about the price!  Seriously, this book costs as much as one college credit at Farmingdale State College!  It's atrocious.\n\nP.S.  This is only Volume ONE.  I took a look at Volume 2, and it costs even MORE than Volume 1.  If you're going to take College Physics, I suggest taking it at a different institution.",
        "description": "['great college book', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1424390400000,
        "asin": "1505680611",
        "title": "MCAT Biology and Biochemistry: Content Review for the Revised MCAT",
        "overall": 1,
        "reviewText": "I purchased the full set of Content Review books from the NextStep website in January, and at the time, they were having delays in processing because of typographical errors located in their (then) current books. When I received the new books, I still found spelling errors in many locations, and to give you an example of a glaring error, the structure of ATP on page 339 is incorrect. There should be 3 phosphate groups showing in the picture, not 2. But enough on the typos that are still there....\n\nThe authors did a good job laying out the AAMC topic outlines for biology and biochemistry in the beginning of the book; however, they failed to follow it completely. Let's start with the Biology half of the book. First of all, nothing is mentioned about \"Biotechnology/DNA Technology\" and \"Genetic Expression in Prokaryotes\" (lac operon, repressors, etc.). These topics are explicitly mentioned in the AAMC topic outline! Why have the authors neglected to include it?? This really is an inexcusable act of gross negligence on behalf of NextStep.\n\nIn addition, I have issues with some of the questions in the book, particularly the \"content review problems\" at the end of each Section. To give you an example, some of the questions about carbohydrates in \"Section 1 Content Review Problems\" involve knowledge of organic chemistry. Now I understand how you need to have knowledge of organic chemistry for the MCAT, and those questions I'm speaking about are, indeed, relevant.....however, they don't belong in a section exclusively devoted to biology, especially when you haven't studied organic chemistry yet. In fact, organic chemistry is usually taken after biology I. Those questions I speak of belong in the organic chemistry section of another content review book, not biology. These types of anachronistic questions are scattered throughout the textbook, and it would help if the authors would be a little more consistent with the science subject under study.\n\nSpeaking of the overall questions in the book, each chapter has \"end of chapter problems,\" which contain an MCAT-style passage or two, plus discrete questions. Then, the authors have \"Section Content Review Problems\" consisting of multiple choice questions. Finally, there is a comprehensive final exam at the end of each book featuring only multiple choice questions. I really wish that instead of multiple choice questions, the authors should have mixed in some MCAT-style passages with discrete questions as the comprehensive final exam (with complete solutions provided in the back of the book). As far as solutions are concerned, only the \"end of chapter problems\" are given detailed solutions. The \"section problems\" and final exam problems are only given letter answers. That's worthy of a full, one-point deduction right there from any review of this book.\n\nAs far as the Biochemistry half of the book is concerned, it's overkill....really. The explanations are way too thorough and overly detailed, beyond the scope of the MCAT. All you see are a few pictures/diagrams interspersed among vast paragraphs of dense text. It's clear that the authors have absolutely no clue how the MCAT will test biochemistry (and frankly, no one has a clue since nobody has taken the first real test yet!), so they thought that they should just throw everything but the kitchen sink in there. Wrong!! My advice is to go with Kaplan's biochem review, not NextStep.\n\nFinally, I must make a few comments regarding this new MCAT coming out: I'm not a fan of it....at all. The overall test time has been doubled to 7 hours, and it incorporates 3 more subjects. With the impending shortage of over 150,000 physicians by 2025 (as predicted by the AAMC itself), why would you want to overburden med school applicants? Is the AAMC actually exacerbating the problem by trying to keep people AWAY from medical school? I really don't get it. However, the upside to all this is that the time to take the MCAT is NOW. Why? Because not much appreciable, statistical information and research will be available to really know how effective the new format is....at least not for another 3 to 5 years or so. Therefore, the best time to take it is this year until about 2017. The MCAT has now been relegated to a very incipient stage, so take advantage of it! Hopefully, medical schools will realize this and forgive a \"lower than your personal best\" score. If not, and you're rejected from medical school due to a low 2015MCAT score while your other credentials are top-notch, appeal the decision and put up a huge fight. In fact, I would even mention this whole paragraph in your personal statement if you get a low MCAT score! That's what I'm going to do if I don't score well.\n\nTo sum up, this content review book gets 3 stars from me. It clearly needs another revision and update. How the other 2 reviewers gave this 5 stars is beyond me. It clearly is not worthy of that rating.\n\nUPDATE AS OF AUGUST 2015:\nI downgraded my review from 2 stars to 1 star.  The book is absolutely awful.  There are quite a few practice passages in here that are just not written well at all.  Then, when you go to the explanations in the back of the book, they do a s*** job of explaining the correct answer at the exclusion of the other incorrect answers.  You would think that they would explain WHY the incorrect answers are incorrect, which would be VERY helpful and the logical thing to do, but the authors don't do this.\n\nSpeaking of the authors, Bryan Schnedeker and Jonathan Edwards wrote this book.  They both allegedly scored over 40 on the old MCAT, which doesn't really say much.  The only extrapolation we can make about that is that they're just good standardized test takers.  In this book, we can clearly see that they're both lacking in content knowledge, based on the number of errors I'm seeing.\n\nHere is some additional background information on the authors:  Schnedeker attended the first 2 years of medical school at UMDNJ, but did not complete the program.  He then went onto law school (Rutgers), which he did complete.  This speaks volumes.  I think he's better off writing about the LSAT than the MCAT, since his medical experience is lacking.  I also frown upon people who drop out of medical school because they disrupt the class enrollment, and his/her seat could have been given to a (perhaps more qualified) individual.  As for Mr. Edwards, he's a medical school graduate, currently in residency.  He did research in biochemistry, which is clearly reflected in the biochem material in this book.  It's way too overwhelming and technical...completely overdone.  I, and other pre-med students, would appreciate it if he would keep all that detail out of the biochem section.  We don't need to know all of those specific reactions and technical details for the MCAT.\n\nIf I could put these guys out of business, I definitely would.  I really regret having purchased their set of content review books, and to put it point blank, I should get a full refund.",
        "description": "[\"Bryan Schnedeker is Next Step's National Academic Director. He has been teaching and tutoring for over a decade, and personally scored a 44 on the old MCAT and a 525 on the new one. He has helped thousands of students succeed on their tests, and specializes in working with students looking to achieve elite scores on their tests. To get more information about tutoring with Bryan, contact Next Step at 888-530-NEXT.\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1426550400000,
        "asin": "0397510918",
        "title": "Lippincott's Illustrated Reviews: Biochemistry",
        "overall": 5,
        "reviewText": "I bought this book for $1.06 at a Salvation Army thrift shop.  It's definitely one of the best purchases I've ever made as far as review books are concerned.  I realize that this is the 2nd edition (1987), but it reviews all of the biochemistry topics to be tested on the new MCAT.  If you're a pre-med student preparing for the MCAT and you can't take a biochem course, definitely pick this book up and self-study from it.  It should be all you need.",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1428192000000,
        "asin": "1505595029",
        "title": "MCAT Physics and Math: Content Review for the Revised MCAT",
        "overall": 2,
        "reviewText": "Out of all the Content Review books published by NextStep, I must say that the Physics and Math book is the worst in the lot.  The Math review is fine, but it's the Physics content that's alarming.  Rather than ramble on and on, I'm just going to belt out some bullet points that really need to be addressed for when Mr. Schnedeker publishes a revised edition (which really MUST occur):\n\n1.  Unlike the other Content Review books, this one has absolutely no section review exams (just end of chapter problems and a final review at the very end).\n\n2.  Speaking of the end-of-chapter problems, they are exceptionally difficult if you don't know future material.  In other words, the book has problems in an early chapter(s) that you need to know material from in later chapter(s) in order to get the correct answer.  This is exceptionally frustrating, so it appears as if this book assumes that you have already taken your College Physics classes and already know all the material.  If you don't know any physics whatsoever, please do NOT use this book without taking your physics courses!  You'll be pulling your hair out otherwise.\n\n3.  Regarding the IN-chapter problems, I find some of them to be exceedingly difficult (and more than what the MCAT expects you to know).  In fact, some of these problems are more difficult than the ones encountered in my physics course so far!  Why that is, I have no idea.\n\n4.  I haven't completed the book yet, but I've found a few typos:  p. 94 (should be 5.1 m/s);  second graph on p. 455 is drawn incorrectly (the graph should start at the origin....PV=nRT is a form of y=mx...there is no y-intercept, so the graph should begin from the origin).  That's about it for now, and I'm sure that there will be more typos as I continue to work through this dense book (note:  I have the updated version of this book, after the printing error calamity....apparently, the staff did not make a thorough review to catch all these typos).\n\n5.  THIS IS PERHAPS THE MOST IMPORTANT POINT:  THE PHYSICS REVIEW MATERIAL IS NOT FAITHFUL TO THE AAMC TOPIC OUTLINE!!!\nYou don't know how much this frustrates me!  To give you some examples:  There's a whole chapter on Momentum (Chapter 7).  I appreciate the authors telling us that we don't need to know Momentum for the MCAT, but why bother even writing a chapter on it?  LEAVE IT OUT!  The less material you need to know, the better.  Here are some other included topics that are absolutely not necessary to know for the MCAT:\n  In Ch. 4:  no need to know the Law of Gravitation (it's not on the AAMC MCAT topic outline)\n  Ch. 6 -  get rid of that air resistance section!\n  Ch. 5 -  get rid of circular motion!\nCh. 9 (Fluids) is also rather frustrating....The continuity equation is not clearly defined (should be A1V1 = A2V2);  the authors went into the formula for surface tension, whereas Kaplan's prep book didn't (so who's correct here??); where's the information about the Venturi effect and pitot tubes???;  and how about Pascal's Princple?  The Principle is stated in the chapter, but it isn't explicitly shown with a hydraulics example.\n\nAnd perhaps the MOST glaring omission of all is that there's nothing on THERMODYNAMICS!!!  WHY?  The AAMC outline explicitly states that you must know Thermodynamics from both a General Chemistry and Physics perspective.  It's covered rather well in the Gen Chem book, but you definitely should know it from a Physics perspective also.  (NOTE:  Kaplan, NextStep's famous competitor, has Thermodynamics in their Physics book).\n\nSo those are the major points I wanted to address regarding this particular Content Review book.  After seriously thinking a lot harder about my 2015 MCAT preparation strategy, I have come to the conclusion that nobody should purchase NextStep's strategy and practice series for the science-based sections (and, by extension, do not buy their online MCAT tests!).  Their CARS and Psych/Soc question books seem ok, but not the basic sciences.  I came to this conclusion after assessing the in-chapter, end-of-chapter, and exam questions in each of the content review books.  There are definitely some questions in all the science books that pertain to topics that you don't need to know for the MCAT.  Because of that fact, I would make the highly probable assumption that the Strategy & Practice books contain similar extraneous topic questions.  Therefore, I would only recommend the Psych/Soc and CARS Strategy & Practice books.  If you want question books for the basic sciences (bio, biochem, physics, gen chem, and orgo), go with Sterling or Kaplan's materials. And as for MCAT practice tests, you gotta go with the AAMC itself.  I'm taking the MCAT in Dec. of this year, so I'll have a few of those AAMC tests under my belt by then.  My apologies and sympathy go out to those people who are taking the new MCAT within the first 3 months of its administration!\n\nSo, to sum it all up, the Physics and Math Content Review book is a fine supplement to your College Physics courses, but its intended purpose is to school you on MCAT Physics, which it does rather poorly.  All of this stems from the fact that the authors did not pay attention to the AAMC MCAT topic outline.",
        "description": "[\"Bryan Schnedeker is Next Step's National Academic Director. He has been teaching and tutoring for over a decade, and personally scored a 44 on the old MCAT and a 525 on the new one. He has helped thousands of students succeed on their tests, and specializes in working with students looking to achieve elite scores on their tests. To get more information about tutoring with Bryan, contact Next Step at 888-530-NEXT.\"]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1430697600000,
        "asin": "1618654667",
        "title": "Kaplan MCAT Biochemistry Review: Created for MCAT 2015 (Kaplan Test Prep)",
        "overall": 1,
        "reviewText": "Other 1-star reviews for this biochem review book claim that there are no passages in the book.  I wholeheartedly agree with those reviewers, and that fact is worthy of a 1-star rating in itself.  However, my 1-star rating comes from the fact that a lot of molecular genetics (a BIOLOGY topic) is discussed here in a biochemistry book.  Why aren't those topics in the Biology review book instead??  The AAMC topic outline clearly and explicitly lists molecular genetics (with DNA technology) as BIO topics.\n\nNow, it doesn't take a psychometrician to realize Kaplan's motives here.  They were looking to perform a \"cash grab\" on pre-med students, plain and simple.  In order to effectively prepare for the Biology portion of the exam (which contains the most content), you would also need to purchase the Biochemistry review book.  That's a really awful and sneaky marketing ploy put forth by Kaplan.  I am SO sick and tired of testing companies trying to rape and pillage the pockets of already poor students.  It's disgusting.  This is the kind of thinking you need to possess to REALLY succeed in medical school.  Try to pick out the hidden, underlying motives behind everything.  Once you see that, you can glean the bigger picture a lot more easily.",
        "description": "['Celebrating 75+ years as the world leader in the test prep industry, Kaplan Test Prep (www.kaptest.com) is a premier provider of educational and career services for individuals, schools and businesses. With a comprehensive menu of online offerings as well as a complete array of print books and digital products, Kaplan offers preparation for more than 90 standardized tests, including entrance exams for secondary school, college and graduate school, as well as professional licensing exams for attorneys, physicians and nurses. Kaplan also provides private tutoring and graduate admissions consulting services.<br /><br />Want to learn more about MCAT 2015?<br />Check out Kaplans exclusive MCAT 2015 homepage at <b>www.mcat2015.com</b>.<br /><br />Questions about what youre studying?<br />Ask us on Facebook: <b>www.facebook.com/kaplanmcat</b><br />Ask us on Twitter: <b>twitter.com/KaplanMCATPrep</b><br />Check out our MCAT blog: <b>www.medschoolpulse.com</b>', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1439337600000,
        "asin": "0006895492",
        "title": "Essentials of Human Anatomy and Physiology- Text Only 8th edition by Elaine N. Marieb (2006) Paperback",
        "overall": 5,
        "reviewText": "Yes, it's true.  The 5th edition is floating somewhere online for free.  I ordered the 6th edition from my college bookstore, and after discovering the 5th edition online, I immediately returned the book.  The 5th and 6th editions are EXACTLY THE SAME!  Trust me, nothing is different between the two except a couple updated anatomy diagrams.  Nothing special or significant at all.  I really hate when authors do this.  It's such a money-making scheme that I'm so sick and tired of seeing this happen to the students.  If you're going to update a book, completely rearrange the whole thing.  Add a ton of different photos, add different text, whatever.  Please don't update a book every 2 or 3 years when you don't need to, and in anatomy (which NEVER changes, and probably won't change unless humans become subject to massive nuclear fallout), you don't need this kind of updating at all.\n\nEvery word in the 6th edition, down to the exercises and pre-lab questions, are exactly alike.  Believe me, I had the PDF 5th edition open on my computer and the 6th edition open on my desk.  After performing a rigorous comparative analysis, they're 98.9% alike (the difference being only with a few updated anatomy photos, and I mean a FEW).  Even my anatomy professor said it was ok to use the 5th edition, although (in her words) \"you might want to see more updated pictures\".  In other words, the 5th edition is just fine.\n\nStudents, you need to rise up and take back the education that's rightfully yours.  Please take full advantage of this millennium's e-book craze, because that's what's leading to torrenting.  This is the only method whereby students can possibly fight back against ever-increasing textbook prices.",
        "description": "[]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1453507200000,
        "asin": "0892541350",
        "title": "Rulers of the Horoscope: Finding Your Way Through the Labyrinth",
        "overall": 5,
        "reviewText": "Alan Oken's \"Rulers of the Horoscope\" needs to be in every astrologer's library.  It's just fantastic.  Mr. Oken, an accomplished astrologer in his own right, gives a very detailed emphasis on dispositorships, mutual receptions, and the rulers of each astrological house posited in other houses here in this epic work.  If there was a Top Ten List of Astrology Books, \"Rulers of the Horoscope\" would certainly make the cut.  The best paragraph in the whole book is on page 38, where the author emphasizes the importance of synthesis when interpreting the natal chart.  He is just so spot-on about this vital intuitive concept, and it's amazing how he can get that point across in just one paragraph.  Whether you're a beginner or serious practitioner of astrology, do yourself a favor and get this book!",
        "description": "[\"<DIV> Alan Oken has written several bestsellers, including <i>Alan Oken's Complete Astrology, Soul-Centered Astrology</i>, and <i>Rulers of the Horoscope</i>. An internationally known lecturer and teacher, he speaks and writes in six languages and has taught in over 30 countries. He has an active astrological consulting practice and a significant web presence. He is the founder and director of the Wisdom School. </DIV>\"]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1488067200000,
        "asin": "1910531189",
        "title": "Geodetic Astrology For Relocating and World Affairs",
        "overall": 1,
        "reviewText": "After reading this book on geodetic astrology, I am certainly not a fan of this particular method to predict world events.  I can appreciate how the entire world has certain house cusps associated with different regions; however, using geodetic maps to discover where certain events are likely to occur when performing mundane astrological work is lackluster at best.\n\nYou can use simple relocational astrology techniques to better predict such events.  For example, start with drawing up a solar or lunar eclipse chart at Greenwich for the exact time of the eclipse.  Then, based on that base chart, you can relocate that chart to anywhere in the world to see what angles the eclipse falls on.  Alternatively, and to save you time, you can use astrology software to see all the major planetary lines throughout the world based on the eclipse chart.  You can then hone in on certain key areas, and after doing so, use ingress charts, birth charts of cities/countries, etc. to further fine tune your predictions.  I would much rather use that method than a geodetic analysis.\n\nSome other things to note in this book:  the bi-wheels are terrible.  Why interpose one eclipse chart on top of another eclipse chart?  Really makes no sense.  You should be using the birth chart of a city or ingress chart when you do that.  Also, the notes underneath the charts (discussing transits) are confusing in the sense that the author doesn't actually show how those transits are interacting.  And finally, a lot of the text is spent describing history or the science behind natural disasters.  If I wanted a science lesson, I'd go read a science book.  This is ASTROLOGY, and I would appreciate it if you would focus more on that.  Thank you.",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1506643200000,
        "asin": "0143130447",
        "title": "Drawdown: The Most Comprehensive Plan Ever Proposed to Reverse Global Warming",
        "overall": 1,
        "reviewText": "I don't know how the author, as well as the vast majority of \"experts,\" scientists, and the public, could be so blindsided by the real cause of global warming.  It's not CO2, factories, carbon emissions, CFCs, etc.  It's technology, folks.  TECHNOLOGY.  And I'm specifically talking about all those satellites orbiting the Earth.  Do you have any idea how many are up there right now?  THOUSANDS.  These satellites emit all kinds of radiation that directly interfere with the magnetic poles of the Earth, as well as the Earth's core.  If you want to reduce global warming, reduce the number of satellites orbiting the Earth.  That's the real answer to global warming.  However, with all the technology that the human race relies on today (iPhones, Internet, etc.), they will have to make technological sacrificies if humanity has any hope of surviving and avoiding their own impending destruction.  With the extreme dependency on and addiction to technology, this could create chaos.  Personally, I don't believe that humanity will be willing to make these sacrifices for the good of the planet, but it really is the only answer to solving global warming.\n\nThank you!",
        "description": "[\"At this point in time, the<i>Drawdown</i>book is exactly what is needed; a credible, conservative solution-by-solution narrative that we can do it. Reading it is an effective inoculation against the widespread perception of doom that humanity cannot and will not solve the climate crisis. Reported by-effects include increased determination and a sense of grounded hope.<br /><b>Per Espen Stoknes, Author,<i>What We Think About When We Try Not To Think About Global Warming</i></b> <br /><br />Theres been no real way for ordinary people to get an understanding of what they can do and what impact it can have. There remains no single, comprehensive, reliable compendium of carbon-reduction solutions across sectors. At least until now. . . . The public is hungry for this kind of practical wisdom.<br /> <b>David Roberts, <i>Vox</i></b><br /><br />This is the ideal environmental sciences textbookonly it is too interesting and inspiring to be called a textbook.<br /> <b>Peter Kareiva, Director of the Institute of the Environment and Sustainability, UCLA</b><br /><br /><i>Drawdown</i>is not just a projectit is an adventure. It is a promising story that has the potential to engage every person on the planetwith at least one solution to climate change, whether it is educating girls, improved rice cultivation, creating walkable cities, eating a plant-rich diet, household recycling, or any of the other solutions.<br /><b>Karen O'Brien, cCHANGE</b><br /><br /><i>Drawdown</i>is an exceptional example of cooperation between some of the sharpest thinkers on climate and energy matters,an atlasthat has the potential to save the planet.<br /><b>Andreas Kuhlmann, CEO German Energy Agency</b><br /><br />It will give you the best kind of hope, the kind that balances realism with radical vision. . . . Stabilizing the climate system will require a heroic global effort, but the point here is only to show that . . . such an effort can do more than merely succeed; that it can succeed well, and open into futures that we can actually bear to contemplate.<br /><b>Tom Athanasiou, <i>The Nation<br /><br /></i></b>The Paul Hawken presentation I just experienced at Telluride Mountainfilm was simply the best speech I have ever heard. And, not so incidentally, also the most important.To come at the worlds most important issue in an entirely novel fashion is a monumental feat.<b><br />Tom Peters, American writer on business management practices, best known for <i>In Search of Excellence</i></b><br /><br />In the course of 20-some years of investigating and writing about global warming Ive become all too familiar with that dynamic of gloom/doom/shame/fear/apathy, and I think Hawken has put his finger on exactly why we havent made more policy progress. The biggest anchor dragging behind this boat isnt climate denial or even indifference but, I suspect, the almost unspeakably deep, defeatist conviction that no response really matters because we are already so thoroughly screwed. Im vulnerable to that despair at times and maybe you are, too. If so, read this book  not just as an antidote to fear and despair but as foundation for understanding and supporting the kinds of change that really could be coming, and at every scale from your household to your company, your community, your county and state and national government.<br /><b>Ron Meador, <i>MinnPost</i></b><br /><br />I am blown away by<i>Drawdown</i>. Like hearing an advance copy of <i>Sergeant Pepper</i>, back in the day.<br /><b>John Elkington, CEO Volans, author and world authority on sustainable development</b> <br /><br />Be kindly unto the scientists, for they may just save our skinand make us happier and wealthier in the bargain. . . . An optimistic program for getting out of our current mess, well deserving of the broadest possible readership.<br /><b><i>Kirkus Review</i></b> <br /><br />A rigorous and profoundly important resource.<br /><b>Donna Seaman,<i>Booklist</i></b><br /><br />With a climate-denying party controlling the government, it can seem that theres no hope. . . . But a new book might change thatand serve as a blueprint for what comes next if the U.S. government (and the global community) begins to aggressively focus on altering the climate future.<i>Drawdown</i>is likely the most comprehensive model of climate solutions ever made.<br /><b><i>Fast Company</i></b> <br /><br /><i>Drawdown</i>is a magnificent achievement.<br /><b>Greg Watson, Schumacher Center for New Economics</b> <br /><br />This is one of the most powerful, hopeful, world-changing documents. A deeply peer reviewed, fully win-win, nearly no-regrets pathway . . . with a surprising ranking of the most important and impactful solutions.Paul Hawkens simple, elegant genius in leading this approach, can inspire rapid, catalytic action.<br /><b>Andy Lipkis, TreePeople</b><br /><br />A bold plan to beat back climate change based on solutions already within our grasp.<br /><i><b>Outside Magazine</b></i><br /><br />At a time when the Trump administration is working to dismantle much of the nations efforts to minimize climate change, Paul Hawkens new book swoops onto the scene like a knight in shining armor. . . . The books release couldnt possibly come at a better time. Refreshingly absent of political analysis, its grounded in scientific reality and will likely go a long way toward inciting people to action.<br /><i><b><b></b>The Portland Tribune<br /></b></i><b></b><br /><i>Drawdown</i>is likely the most hopeful thing youll ever read about our ability to take on global warming. <b> <br />Joel Makower,<i><b>GreenBiz </b></i> </b><i><b> <br /> </b></i> <br />This book is a beautiful, inspiring, and deeply satisfying read. Most importantly it is no more doom and gloom. It is OPTIMISTIC and empowering. Paul Hawken is a true visionary and a brilliant voice for real solutions. <b> <br />Jessica Rolph, Founding Partner, Happy Family </b><i><b> <br /> </b></i> <br />Its so brilliant . . . a showstopper. <b> <br /><b><b>Donald A. Falk, PhD, Asso</b>ciate Professor School of Natural Resources and the Environment,University of Arizona </b> </b>\", '<b>Paul Hawken</b>is an author and activist. He has founded successful, ecologically-conscious businesses, and consulted with heads of state and CEOs on economic development, industrial ecology, and environmental policy. He has written seven books including four national bestsellers:<i>The Next Economy</i>,<i>Growing a Business</i>, and<i>The Ecology of Commerce,</i>and<i>Blessed Unrest</i>.<i>The Ecology of Commerce</i>was voted as the #1 college text on business and the environment by professors in 67 business schools.<i>Natural Capitalism: Creating the Next Industrial Revolution</i>, co-authored with Amory Lovins, has been referred to by several heads of state including President Bill Clinton who called it one of the most important books in the world at that time. He has served on the board of many environmental organizations including Center for Plant Conservation, Shelburne Farms, Trust for Public Land, Conservation International, and National Audubon Society.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1516492800000,
        "asin": "0877286507",
        "title": "Aspects and Personality (English and Dutch Edition)",
        "overall": 4,
        "reviewText": "I take an instant one star off of this book for the simple fact that she glaringly omitted the Mystic Rectangle configuration when discussing aspect patterns.  I have no idea how she can miss this vital configuration.  Other than that, everything else is sound and highly informative",
        "description": "['Text: English, Dutch (translation)']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1517356800000,
        "asin": "0924608137",
        "title": "The Book of Rulerships: Keywords from Classical Astrology",
        "overall": 1,
        "reviewText": "Don't even think about purchasing this book of rulerships.  The most definitive and best resource for astrological rulerships is The Rulership Book by Rex E. Bills.  One reviewer on here pointed out this astute observation about a particular entry in Lehman's book:\n\n\"Epilepsy\" has six entries, and its various suggested rulers include the Moon (which has the most agreement), Mercury, Mars, Saturn, Aries, and the First House.\n\nThis is extremely wrong.  Epilepsy is a brain issue, seizures.  What are seizures?  Electric misfirings in the brain!  Who rules electricity?  URANUS, AQUARIUS, perhaps Mercury (ruler of the mind/brain itself), and Aries (ruler of the head in general).  The Moon has nothing to do with the brain at all.  Pass this book up and go with Rex!",
        "description": "[\"I wrote this book because it's easy for people to casually decide upon an astrological rulership, but it's hard to know whether where that idea came from: what lineage, whether it was just an idea, or something that the astrologer in question actually worked with.<br><br>This books lists rulerships by source, including Ptolemy, al-Biruni, Gadbury, Lilly, and others.\", \"Lee has a Ph.D. in Botany from Rutgers University. She is author of <i>The Ultimate Asteroid Book</i> (1988), <i>Essential Dignities</i> (1989), <i>The Book of Rulerships</i> (1992), <i>Classical Astrology for Modern Living</i> (1996), The <i>Martial Art of Horary Astrology</i> (2002), <i>Astrology of Sustainability</i> (2011), <i>Traditional Medical Astrology</i> (2011), <i>Classical Solar Return</i>s (2012) and a translation from the French of Papus' <i>Astrology for Initiates</i> . Her correspondence courses, Classical Studies (horary, natal, electional, medical, gaming, mundane and advanced horary), bring classical astrology to the forefront as an astrological system. Dr. Lehman was a Professor and Vice President for Academic Affairs at Kepler College. <br>She served the astrological community as Research Director for NCGR from 1987-1999, as UAC Board Treasurer from 1990 -1999, and as UAC Program Chair for UACs 1995 and 1998. She is a Life Member of the National Council for Geocosmic Research (NCGR), the International Society for Astrological Reasearch (ISAR), and the American Federation of Astrologers (AFA).<br> <br>Lee was the recipient of the 1995 Marc Edmund Jones Award, and the recipient of the 2008 Regulus Award for Education. Along with Esoteric Technologies, Lee has created two software report writer programs written specifically for the classical astrologer: Solar Writer/Medicus, for medical questions and decumbitures; and Solar Writer/Classical, for natal delineation in the matter-of-fact style of the Renaissance astrologer. She has developed the innovative add-on to Cosmic Pattern's Sirius: Who Wins, which captures the rules of Bonatti for warfare for use in researching the outcome of sporting events. Her Perennial Herbal takes ancient astrological herbalism onto the web.\"]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1521417600000,
        "asin": "1500831484",
        "title": "Eastern Astrology for Western Minds: A Compilation of NeoVedic Astrology",
        "overall": 1,
        "reviewText": "If you have ever seen Joni Patry's predictions on YouTube, you'll know what I'm talking about.  This woman's blond highlights must be leeching ammonia into her scalp because I've never seen anybody make an alarmingly large number of incorrect predictions and have the public fall for it.  She preaches all the time about money, money, money in astrology, which makes sense because she's a con artist.  Her incorrect Super Bowl and election predictions only skirt the surface.  She must be stopped at all costs!",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1522454400000,
        "asin": "0062466593",
        "title": "The Wild Unknown Tarot Deck and Guidebook (Official Keepsake Box Set)",
        "overall": 1,
        "reviewText": "Have you ever seen a tarot deck that instantly turns you off or gives you bad vibes?  Well, this one certainly did!  If you're into black magic or the dark arts, then this is the deck for you.  For true light workers, I'd stay far away from this deck.  It could suck up your soul.  There's just too much dark imagery to be used for positive spiritual purposes.  I mean, just look at the photo of Kim Krans on her Amazon page.  She's very Aleister Crowley-like.  Covering up one eye is a tell-tale sign that you're not seeing the full truth behind her motives.  Only the most spiritually powerful and intuitive can bat away her hand and see the ugly soul underneath.",
        "description": "['', '<strong>KIM KRANS </strong>is an artist and illustrator who studied at Cooper Union in New York City. In addition to <em>The Wild Unknown Tarot, The Wild Unknown Animal Spirit,</em> and <em>The Wild Unknown Journal,</em> she is the author of several children&#8217;s book, including <em>Hello Sacred Life</em> and <em>ABC Dream.</em> She lives on the west coast where she teaches meditation, makes art, writes, and catches waves.']",
        "domain": "Books"
    }
]