[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1419465600000,
        "asin": "B00OTR96J6",
        "title": "I Origins",
        "overall": 4,
        "reviewText": "Without spoiling anything, \"I Origins\" is about iris biometrics and reincarnation.  I wouldn't call this a science fiction film, like some reviewers on here mentioned.  The technique en\"vision\"ed  :)  in this film can definitely become a reality.  I certainly see it being developed as a basic test for the masses.  As for people having matching iris configurations, I'm a little skeptical about that one.  Either way, this film really blew my mind away.  It's got such a unique concept that it captivated my attention throughout the film and really had me awe-inspired both during the movie and after.\n\nI had to take one star off from my review because I wish the two major examples of reincarnated subjects given in the movie weren't of the same sex.  I wish that at least one of the examples featured a reincarnated opposite sex (like a boy coming from a deceased woman).  That would have made for some excellent gender-bending moments, which certainly would have fascinated me a lot more.  So for the writers' \"reincarnation sexism,\" I took off one star.\n\nMake sure to see this film.  I'm keeping it in my library permanently.",
        "description": "[\"Michael Pitt (TV's Boardwalk Empire) and Brit Marling (Another Earth) star in this thought-provoking drama that challenges the line between facts and faith.  Dr. Ian Gray (Pitt) is a molecular biologist studying the evolution of the eye, along with his lab partner, Karen (Marling).\\n\\nAfter a tragic romance with an exotic young woman (Astrid Berges-Frisbey), Ian's obsession with her triggers a chain of events that leads to a stunning discovery years later...one that may unlock the greatest mysteries of life.\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1421539200000,
        "asin": "B00NMF8SEK",
        "title": "Selma",
        "overall": 5,
        "reviewText": "I'm not black, and I found the film to be a tour de force of impressive acting skills and poignant history in the American struggle for civil rights.  Clearly, \"Selma\" is a strong contender for Best Picture at the 2015 Academy Awards.  What even strengthens its chances further is the fact that no blacks were nominated at all in any of the major Oscar categories (Best Actor/Actress and Supporting Actor/Actress).  Wouldn't you agree that perhaps the Hollywood Foreign Press and the Academy will give the Best Picture Oscar to \"Selma\" as a consolation due to the above fact?  This is just my expert psychological thinking talking here, but it wouldn't surprise me in the least if Selma takes the cake here.  I'll post an update as soon as the Awards are over.",
        "description": "[\"SELMA is the story of a movement. The film chronicles the tumultuous three-month period in 1965, when Dr. Martin Luther King, Jr. led a dangerous campaign to secure equal voting rights in the face of violent opposition. The epic march from Selma to Montgomery culminated in President Johnson (Tom Wilkinson) signing the Voting Rights Act of 1965, one of the most significant victories for the civil rights movement. Director Ava DuVernay's SELMA tells the real story of how the revered leader and visionary Dr. Martin Luther King Jr. (David Oyelowo) and his brothers and sisters in the movement prompted change that forever altered history.\", 'Selma chronicles the tumultuous three-month period in 1965, when Dr. Martin Luther King, Jr. led a dangerous campaign to secure equal voting rights in the face of violent opposition. The epic march from Selma to Montgomery culminated in President Johnson (Tom Wilkinson) signing the Voting Rights Act of 1965, one of the most significant victories for the civil rights movement. Director Ava DuVernays Selma tells the real story of the revered leader and visionary Dr. Martin Luther King, Jr. (David Oyelowo) and his brothers and sisters in the movement that prompted change that forever altered history.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1421971200000,
        "asin": "B00HX3ZKS4",
        "title": "Looking: Season 1",
        "overall": 2,
        "reviewText": "That's exactly what it is.  Way too boring for me.  The plots are atrocious. I really don't care how the lives of a few stereotypical gay men in San Francisco play out.  If anything, this series accentuates all that is wrong about the gay community, especially their serious dating ADD issues.",
        "description": "['This new HBO comedy series revolves around three thirty-something friends living in San Francisco, who explore the exciting, sometimes overwhelming, options available to a new generation of gay men.', \"<em>Looking </em>offers up the unfiltered experiences of three close friends living - and loving - in modern-day San Francisco. Friendship may bind them, but each is at a markedly different point in his journey: Patrick (Jonathan Groff - <em>Spring Awakening</em>) is the 29-year-old video game designer getting back into the dating world in the wake of his ex's engagement; aspiring artist Agust&iacute;n (Frankie J. Alvarez - <em>Smash</em>), 31, is questioning the idea of monogamy amid a move to domesticate with his boyfriend; and the group's oldest member, longtime waiter Dom (Murray Bartlett), 39, is facing middle age with romantic and professional dreams still unfulfilled. The trio's stories intertwine and unspool dramatically as they search for happiness and intimacy in an age of unparalleled choices - and rights - for gay men. Also important to the <em>Looking </em>mix is the progressive, unpredictable, sexually open culture of the Bay Area, with real San Francisco locations serving as a backdrop for the group's lives. Rounding out the <em>Looking </em>world are Dom's roommate Doris (Lauren Weedman), Agust&iacute;n's boyfriend Frank (O.T. Fagbenle), and Patrick's co-worker Owen (Andrew Law), as well as love interests Kevin (Russell Tovey), Lynn (Scott Bakula), and Richie (Ra&uacute;l Castillo).<br />\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1427414400000,
        "asin": "B00062IDCO",
        "title": "Star Trek Voyager - The Complete Seventh Season",
        "overall": 2,
        "reviewText": "Never liked this series. The finale felt rushed (and that love affair between Chakotay and 7 of 9 was ridiculous).  TNG was by far the better series, and Voyager tried to copy it and look up to it (which is seen throughout the whole series), but it ultimately failed.",
        "description": "[\"STAR TREK VOYAGER - THE COMPLETE SEVENTH SEASON details the adventures of the Starfleet's most adventurous starship, the U.S.S. Voyager, as it is led by Captain Kathryn Janeway (Mulgrew) on missions into deep space.\", 'After seven long years trying to return home, it\\'s no surprise that the seventh season of <I>Voyager</I> was emotional. It begins with the resolution to season 6\\'s \"Unimatrix Zero,\" in which Janeway (Kate Mulgrew), Torres (Roxann Biggs-Dawson), and Tuvok (Tim Russ) must find a way off the Borg Cube and Seven of Nine (Jeri Ryan) faces the loss of the precious bit of humanity she has just discovered. \"Human Error\" focuses on Seven\\'s further attempts to explore her human side (a romance comes from out of the blue). And if Seven isn\\'t the cast\\'s most fascinating character, it\\'s the other crew member struggling to find his not-quite-human identity, the Doctor (Robert Picardo). In \"Body and Soul,\" the Doctor gets to experience physical life in the body of--who else?--Seven. He writes a novel in \"Author, Author,\" and in the first of a pair of excellent two-parters, \"Flesh and Blood,\" he explores what it means to be a hologram in the midst of a deadly situation involving the Hirogen. In the second two-parter, \"Workforce,\" the crew is kidnapped and brainwashed into becoming ordinary laborers on a planet with a worker shortage, but Janeway is forced to question whether she wouldn\\'t prefer this version of a normal, stable life.', 'The seventh season also saw the first <I>Trek</I> wedding since Dax-Worff, the return of the old Federation-Maquis conflict, the continuing efforts of Lt. Reginald Barclay (Dwight Schultz) to bring <I>Voyager</I> home, Kim (Garrett Wang) taking command twice (once with the help of the Emergency Command Hologram), the return of Q, and Neelix\\'s discovery of a group of fellow Talaxians. The final episode, \"Endgame,\" is less concerned with misty-eyed goodbyes than with a bending of conventional views of the space-time continuum that leads to an exciting showdown with the Borg queen (Alice Krige, repeating her role from <I>Star Trek: First Contact</I> but making her first appearance on <I>Voyager</I>). DVD bonus features include the usual season recap, a 12-minute featurette on the final episode, and a crew profile of the Doctor. <I>--David Horiuchi</I>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1433808000000,
        "asin": "B00LT1JKN2",
        "title": "Batman Complete Series",
        "overall": 5,
        "reviewText": "What a steal!  For the lowest possible price I've ever seen for this blu-ray set yet ($80), it behooves you to buy the Italian import....seriously.  Only the back cover of the box is written in Italian.  The audio and video are all in English, and the quality is SUPERB.  Gorgeous HD blu-ray quality.  I couldn't be happier with this purchase!",
        "description": "['<!--[if gte mso 9]><xml> <w:WordDocument> <w:View>Normal</w:View> <w:Zoom>0</w:Zoom> <w:TrackMoves /> <w:TrackFormatting /> <w:PunctuationKerning /> <w:ValidateAgainstSchemas /> <w:SaveIfXMLInvalid>false</w:SaveIfXMLInvalid> <w:IgnoreMixedContent>false</w:IgnoreMixedContent> <w:AlwaysShowPlaceholderText>false</w:AlwaysShowPlaceholderText> <w:DoNotPromoteQF /> <w:LidThemeOther>EN-US</w:LidThemeOther> <w:LidThemeAsian>X-NONE</w:LidThemeAsian> <w:LidThemeComplexScript>X-NONE</w:LidThemeComplexScript> <w:Compatibility> <w:BreakWrappedTables /> <w:SnapToGridInCell /> <w:WrapTextWithPunct /> <w:UseAsianBreakRules /> <w:DontGrowAutofit /> <w:SplitPgBreakAndParaMark /> <w:EnableOpenTypeKerning /> <w:DontFlipMirrorIndents /> <w:OverrideTableStyleHps /> </w:Compatibility> <w:BrowserLevel>MicrosoftInternetExplorer4</w:BrowserLevel> <m:mathPr> <m:mathFont m:val=\"Cambria Math\" /> <m:brkBin m:val=\"before\" /> <m:brkBinSub m:val=\"&#45;-\" /> <m:smallFrac m:val=\"off\" /> <m:dispDef /> <m:lMargin m:val=\"0\" /> <m:rMargin m:val=\"0\" /> <m:defJc m:val=\"centerGroup\" /> <m:wrapIndent m:val=\"1440\" /> <m:intLim m:val=\"subSup\" /> <m:naryLim m:val=\"undOvr\" /> </m:mathPr></w:WordDocument> </xml><![endif]--> <p class=\"MsoNormal\"><span style=\"font-size: 12.0pt; font-family: &quot;Times New Roman&quot;,&quot;serif&quot;;\">TV\\'s iconic Dynamic Duo has been captured, along with a legion of abominable archenemies in a POW-erful collection. Featuring ALL 120 original broadcast episodes, ever popular guest stars like Julie Newmar and Cesar Romero, complete episode guide &mdash; and exploding with over 3 hours of all new extras &mdash; you can bring home all the crime fighting action that won generations of fans!<em><span style=\"text-transform: uppercase;\"></span></em></span>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1440979200000,
        "asin": "B00006LA87",
        "title": "One Hour Photo",
        "overall": 5,
        "reviewText": "\"One Hour Photo\" is a psychology lover's dream come true.  It has everything...obsession, compulsion, stalking, treachery, betrayal...you name it.  Robin Williams (may he rest in peace) plays such a great role.  He truly was a gifted actor, a chameleon of the highest order.\n\nWithout giving too much of the film away, I really sympathized with Robin's character in this movie.  He's a person who reacts strongly to infidelity in other people, and I'm the same exact way.  I don't know what it is, but whenever I hear or see people cheating on their significant others, I well up with anger inside.  I would definitely seek to expose the cheaters any way I can.  The truth MUST come out so that these people learn their lesson.  I pray that the worst karma befalls them, hopefully ending in divorce with subsequent depression and suicide to follow.  There's a reason that Dante Alighieri in his \"Inferno\" relegated the 9th circle of Hell (the deepest one) to traitors.  Remember that, folks!\n\nSo to any of you reading my review right now....if you've cheated on people in your past, or if you're currently having an affair, watch out!  It's highly possible that someone can expose you in the same way Robin Williams did in this film.  And if that doesn't happen to you, I'll personally see to it that it does.  :)\n\n5 stars",
        "description": "[]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1518739200000,
        "asin": "630196781X",
        "title": "Dr. Jekyll and Mr. Hyde VHS",
        "overall": 3,
        "reviewText": "Great selection of movies, but there's no 1932 version of Jekyll and Hyde!  It says \"1932 version on other side of disc\" but it's not on there.  This is worthy of a whopping 2-star deduction.  Turner should not engage in false advertising.",
        "description": "[\"Classy MGM was not the studio most likely to make a horror movie in 1941, and in fact its production of <I>Dr. Jekyll and Mr. Hyde</I> ended up looking more like a glossy costume drama than a B-movie frightfest. The mood of Robert Louis Stevenson's tale of a divided doctor is ably captured in Joseph Ruttenberg's Oscar-nominated cinematography--more so, perhaps, than in Spencer Tracy's lead performance. Tracy wasn't especially happy about playing the role, although his transformations from good Dr. Jekyll to evil Dr. Hyde are convincing enough. One of the main reasons to see this version of the story is the young, impossibly beautiful Ingrid Bergman, then still a year shy of <i>Casablanca</i>. Bergman was cast in the good-girl part, but proved a shrewd judge of material, even this early in her Hollywood career; she finagled her way into playing the floozy instead, thus securing a more colorful acting platform than Lana Turner, who ended up in the more respectable role. Director Victor Fleming's previous movie was a little number called <I>Gone with the Wind</I>, and the Big Picture approach to that project may have influenced his work here--this <I>Dr. Jekyll</I> is just a bit too stately, too polished to really engage. The picture is so dignified it never cuts loose with the kind of wild invention that marked the 1932 version of the story, which won Fredric March an Oscar. It's the tale as imagined by Jekyll, rather than Hyde. <I>--Robert Horton</I>\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1526774400000,
        "asin": "B01BDUS0NY",
        "title": "Deadpool 2016",
        "overall": 3,
        "reviewText": "Yeah, I know the Deadpool comics were dark and what-not, but this is a clear corruption of the Marvel universe.  Remember, Marvel started out family-friendly, but somewhere along the line, it got twisted (like everything else, right?).  Can't blame human minds for that, honestly.  I enjoyed the movie for its humor, but in my heart, I know this isn't what the Marvel universe is all about.  Deadpool clearly caters to a select, corrupt segment of society, and if you're part of it, then this movie is definitely for you.",
        "description": "['Based upon Marvel Comics most unconventional anti-hero, Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who, after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.']",
        "domain": "Movies_and_TV"
    }
]