[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1141862400000,
        "asin": "0872203492",
        "title": "Plato: Complete Works",
        "overall": 5,
        "reviewText": "This has got to be the most comprehensive book on Plato I've ever encountered.  It's relatively written in a comprehensible style, although readers may find it difficult interpreting the subject matter.  Some may find philosophy boring and will not enjoy this text as much as those who love Plato and philosophy.\n\nHis writings are unbelievable.  It's said that only a dozen people in the world at one given time can fully understand him.  I happen to be one of those people.  To me, his writings and ideas/theories are crystal clear.  Granted, the ancient Greeks must have been smoking some good stuff to come up with these thoughts, but from their use of argument/logic/reasoning, they're all true.\n\nYou couldn't ask for a better book on Plato.  Forget the Bible...THIS IS THE BIBLE!",
        "description": "['One might be tempted to ask whether another collection of Plato\\'s works is really necessary, given that they have been translated many times. But several factors set this particular volume apart, making it a worthy addition to most libraries. The translations are all relatively recent and thus reflect contemporary language use and terminology. The collection includes works such as the Minos, Epinomis, Demodocus, Eryxias, and Axiochus, which, though generally considered not to have been written by Plato, are \"Socratic\" in form or style. The text itself is clearly printed and laid out, with useful notes, and Cooper\\'s introduction and notes about the translations are helpful in setting the dialogs in context. Finally, given what the purchaser receives, the price is reasonable. Recommended for all libraries.?Terry C. Skeats, Bishop\\'s Univ. Lib., Lennoxville, Quebec<BR>Copyright 1997 Reed Business Information, Inc.', '<DIV><P>&quot;This is clearly the definitive edition in English of the Platonic writings. It replaces completely the Hamilton-Cairns collection. . . . The notes are at just the right level, and the index is very helpful. The translations are both readable and accurate. They are always reliable, and in most cases the best available. It is the one volume of Plato every student of philosophy will want at her or his side.&quot; --Michael D. Rohr, Rutgers University</P></DIV><br /><br /><DIV><P>&quot;The most important publishing event in Platonic translation is the Complete Works edited by Cooper and Hutchinson. . . . Hackett has lavished great care in the production of this volume: fine India paper, elegant typography, sewn binding, and cloth boards. . . . It should be in every library and on the shelves of all lovers of Plato.&quot; --Steven J. Willett, <I>Syllecta Classica</I></P></DIV><br /><br /><DIV><P>&quot;The edition is a vast improvement over the Princeton/Bollingen edition, the former standard. Congratulations on a fine work!&quot; --Christian K. Edemeyer, Columbia University</P></DIV><br /><br /><DIV>&quot;It is hard to imagine how this English translation of Plato&#39;s <I>Complete Works</I> could be improved upon. A century may pass before it has a rival.&#160; Its editors and translators deserve the highest praise.&quot; --David K. Glidden, University of California at Riverside</DIV>']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1230163200000,
        "asin": "0971559163",
        "title": "Perfect Tarot Divination (Jungian Tarot Trilogy)",
        "overall": 2,
        "reviewText": "I'll keep it simple:\n\n1)  The price of this book is ridiculous seeing how slim it is.\n\n2)  The only good thing about it is the nice 15-card spread that's described.\n\n3)  I have NO CLUE where they came up with the astrological associations for the cards!  They just don't correspond with the classical assignments at all.  I wish Wang got his facts straight before he wrote this book.\n\n2 stars",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1263513600000,
        "asin": "0980096928",
        "title": "Transits and Solar Returns: A new system of analysis for two ancient methods",
        "overall": 4,
        "reviewText": "As of this writing, I realize that I'm the first person to give this book a four-star rating.  Seven reviewers behind me all gave it five stars, but there are just one or two minor details that prevent this book from getting a full five stars.\n\nThere is no shadow of a doubt that Ciro Discepolo is an accomplished and knowledgeable astrologer.  That goes without saying.  \"Transits and Solar Returns\" is a monumental effort, being one of the few books in astrological literature today to thoroughly examine the intricate individual meanings of both transits AND solar return planets in the houses and by aspect.\n\nHowever, the one-star deduction mostly comes with the personal attitude he displays in his writing style.  He appears to be very condescending at times and overbearing.  For example, take a look at his descriptions for Mars in the 1st, 6th, and 12th Houses (or the Ascendant lying in those houses of the natal chart, more specifically).  He completely brandishes those placements as negative and something to be avoided, when in fact, you should NOT take those descriptions seriously at all!\n\nFor example, I have Mars in the 12th House in Scorpio for my 2012 Solar Return.  I will be in Los Angeles at that time going for my Ph. D., and it is during that specific year (beginning around my birthday of Sept. 24th, when the new school year begins) that I will start my Ph. D. research.  Wouldn't Mars in the 12th House in Scorpio here clearly indicate vigorously pursuing an activity behind-the-scenes with something research-oriented?  YES.  It does not indicate \"general troubles in every field of life, or one specific and very serious harm.\"  Also, for 2013 and 2014, I have Mars in the 6th House for BOTH those years (in Leo and Sagittarius fire signs, respectively).  I will still be in the research phase of my Ph. D. education, or just about to start writing my thesis and making those results public (which if I do make them public, it will be with great enthusiasm, as indicated by the Mars fire sign placements).  I really don't see how this would relate to a serious health condition at all.  I mean, sure, maybe my Ph. D. education could mentally tax myself, but in my case, that's highly unlikely.\n\nOverall, Ciro needs to infuse a more psychological take of astrology with (what appears to be) his more empirical and fact-based approach.  His book is only second to Mary Fortier Shea's \"Planets in Solar Returns:  Yearly Cycles of Transformation and Growth.\"  If you want the best interpretations for Mars in those three houses, read her!  She's got the real answers there.\n\nOther points worth mentioning:  I feel that Ciro's inclusion of those example charts is just filler material.  That many examples are very unnecessary.  Also, with regard to \"The Index of Risk for the Year,\" you could only find that out with a specific software package.  Why can't you also find that out manually by yourself?  Mr. Discepolo should create a methodology whereby the reader or astrologer could assess certain aspects, positions, placements, etc. for each solar return year and tally up those values (given by Ciro in a table of sorts) to find the Risk Index.  I think that in his next edition (which there should be one), he should consider adding this idea into the text.",
        "description": "['', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1266537600000,
        "asin": "0572002033",
        "title": "Culpeper's Complete Herbal: Consisting of a Comprehensive Description of Nearly All Herbs with Their Medicinal Properties and Directions from Compounding the Medicines Extracted From Them",
        "overall": 4,
        "reviewText": "Raven Starhawk Cunningham's edited rendition of the \"Complete Herbal\" definitely does Culpeper some justice; however, a crucial element is lacking.  The \"Original Epistle to the Reader\" in the beginning of the book is NOT complete.\n\nMs. Cunningham omitted a vital portion of information that is essential to Culpeper's philosophy:  his original instructions on how to exactly apply these herbs (a.k.a. his theory of sympathy, which embodies the Universal Law of Polarity).  Perhaps this is what's meant by the fact that this book is \"edited by...\", and if so, this is very disheartening.  These guidelines are essential to understand if you're going to apply these herbs therapeutically.  Without providing these instructions, as given in his original epistle to the reader, the reader is left clueless regarding the larger scope of this work.  Hence, my 4-star rating.  Other than that, all herbs are included, and the addition of more modern herbs to the compendium is a nice little treat.",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1266537600000,
        "asin": "0964423219",
        "title": "Medical Astrology: Healing for the 21st Century",
        "overall": 2,
        "reviewText": "I've been reading many medical astrology books over the past few years or so, and there have been some winners and some losers.  This book by Marcia Starck falls in between the two categories, with a slight lean towards the losers pile.  The layout is such that she provides a brief background of medical astrology in the first eight chapters, and then gives a chapter-by-chapter synopsis on different diseases with case histories as examples.\n\nIt is clear that she takes all of her information from the \"forefathers\" of medical astrology (H.L Cornell especially) and then combines all those previous ideas/facts with her current experiences.  The background she gives on the planets, signs, history, etc. of medical astrology is rather cursory and brief.  Other bullet points I have to make about this book are as follows:\n\n*There are frequent typographical errors throughout.  I really don't know who was responsible for editing this book, but whoever it was did a poor job doing so.\n\n*It's nice how she gives possible treatments and herbal cures for each disease, but I would only take those in with a grain of salt.  Marcia Starck is NOT a medical professional, and if you do follow her advice, I would suggest consulting with a trusted medical practitioner or someone with proper academic or medical expertise.  If you're interested in medical astrology, I would highly recommend H.L. Cornell's \"Encyclopaedia of Medical Astrology\" as your key source text.  It is written by an M.D. after all.\n\n*To justify the fact that her medical advice should not be taken very seriously, here is a sentence from page 42 that raises a few eyebrows:  \"From the pancreas come the hormones, insulin and glycogen, which are key players in carbohydrate metabolism.\"  Any medical professional or scientist would cringe upon reading that statement.  That is clearly WRONG.  It should read \"insulin and GLUCAGON.\"\n  I've also noticed that in 95% of her disease chapters, she attributes everything to a toxic liver.  She also mentions that the liver is the largest organ in the body, which is NOT true.  The largest organ is the SKIN.  Granted, the liver is extremely important, as it is the epicenter of biotransformation and the metabolism of everything we ingest or put into our bodies (with the kidneys being the other primary organs of filtration).  Still, you cannot attribute the liver as the primary cause of all disease, because that's just not true.  Every time Marcia suggested liver problems in her case histories of diseases that really have nothing to do with the liver, I wanted to just beat myself over the head with her book.\n\n*It is also apparent that Marcia Starck is a feminist, choosing to use \"she\" instead of \"he\" and \"her or his\" instead of \"his or her.\"  She should not have made this out to be a sexist issue, but \"his or her\" just sounds more pleasing to the ear.  Hence, why \"his or her\" is the more common phrase to use when writing in the English language.\n\n*With regard to her coverage of certain diseases, I was completely shocked that there was no chapter whatsoever on diseases of the respiratory system and/or respiratory tract.  That is such a glaring omission on her part, and I do not understand why she did not include that organ system.  Frankly, there is no excuse for this negligent error.\n  Also, she gives 3 chapters on psychological disorders (ADD, schizophrenia, and bipolar disorder).  Those should have been completely removed.  Psychiatric conditions are quite numerous, and to be honest, you could write a whole astrology book only catering to disorders of a psychological nature (which should be done if it hasn't been done already).  If she realized this fact and indeed eliminated those chapters, she could have included a chapter on the respiratory system!  Of course, the mind and body work hand in hand and affect one another equally, but when you try to include diseases of BOTH entities in one medical astrology book, you have a huge mess on your hands.\n\nI'm sorry, but this book just doesn't do it for me.  I can't believe that [...] gives this book a gold star in the medical astrology category.  If you're interested in medical astrology, pass this one by and pick up H.L. Cornell's \"Encyclopaedia\" or Culpeper's works.",
        "description": "['Book by Starck, Marcia', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1276128000000,
        "asin": "0738714518",
        "title": "Evolutionary Astrology: Pluto and Your Karmic Mission",
        "overall": 4,
        "reviewText": "Deva Green's \"Evolutionary Astrology: Pluto And Your Karmic Mission\" is truly a tour-de-force work in astrology.  It lays out a highly effective method for interpreting your life purpose, prior evolution, and what your future existence might hold.  I had to deduct one star due to the fact that there should have been more cookbook-style interpretations given in an ordered and logical format.  I found myself having to skip a few sections that did not pertain to my particular planetary placements and aspects.  Deva's prose is nothing short of brilliant, but she leaves the reader having to pick up on her examples so you can apply them to your own chart.  Of course it's doable after reading her book, but it would have been nice if she laid out the specifics (interpretations of Pluto in each sign and house, the polarity points of Pluto in each sign and house, and the North Node/South Node placements in houses and signs).  In other words, a fusion of both her prose with a few case studies as examples, as well as cookbook-style interpretations, would make this book a magnum opus in the field of evolutionary astrology.\n\nSpeaking of placements, here are mine laid out according to Deva Green's suggested methodology:\n\nPluto in Libra in 9th House\n  -Pluto aspects:  Moon opposition Pluto, Venus sextile Pluto, Mars sextile Pluto, Neptune sextile Pluto, Saturn conjunct Pluto, Pluto and Saturn both conjunct the Midheaven in Scorpio\nPluto's polarity point in Aries in 3rd House\nMoon in Aries in 3rd House\nSouth Node in Sagittarius in 12th House\n  -Neptune conjunct South Node\nSN planetary ruler Jupiter in Sagittarius in 11th House\n  -Sun sextile Jupiter, Jupiter conjunct Uranus, Moon biquintile Jupiter\nNorth Node in Gemini in 6th House\n  -Mercury square North Node\nNN planetary ruler Mercury in Virgo in 8th House\n  -Mercury stationary direct with no planetary aspects.  It only trines my Capricorn Ascendant.\n\nA third-party interpretation of the above would be most appreciated :)",
        "description": "['', 'Deva Green (Oregon) has lectured at the Evolutionary Astrology Conference and the NORWAC conference, and currently runs the Jeffrey Wolf Green School of Evolutionary Astrology.', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1287100800000,
        "asin": "0470454539",
        "title": "CliffsNotes Cbest, 7th Edition (Cliffs Test Prep Cbest)",
        "overall": 3,
        "reviewText": "The 7th Edition of CliffsNotes CBEST does an adequate job of describing the content of the CBEST, and it gives quite an exhaustive review of the math you need to know on the test.  Unlike what was stated in a previous review on here, examples for math problems ARE given, which is good.\n\nThe problem mostly lies in the reading comprehension portion of the book.  Compared to the practice CBEST items given on the official California credentialing website, the reading passages in this book are far more difficult.  In fact, they're just as tough as the reading passages on the GRE test (which I took in 2006)!  It's nice that CliffsNotes gives you some extra reinforcement, but they should adjust the difficulty level to that of the actual CBEST examination.  Boosting the difficulty only makes you feel more intimidated when the actual test comes.\n\nSpeaking of intimidation, take a look at their examples for the Writing section.  The examples given for \"well-written essays\" look like they should be published in an anthology of sorts.  No way can anybody be expected to write essays of that caliber on the CBEST....nobody.  I definitely did not write like that on the Analytical Writing portion of the GRE, and I got a 5.5 out of 6 on that entire section.  What does that tell you?  For the essays, all they care about is whether you can specifically answer the question properly, formulate a logical sequence of opinions or events, and use correct grammar/punctuation/spelling.  That's it!\n\nOn a side note, regarding the practice tests in this book, they only give one writing sample as an answer for each writing section.  There are 4 total practice tests with 2 essays per test; however, only one out of the two is provided as an answer in each test.  It would have been nice if they gave sample answers for BOTH essay topics per test.\n\nIn summary, should you buy this book?  Yes, but only if you don't mind the difficulty being raised a couple notches.  You can either see it as extra reinforcement so that you'll be beyond prepared for the test, or you can view it as more intimidating and a partial waste of precious time.  Your call.....either perspective is equally valid.",
        "description": "['', 'JERRY BOBROW, Ph.D. was a national authority in the field of test preparation. His test-prep company, Bobrow Test Preparation Services, administered test preparation programs at over 25 California institutions.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1305590400000,
        "asin": "0470223553",
        "title": "Physics",
        "overall": 4,
        "reviewText": "This book totally rocks if you're taking an algebra-based physics course at the community college or four-year university level.  It's also great if you're studying for the MCAT.  The problems at the end of each chapter are decent, but that's where this review gets a four star rating rather than five:  Some of the problems are too convoluted and long.  Why should physics problems have to be huge paragraphs in length, especially when it becomes very difficult to draw a diagram from the wording?  I actually had to write to the author about a few of the problems, and he was courteous enough to write me back.  The end result of our little exchange was that the problems under discussion will be revised in time for the next edition!  Gotta love it!\n\nOverall though, I had the absolute worst professor ever for General Physics I, but I still pulled through with an A by constantly referring to this book.",
        "description": "['Cutnell and Johnson has been the #1 text in the algebra-based physics market for over 15 years.', 'Like an elite athlete, students need superior support to reach the top of their game and be successful. Cutnell and Johnson puts students in motion and supports them every step of the way. Acting as essential equipment, PHYSICS 8e aids in the development of conceptual understanding, and shows students the relevance of physics to their lives and future careers.', 'Thousands of students have used Cutnell and Johnson as the equipment they need to build their problem-solving confidence, push their limits, and be successful.']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1310860800000,
        "asin": "0345350804",
        "title": "The Best of H. P. Lovecraft: Bloodcurdling Tales of Horror and the Macabre",
        "overall": 2,
        "reviewText": "OK, I don't know why there are reviews on here pertaining to a more extensive collection of H.P. Lovecraft's stories, but this product only contains six of them.  They weren't entirely awful, but I was expecting a lot more from this author.  \"Bloodcurdling,\" \"horror,\" and \"macabre\" make it seem like these tales would be full of gore and thrilling suspense.  I found neither to be the case.  Even the cover art is deceptive.\n\nI agree with another recent reviewer about the typos...there are quite a few in this book.  They didn't detract from understanding what was going on in the stories, but still, it shows a lack of professionalism on behalf of the editor and publisher.  And for some reason, Lovecraft likes to use the word \"queer\" a lot.  He seems to throw that word out in every other page!  Why did he have a fascination with that word?  Judging from his picture, he seems like a closet case (on top of being a basket case).\n\nWith regard to the story content itself, the material could easily be placed among the canon of X-Files episodes.  Not that that's a bad thing, but I feel like what he wrote about has already been done before.  Maybe if I read his stories during the time period they came out, I'd be in awe, but not today.  Sorry H.P., but your stories don't tickle my macabre fancy.",
        "description": "['Lovecraft is \"the American writer of the twentieth century most frequently compared with <a href=\"/exec/obidos/Author=Poe%2C%20Edgar/${0}\">Poe</a>, in the quality of his art ... [and] its thematic preoccupations (the obsessive depiction of psychic disintegration in the face of cosmic horror),\" writes <a href=\"/exec/obidos/Author=Oates%2C%20Joyce%20Carol/${0}\">Joyce Carol Oates</a> in the <i>New York Review of Books</i>. Del Rey has reprinted Lovecraft\\'s stories in three handsome paperbacks. This first volume collects 16 classic tales, including \"The Rats in the Walls,\" \"The Call of Cthulhu,\" \"The Dunwich Horror,\" and \"The Colour Out of Space.\" Introduction by Robert Bloch. Wraparound cover art by Michael Whelan.', 'This is the collection that true fans of horror fiction have been waiting for: sixteen of H.P. Lovecraft\\'s most horrifying visions, including Lovecraft\\'s masterpiece, THE SHADOW OUT OF TIME--the shocking revelation of the mysterious forces that hold all mankind in their fearsome grip.<br>\"I think it is beyond doubt that H.P. Lovecraft has yet to be surpassed as the Twentieth Century\\'s greatest practitioner of the classic horror tale.\"<br>Stephen King']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1329609600000,
        "asin": "0801672368",
        "title": "Anderson's Pathology (10th Edition)",
        "overall": 5,
        "reviewText": "Yes, I said it.  Anderson's Pathology is the greatest educational resource you will ever find on the subject of general pathology.  This two-volume magnum opus, clocking in at 80 chapters with over 2900 pages worth of material and weighing what seems like almost 15 pounds, contains comprehensive information on every single surgical pathology topic known to man.  Granted, some of the terms and tumor classification schemes are outdated, but what does that matter?  All of the basic morphological characteristics and salient clinical features of every known disease and cancer subtypes are thoroughly explained with a plethora of photographs to boot (both of the gross macroscopic and histologic varieties).\n\nAs a practicing Pathologist's Assistant, graduate student, and prospective medical student, I can't recommend these texts enough.  I am also the proud owner of Robbins & Cotran's Pathologic Basis of Disease 7th edition (the \"gold standard\" pathology text that practically every medical student is exposed to) as well as Rubin's Pathology 4th edition.  Both of those textbooks, as great as they are, just cannot compare to Anderson's Pathology.  As far as I know, no other pathology textbook contains the pathogenesis of different colored gallstones, a wonderful page dedicated to the actual surgical dissection and gross description of prostatic adenocarcinoma, and a great appendix of organ weights and measurements.\n\nUnfortunately, there is absolutely no way to obtain a brand new copy of this set on Amazon, and to the best of my knowledge, this is the last (and only) edition available (10th edition, 1996).  For the medical residents and practicing pathologists out there, check to see if the medical library at your hospital has this set.  Otherwise, I guess you can take a shot at buying these books used from a third party on here, but I wouldn't trust doing so unless the transaction is fulfilled by Amazon.",
        "description": "['School of Medicine', 'Department of Pathology &amp; Laboratory Science', 'The University of Kansas Medical Center', '3901 Rainbow Blvd.', 'Kansas City, KS 66160-7410', '', '']",
        "domain": "Books"
    }
]