[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1041120000000,
        "asin": "6302105838",
        "title": "Star Trek - The Next Generation, Episode 3: The Naked Now VHS",
        "overall": 5,
        "reviewText": "Don't let the fact that this episode was taken from the excellent Original Series episode \"The Naked Time\" fool you!  This is the funniest, and I mean, FUNNIEST, star trek episode of all time, with phenomenal acting involved from all cast members.  The limerick Data gives to Picard about the person from Venus having a big you-know-what is TIMELESS!  Being such a huge Captain Picard fan, his acting in this episode made me think to myself, \"Was he on drugs before he read the script?\"  Superb acting!\nFor example, just look at the scene where he and Dr. Crusher are in the ready room discussing the virus and those infected.  When Picard and Crusher get really close to each other face-to-face, I MUST ASK YOU ALL THIS QUESTION:  what is the sound Picard makes coming from his throat???  You actually see his throat move a bit and something like \"huhuhuhuhuhu\" comes out.  It can't be a laugh because it's misplaced.  The sound just doesn't fit there!!  If anyone can give me a reason for this, I'd LOVE to know!\nThe only other episode that can compare with this episode is \"Chain of Command Parts 1 and 2.\"  Just listening to Picard screaming out, \"THERE ARE 4 LIGHTS!\" is hysterical!  When he gets shocked by the implanted device is also quite classic!\nAll in all, \"The Naked Now\" ranks NUMBER 3 on my Top 10 TNG Episodes, right behind \"The Best of the Both Worlds\" and \"Chain of Command.\"  TERRIFIC!",
        "description": "['\"The Naked Now\" is a must-own for all TNG fans. Who cares if it\\'s basically a retread of the original series\\' \"Naked Time\" or that it breaks out every <I>Star Trek</I> clich in the book? This episode lays the groundwork for fundamental relationship story lines that take seven years to unfold. Thanks to some nasty alcoholic space bug, the crew of the <I>Enterprise-D</I> loses all inhibition and has a good ol\\' time. See Picard and Doctor Bev get hot and heavy. Watch in awe when Troi asks Riker \"Don\\'t you want to be alone with me in your mind?\" Find out what \"fully functional\" <I>really</I> means whether you want to or not. Of course, all good things must come to an end. (Un)fortunately, Dr. Crusher finds a cure and Wesley saves the day. \"Naked Now\" is so joyously and transcendentally bad, it\\'s good. A number one guilty pleasure among <I>TNG</I> fans everywhere. <I>--Kayla Riggney</I>', \"Captain Jean-Luc Picard (Patrick Stewart) and the crew of the new Starship <I>Enterprise</I> return in this action-packed episode from <b>Star Trek: The Next Generation.</b><P> What would cause the crew members of a research vessel to party with wild abandon and then voluntarily blow open the air locks of their ship, killing themselves? While investigating this mystery, Geordi (LeVar Burton) contracts a deadly virus which spreads through the <I>Enterprise,</I> promoting symptoms of promiscuity and intoxication among the crew and imperiling the ship.<P> Can Dr. Beverly Crusher (Gates McFadden) find an antidote - before it's too late?\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1272326400000,
        "asin": "B002MZZMRM",
        "title": " Inglourious Basterds [Region Free] [UK Import]",
        "overall": 5,
        "reviewText": "\"Are you aware of the job I've been ordered to carry out here in France?\"\n  - Hans Landa\n\n\"Inglourious Basterds\" is one of Quentin Tarantino's masterpieces, bar none. The film is brilliantly epic in every sense of the word.  I don't consider it a \"war movie\" at all, like some people do.  It could be considered a World War II movie since it features Hitler and the Nazis, but I still wouldn't call it exclusively that type of movie.  It's a wonderfully executed and artfully shot Tarantino shock drama.  THAT'S what it is, and it is done oh so well!\n\nChristoph Waltz more than deserved the Best Supporting Actor Oscar for his role as Hans Landa, the Gestapo security chief. He's what made the movie. As for Brad Pitt's character, Aldo, he can get a little annoying at times with that ridiculous accent. I personally would've loved to see someone other than Pitt play that role.\n\nTrue, there isn't as much gore in this film when you compare it to Quentin's other films, but his signature shock twists are right up there with the best of them. \"Inglourious\" definitely made it into my top 10 favorite movies of all time.\n\nAs far as the Blu Ray features are concerned, I personally thought that they should have included longer and more in-depth features, but that doesn't detract from my 5-star rating.  The picture quality is exceptional, and the audio is fantastic on 5.1 surround sound speakers.  The bullets literally shake your floor!  Don't even rent this movie...BUY IT!\n\nOh and yes, let me not forget...for you potential buyers, a glass of milk!",
        "description": "['Quick Shipping !!! New And Sealed !!! This Disc WILL NOT play on standard US DVD player. A multi-region PAL/NTSC DVD player is request to view it in USA/Canada. Please Review Description.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1272326400000,
        "asin": "B002OVO18A",
        "title": "The House of the Devil",
        "overall": 1,
        "reviewText": "Are they on drugs or something?  This movie was AWFUL . . . such a disgrace to horror films both past and present.  \"The tension-building was incredible\"...\"Some people may say it's slow and boring, but...\"  YES!  It WAS slow and boring!  Tension-building?  85% of the film went by at a snail's pace, purely focusing on a teenage girl worrying about how to pay for her new apartment (which you would THINK would be the subject of this film at first, but it's not).\n\nYou already know the plot of the movie, which you can gather from the description and other reviewers, so I'm not going to go into detail about that here.  I'll just say that the tension-building was rather poor, and plenty of questions needed to be answered due to poor plot development.  There were just two brief parts that interested me:  the part where the guy shot the girl in the car (came out of nowhere...couldn't help but yell out a big OHHH! at that one, much like the bus scene from Final Destination), and when the telephone rang (caused me to jolt a bit).  But that was IT.\n\nBottom line is that you should avoid this film at all costs.  Don't waste your time on it.",
        "description": "[\"The Horror Film of the Year available on DVD.<br><br>Sam (Donahue) is a pretty college sophomore, so desperate to earn some cash for a deposit on an apartment that she accepts a babysitting job even after she finds out there is no baby. Mr. and Mrs. Ulman (cult actors Noonan and Woronov) are the older couple who lure Sam out to their creaky Victorian mansion deep in the woods, just in time for a total lunar eclipse. Megan (Gerwig) is Sam's best friend, who gives her a ride out to the house, and reluctantly leaves her there despite suspecting that something is amiss. Victor (Bowen) at first seems like just a creepy guy lurking around the house, but quickly makes it clear that Sam will end this night in a bloody fight for her life...<br><br>2009 Top 10 List Selections:<br>TimeOut New York<br>The Onion<br>AMCtv<br>Sound on Sight\", 'At once a sly tribute to \\'80s-era grind-house cinema and a remarkable exercise in suspense, writer-director Ti West\\'s <i>House of the Devil</i> is a terrific--and terrifying--horror film that can be enjoyed by genre fans and outsiders alike. West\\'s premise hinges on the \"Satanic panic\" that gripped America during the Reagan era--in a nutshell, the urban legend posited that secret devil cults were kidnapping and sacrificing individuals by the thousands--and melds it with the tried-and-true babysitter in an old dark house scenario. The house in question is the property of the Ulmans (cult faves Tom Noonan and Mary Woronov), and the babysitter (newcomer Jocelin Donahue) is needed to simply keep an eye on things--and an unseen mother upstairs--until midnight, when, coincidentally, a total eclipse will occur. But the chills that ensue--and there are plenty--are driven more by slow-building atmosphere than by the bloody effects that sum up \\'80s shocks. That\\'s not to say that there isn\\'t gore on display, but it\\'s not the film\\'s raison d\\'&ecirc;tre; neither are the nostalgic trappings, which are kept to a tasteful minimum. The end result is a genuinely unsettling horror effort that brands West as an indie director who\\'s more than capable of moving up to the majors. The disc includes two informative commentary tracks, the first by West and Donahue, and the other with West, producers Larry Fessenden (<i>The Last Winter</i>) and Peter Phok, and sound designer Graham Reznick; there\\'s also a pair of making-of featurettes and three deleted scenes, one of which, involving the Ulmans\\' mother, is worth a look. The original trailer for <i>House of the Devil</i>, as well as spots for other Dark Sky releases, round out the extras. <i>--Paul Gaita</i>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1272412800000,
        "asin": "B000059PR3",
        "title": "The House By the Cemetery VHS",
        "overall": 5,
        "reviewText": "\"The House By The Cemetery\" is one great horror flick.  The story is well-told and not too hard to grasp:  Dr. Fraudstein from the early 20th Century performed deranged human experiments whereby cells only regenerate through the consumption or application of human flesh.  Now in the latter 20th Century, a research Professor wants to investigate the work of a Dr. Peterson who was initially interested in Dr. Fraudstein's work...a chain reaction of interest of sorts.  Research doc and his family move into Dr. Fraudstein's house and all hell breaks loose.\n\nThe gore was right on target...a true gorefest, which is what I love in horror films.  No slow parts at all to the movie either.  It held my interest throughout, and I wouldn't hesitate to give this a second viewing.  Such a rare gem of a film!",
        "description": "[]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1274313600000,
        "asin": "B0021L8UXK",
        "title": "The Crazies",
        "overall": 5,
        "reviewText": "Loved it, plain and simple.  Great shock value, capable of being watched more than once, and the storyline is believable.  The military injecting a virus into a town's water supply?  Priceless....awesome movie....a must-see!",
        "description": "['Imagine living in a small town where everything is safe and happy... until suddenly it isn\\'t. Imagine your friends and neighbors going quickly and horrifically insane. In a terrifying tale of the \"American Dream\" gone horribly wrong, four friends find themselves trapped in their hometown in The Crazies, a reinvention of the George Romero classic directed by Breck Eisner from a screenplay by Ray Wright (Pulse, Case 39) and Scott Kosar (The Amityville Horror, The Texas Chainsaw Massacre).David Dutten (Timothy Olyphant) is sheriff of Ogden Marsh, a picture-perfect American town with happy, law-abiding citizens. But one night, one of them comes to a school baseball game with a loaded shotgun, ready to kill. Another man burns down his own house...after locking his wife and young son in a closet inside. Within days, the town has transformed into a sickening asylum; people who days ago lived quiet, unremarkable lives have now become depraved, blood-thirsty killers, hiding in the darkness with guns and knives. Sheriff Dutten tries to make sense of what\\'s happening as the horrific, nonsensical violence escalates. Something is infecting the citizens of Ogden Marsh...with insanity.Now complete anarchy reigns as one by one the townsfolk succumb to an unknown toxin and turn sadistically violent. In an effort to keep the madness contained, the government uses deadly force to close off all access and won\\'t let anyone in or out - even those uninfected. The few still sane find themselves trapped: Sheriff Dutten; his pregnant wife, Judy (Radha Mitchell); Becca (Danielle Panabaker), an assistant at the medical center; and Russell (Joe Anderson), Dutten\\'s deputy and right-hand man. Forced to band together, an ordinary night becomes a horrifying struggle for survival as they do their best to get out of town alive.', 'This 2010 remake of a somewhat obscure 1973 George Romero picture injects a mysterious virus into the water supply of a small Iowa town, and the consequences are&hellip; well, you didn\\'t expect the consequences to be positive, did you? The movie is called <em>The Crazies</em>, after all. So when local folk begin acting a mite peculiar, it just means they\\'ve gone to the well too often--literally. Borrowing the structure of <em>Invasion of the Body Snatchers</em>, the remake gets off to a clumsy start, but as the noninfected rally around the sheriff (Timothy Olyphant) and his doctor wife (Radha Mitchell), the action becomes streamlined and reasonably inventive. Director Breck Eisner has a particular knack for finding ingenious ways of killing people (a knife through the hand becomes a useful tool for the sheriff in one turn-the-tables moment), and he\\'s been wise enough to hire respectable actors for the top-lined duties; along with Olyphant and Mitchell, there\\'s also Joe Anderson (<em>Across the Universe</em>) as a loyal, amped-up deputy. If the movie misses the tart social-context stuff that Romero does so well, it at least fills the bill when it comes to the chase-and-escape business of a contemporary horror picture. The spate of such 21st-century remakes of 1970s horror pictures misses the raw, raggedy unease of those low-budget projects, but if you\\'re going to make a slick new update, <em>The Crazies</em> is the way to do it. <em>--Robert Horton</em> <span class=\"h1\"><strong><br /><br />Stills from <em>The Crazies</em> (Click for larger image)</strong></span> <table border=\"0\" cellpadding=\"4\" cellspacing=\"4\" width=\"100%\">', '', '', '', '', '', '']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1275696000000,
        "asin": "B001RVPOPW",
        "title": "Antichrist",
        "overall": 1,
        "reviewText": "I can't even understand why this movie was even made.  Basic plot:  kid falls out the window while couple is having sex, wife goes through a long and drawn-out grieving process while therapist husband tries to help her, they go off to the woods so that she can confront her fears, she goes a little batty on husband, and husband finally chokes her to death, then burns her body.  That's all, folks.\n\nI didn't find this movie that disturbing, except for two parts:  when the wife was pleasing his phallus, which he then ejaculated blood; and when the wife cut off her own clitoris.  Amazing stuff, huh?  Please...  What the director/screenwriter should have done was incorporate more of the \"satanic\" elements into the movie.  All you see are pictures of medieval witchery, which were the subject of the wife's thesis.  Although this was never explicitly revealed in the movie, my best guess is that she literally \"became\" her thesis.  If only that concept was developed further....  As such, this is a half-star film.",
        "description": "[]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1317686400000,
        "asin": "B0043VUHXC",
        "title": "The Universe: 7 Wonders of the Solar System",
        "overall": 2,
        "reviewText": "I was very disappointed in the 3D effects in The Universe.  For a space feature, you should have awesome 3D popping out effects, and there were none here.  I will refer you all to my Mummies: Secrets of the Pharaohs 3D review I just made on here, because what I wrote there applies here as well.",
        "description": "['We are in the midst of the greatest era of space discovery. Twenty first-century spacecraft and sophisticated imaging technology are venturing into uncharted territory every day, and much of the extraordinary phenomena are happening right in our own cosmic backyard.<br><br>Take an exhilarating, unprecedented 3D tour of the seven most amazing wonders of our solar system, beginning with a trip to Enceladus, one of Saturn s outer moons, where icy geysers spout from its surface. Then venture to Saturn s famous rings, which contain mountain ranges that rival the Alps; dive into Jupiter s Great Red Spot, the eye of the biggest storm in the solar system; soar through the Asteroid Belt, made of millions of rocks left over from the formation of the solar system; trek up Mount Olympus, the largest volcano located on Mars; have a close encounter with the searing surface of the sun; and finish the journey by exploring our very own home planet Earth.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1317686400000,
        "asin": "B002FUIIZW",
        "title": "IMAX: Mummies- Secrets of the Pharaohs",
        "overall": 2,
        "reviewText": "Mummies: Secrets of the Pharaohs was the first 3D feature I bought to test out my new Acer 3D monitor, and let me tell ya...The 3D was TERRIBLE.  I was expecting some nice pop-out effects, but in the forty-or-so minutes of this documentary, there was only one:  a lizard that randomly comes out at you during one segment.\n\nI'm sorry, but when I see 3D, I expect to see some really nice, cool-looking effects.  I know that depth is a key element to 3D, but this video had too much inward depth and not enough OUTWARD depth.  It works both ways!\n\nFrom now on, my official 3D Blu-ray review ratings will consist of 1 star maximum for content and 4 starts for 3D quality (1 being very poor, 2: fair, 3: good, 4: excellent).  Mummies gets the star for content, but a very poor rating for 3D.  Hence. TWO STARS overall.",
        "description": "[\"In mind-blowing IMAX detail, unravel the enshrouded human time capsules that have become the most fascinating mystery of our time Egypt's mummies. Probe ancient tombs to uncover these carefully hidden phenomena, and follow top scientists as they embark on a modern-day forensic investigation of the mummies that could have huge implications in the study of modern diseases. Film scanned at 8K for superior video quality.<br><P><br><br>Wrapped With Special Features: Full-length Making-of-Featurette shot in HD: Meet The Mummies - Educational Section, Mummies Quiz, Additional Spanish and French tracks in DTS Master Audio 5.1\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1317772800000,
        "asin": "B002ZG9788",
        "title": "Clash of the Titans",
        "overall": 3,
        "reviewText": "I really enjoyed this film a lot, being a huge fan of the original 1981 classic.  I don't see it as a re-make at all, and it doesn't interfere in any way with the original film.  It's a great stand-alone movie in its own right, and I give it 5 stars for that.  However, the 3D effects were just terrible.  I didn't see any popping-out effects at all.  There was depth, sure, but it's not all I wanted.  These producers or 3D specialists really need to add more outward depth to these films!  From now on, I'm going to consult with Amazon reviews for any future 3D purchases I make.  When I want 3D, I WANT 3D!!!",
        "description": "['In <i>Clash of the Titans</i>, the ultimate struggle for power pits men against kings and kings against gods. But the war between the gods themselves could destroy the world. Born of a god but raised as a man, Perseus (Sam Worthington) is helpless to save his family from Hades (Ralph Fiennes), vengeful god of the underworld. With nothing to lose, Perseus volunteers to lead a dangerous mission to defeat Hades before he can seize power from Zeus (Liam Neeson) and unleash hell on earth. Battling unholy demons and fearsome beasts, Perseus and his warriors will only survive if Perseus accepts his power as a god, defies fate and creates his own destiny.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1317859200000,
        "asin": "B001GCUO4S",
        "title": "The Final Destination",
        "overall": 4,
        "reviewText": "Out of the three 3D Blu-ray movies I've seen so far (Mummies, The Universe: 7 Wonders, and Clash of the Titans), The Final Destination has the best effects out of the group.  The 3D is very well done, in my opinion.  I love those pop-out effects with the sticks, snake (especially was cool), and other shrapnel.  I've always been a fan of the entire FD series, and this film is no exception.\n\n5 stars from me for the film content.  3D rating is on a scale of 1 star for very poor, 2 for fair, 3 for very good, and 4 for excellent.  This gets a 3 from me in the 3D department, so 4 stars overall.",
        "description": "['<![CDATA[', 'Final Destination, The (2009) (DVD)', \"Nick and some friends head to the racetrack for the weekend to watch a car race. , when the terrifying accident flys into the audience at 180 mph. People will splatter and be ripped apart, one girl gets her head knocked off by a flying tire, massive explosions, and eventually the entire stadium collapses onto the rest of the audience.Then Nick discovers it was just a vision that's about to happen, and he gets himself and about 12 other people ejected from the stadium.But Death returns to finish off the survivors, with the freak accidents being more brutal than ever.\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1319500800000,
        "asin": "B00000JNCI",
        "title": "The Sentinel VHS",
        "overall": 5,
        "reviewText": "The Sentinel is one of my top 10 favorite horror films of all time.  It has a very simple plot:  woman lives in an apartment that's haunted by past tenants who happen to be murderers, and she's next in line to serve as the Gatekeeper to Hell.  Simple, and it works!  There's also a generous amount of blood and gore, too.  The cast is fantastic:  Chris Sarandon (from Fright Night fame), Beverly D'Angelo (National Lampoon's Vacation...and you see her breasts!), Christopher Walken, Jeff Goldblum, and Burgess Meredith (Penguin from the classic Batman series).\n\nI've actually visited the area in Brooklyn on Montague St. where the apartment complex seen in the movie is located.  It's still there!!  Definitely is an awesome sight after having seen this movie.\n\nAlso, towards the end of the movie when Chris Sarandon chokes Father Halloran on the floor, they zoom in on a portrait of St. Rita.  I have that EXACT same portrait hanging in my house!  In fact, I got it at a garage sale a few years ago...Some woman down the block from me was just giving it away.  And I first saw this movie AFTER I got the portrait!  You have no idea how creepy it felt to see that same picture in the movie!  I'm not sure if there are any replicas out there, but to the best of my knowledge, the portrait I have in my possession right now is the SAME one that was used in the movie!!!\n\nI constantly paused that part in the movie just to compare the two portraits, and they're identical. On the bottom of my portrait is a gold plaque with \"Saint Rita\" engraved on it.  It's slightly off-center, so I tried to see if the off-center plaque was also visible on the portrait in the movie.  Unfortunately, the entire bottom of the painting is blacked out, so I couldn't tell if it had the plaque or not!  Very weird...\n\nIf anybody else has that same portrait, please let me know.  If not, then I absolutely have a prop from the film!",
        "description": "['Horror']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1331164800000,
        "asin": "B0000DKMK0",
        "title": "Kill Bill: Volume 1",
        "overall": 5,
        "reviewText": "\"Revenge is a dish best served cold...\"\n\nAin't that the truth?!  Without a doubt, we have another Tarantino winner on our hands!  \"Kill Bill Vol. 1\" is up there with Pulp Fiction and Inglourious Basterds.  It's apparent that Quentin wanted to incorporate a western and martial arts theme into this movie, and he pulls it off nicely.  His signature \"shock and awe\" style of action is all here, and the sword-fighting in this film is some of the best I've ever seen.\n\nMy only minor complaint is that I think he shouldn't have cast Uma Thurman to play the role of The Bride, but hey, whatever floats his boat (which has now long floated by for this film).  As far as the Blu-ray is concerned, the picture is 5-star quality, and the sound is crystal-clear.  Hearing The Bride's sword swathe through the air with that metallic din resonated off my tympanic membrane with sheer bliss.\n\nNice work, Quentin baby!",
        "description": "[\"The acclaimed fourth film from groundbreaking writer and director Quentin Tarantino (PULP FICTION, JACKIE BROWN), KILL BILL VOLUME 1 stars Uma Thurman (PULP FICTION), Lucy Liu (CHARLIE'S ANGELS, CHICAGO), and Vivica A. Fox (TWO CAN PLAY THAT GAME) in an astonishing, action-packed thriller about brutal betrayal and an epic vendetta! Four years after taking a bullet in the head at her own wedding, The Bride (Thurman) emerges from a coma and decides it's time for payback ... with a vengeance! Having been gunned down by her former boss (David Carradine) and his deadly squad of international assassins, it's a kill-or-be-killed fight she didn't start but is determined to finish! Loaded with explosive action and outrageous humor, it's a must-see motion picture event that had critics everywhere raving!\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1331251200000,
        "asin": "B00005AQ65",
        "title": "Vol. 2",
        "overall": 4,
        "reviewText": "There's no doubt that Kill Bill, Vol. 1 was the better film.  It had more gore, more shock and awe events, and more martial arts-sword fighting action.  Quentin Tarantino's signature movie-making style is all here, but this time, he toned it down a bit and decided to focus more on plot.  That's certainly not a bad thing, as he wraps up the entire backstory here nicely.  I just wish there was more \"mmph\" in this film, at least on par with Vol. 1.  For that, it gets 4 stars rather than 5.\n\nBlu-ray quality is the same as Vol. 1: crystal-clear picture and great sound.\n\nFOUR STARS",
        "description": "[]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1331337600000,
        "asin": "B002VECLVY",
        "title": " A Single Man [Blu-ray]",
        "overall": 5,
        "reviewText": "\"A Single Man\" is one of the best pieces of dramatic art I've ever seen on the silver screen.  Major kudos to director Tom Ford for bringing out the hauntingly poetic and deeply emotional scenes that are peppered throughout this film.\n\nSimply put, the overarching plot theme is one of lament over the loss of a loved one and how one copes with that loss.  During the lamenting and grieving process, the individual (George Falconer, portrayed by Colin Firth) comes across experiences that not only pose a challenge to his own grieving process, but also give him reason to continue living life to its fullest.  Evident in this film are discussions of extremely philosophical issues such as life and death, fear, friendship, intimacy (both male-female AND male-male), and love.\n\nI've watched \"A Single Man\" twice so far, and the second time was better than first.  There are scenes in this film where George has these intense discussions with a few of the characters, and you're left on the edge of your seat with that feeling of \"will he do it?  will he?!  what's going through their minds?!\"  It's just GREAT.  The element of dramatic pause is also used extensively in this film, and it really hits the mark with increased on-screen tension.  As for Colin Firth, THIS was the role that he should have won the Best Actor Academy Award for, not King George in \"The King's Speech\"!  The scene where he receives the phone call that his lover died was enough to literally hand him that Oscar.  Thankfully, he did get his rightfully deserved Academy Award, but I think it came a little late for him.  Also, this film was snubbed from the Best Picture category, and I think it should have received a nomination at the very least.  I know for a fact that I'll be watching this movie many times over the course of my life...it's just that amazing!\n\nFIVE STARS",
        "description": "['A SINGLE MAN is based on the novel of the same name by Christopher Isherwood. Set in Los Angeles in 1962, at the height of the Cuban missile crisis, it is the story of a British college professor (Colin Firth) who is struggling to find meaning to his life after the death of his long time partner. The story is a romantic tale of love interrupted, the isolation that is an inherent part of the human condition, and, ultimately, the importance of the seemingly smaller moments in life. 2009 Critics Choice Awards nominations include Colin Firth (Best Actor), Julianne Moore (Best Actress), Best Screenplay and Best Art Direction. 2010 Golden Globe nominations include Colin Firth (Best Performance by an Actor in a Motion Picture  Drama), Julianne Moore (Best Performance by an Actress In A Supporting Role in a Motion Picture) and Best Original Score - Motion Picture.', 'Colin Firth gives the performance of a lifetime in <em>A Single Man</em>, a drama directed and adapted for the screen by fashion designer Tom Ford, who clearly has a deft vision and ability in the world of film as well. <em>A Single Man</em> is based on a novel by Christopher Isherwood, and Ford\\'s--and Firth\\'s--gift is bringing the inner-turmoil world of the novel to believable, and devastating, life on the screen. Firth may be best known as a dashing romantic-comedy hero (<em>Pride and Prejudice</em>, the <em>Bridget Jones</em> films), but in <em>A Single Man</em> he demonstrates nuance and depth that will stay with the viewer long after the film is over. Firth plays George, a gay British professor, living a life of true, if closeted, bliss with his partner, Jim (Matthew Goode), in the straitlaced early \\'60s. When Jim dies suddenly at the beginning of the film, George wrestles with how to go on without his true love--and with never being able ever to express his grief openly. The film flashes back to scenes of George and Jim and their dogs, scenes awash in warm tones, and then forward to the present, shot in subtle sepia tones that show joy has disappeared from George\\'s life. Yet there are flashes of hope and feeling: one brief scene--showing George\\'s seeing a dog similar to one the couple had owned, and drawing his face close to the dog\\'s for a familiar and comforting scent--lasts but a moment yet resonates that grief and loss are felt the same by everyone, no matter what they have lost. <em>A Single Man</em>\\'s cast also includes Julianne Moore, playing a complex role as George\\'s best friend and long-ago lover--one of the only people on the planet who can know all that George is going through, yet with vast vulnerabilities of her own. Nicholas Hoult plays a student who reaches out to George, saying, \"I guess I just thought you looked like you could use a friend.\" But it\\'s Firth who triumphs in the film, and who drives the complex emotions--all true, all rewarding--that hold <em>A </em><em>Single </em><em>Man</em> aloft and give it its impact. <em>A Single Man</em> can hold its own against <em>Brokeback Mountain</em> as a story of love and loss that transcends any single genre. --<em>A.T. Hurley</em> <br><br><br> <span class=\"h1\"><strong>Stills from <I>A Single Man</I> (Click for larger image)</strong></span> <table border=\"0\" cellpadding=\"4\" width=\"100%\" cellspacing=\"4\">', '', '<tr align=\"center\" valign=\"top\"> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_2_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_2_S.jpg\"></a> <br> </td>', '<td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_5_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_5_S.jpg\"></a> <br> </td> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_4_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_4_S.jpg\"></a> <br></td>', '<tr align=\"center\" valign=\"top\"> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_6_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_6_S.jpg\"></a><br></td>', '<td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_3_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_3_S.jpg\"></a><br></td> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_7_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_7_S.jpg\"></a><br></td> <br></td>', '<tr align=\"center\" valign=\"top\"> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_1_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_1_S.jpg\"></a><br></td>', '<td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_9_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_9_S.jpg\"></a><br></td> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_8_L.jpg\"><img border=\"0\" align=left src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/sony/APlusDetailPages/ASingleMan/Single_Man_8_S.jpg\"></a><br></td> </tr> </table>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1331769600000,
        "asin": "B0002WYTWG",
        "title": "Terminator, The",
        "overall": 2,
        "reviewText": "You're better off with the HD DVD version of this movie instead.\n\nThe movie itself is worthy of 5 or more stars, but the transition to Blu-ray is awful.  There's absolutely no difference between the HD DVD version and the blu-ray.  Film grains are STILL seen in the Skynet Edition.  The picture looks very clean and high-def in brightly lit scenes, but in darker environments, the graininess is ridiculously noticeable.  You would think that they'd clean that up!\n\nAlso, if you notice, nowhere on the blu-ray case itself does it say the magic code, 1080p.  Usually, the 1080p designation indicates a crystal-clear image without any major film grains.  Since that's nowhere to be seen on the case, expect the picture to be on the crappy side.\n\nLastly, please note that your Blu-ray player has to be connected to the Internet in order to play this film, and you need to have sufficient hard disk space in order to download the extra features.  Unless you have a PS3, make sure your blu-ray player has enough space or attach a USB drive or external hard drive to it.  Without those peripherals, the movie will not load at all.\n\nSo in summary, this is a 5-star film, but it's a one-star Blu-ray.  I gave it an extra star because I got it super cheap (less than six bucks).  I bet you it's that cheap because of exactly what I said above.",
        "description": "['In the year 2029, the ruling super-computer, Skynet, sends an indestructible cyborg (Arnold Schwarzenegger) back in time to 1984 to kill Sarah Connor (Linda Hamilton) before she can fulfill her destiny and save mankind.']",
        "domain": "Movies_and_TV"
    }
]