[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1256169600000,
        "asin": "B001TOQ8K2",
        "title": "Punch-Out!!",
        "overall": 4,
        "reviewText": "Punch-Out!! for the Wii is probably one of the best re-makes of a Nintendo classic I've ever come across in years.  The graphics are literally gorgeous when you compare them to other Punch-Outs for the NES and SNES, and the movesets are all very creative.  However, this game earned 4 stars instead of 5 for a few minor setbacks.\n\n*There is only ONE new boxer (Disco Kid), not including the hidden Donkey Kong character in Last Stand Mode.  It's nice how Nintendo decided to coalesce the fighters from their previous Punch-Out games and put a slight spin on them, but seriously, if they're going to make a sequel to this, there should be completely brand-new fighters.  The fact that the fighters have different moves after you beat the game in Career Mode doesn't make up for it.  With the current game, there are 13 total fighers (14 with D.K.), but there should have been AT LEAST 6 new fighters.  They could have gotten rid of Glass Joe, Piston HondO (why the name change, I don't know), Don Flamenco, etc.  Super Macho Man and the rest of the \"hardest\" fighters should be permanent.  Otherwise, out with the old and in with the new.\n\n*It's great how you can use the controller in the classic NES style.  God forbid if you use the Nunchuk and the Wiimote.  Don't even try it!  It's awful.  If you want the best boxing experience, use the Wiimote like the classic NES controller.\n\n*About the controls themselves:  Occasionally, you won't get a response from them during the match.  When facing Mr. Sandman, for example, the character does one thing when you intended him to do something else (i.e. dodging his delayed overhand smash and winding up not hitting him in time when you pressed the correct button).\n\n*The sound bites and music are amazing.  Great tunes and awesome voices.  However, this can be totally taken in a racist direction.  You have Bald Bull screaming, \"Achmed!!  Allah!!\" (Muslim terrorist); Great Tiger with his Taliban-esque vocabulary; Piston Hondo with his Jap stuff; etc.\n\n*There were also some technical errors I discovered.  During the Mr. Sandman match (you can see how much I love this guy), Doc Louis says in between rounds, \"Wake Mr. Sandman up!! The fans wants a new champ!!\"  That's grammatically incorrect, and the designers should've noticed this error.  Also, the ages given for the boxers DO NOT correlate with their physical appearance.  Super Macho Man is 27 years old????  He's got white hair and looks like he's in his 50s.  Come on, now.\n\nOverall, the game was a very entertaining experience.  I thoroughly enjoyed it.\n\n4 Stars out of 5.  The breakdown is as follows (on a letter grading scale):\nGraphics:  A\nSound:  A\nGameplay: B+\nControls:  B-\nReplay Value:  A",
        "description": "['One of the biggest names in boxing returns after a 15-year hiatus. Grab a Wii Remote controller in one hand and a Nunchuk controller in the other and step back into the ring with a modern update of the classic Punch-Out!! Little Mac is back! Everyone&#8217;s favorite underdog from the 1980s joins the best of the original Punch-Out!! cast in a modern re-imagination of the series. Players will find familiar names like Glass Joe, King Hippo and trainer Doc Louis. These boxers come to life again in cel-shaded 3-D, complete with hilarious fighting animations and back stories that capture all the fun and flair of the original Punch-Out!! games. The motion-sensitive controls of the Wii console mean that when players throw punches, Little Mac throws punches as well. Additionally, you can control hooks and jabs by combining motion control with control-stick movement. The motion-sensing Wii Remote and Nunchuk controllers turn real-life swings into on-screen punches, so anyone can play. The game can also be played with classic NES-style controls by turning the Wii Remote sideways.', '<table border=\"0\"> <tr> <td><a name=\"product_description\"></a>One of the biggest names in boxing returns after a 15-year hiatus. In <i>Punch-Out!!</i> you play as young up-and-coming fighter Little Mac who, with the help of his ringside trainer Doc Lewis, is working his way through the ranks of a wide variety of boxing caricatures, each with their own patterns of attacks. Grab a Wii Remote controller in one hand and a Nunchuk controller in the other and step back into the ring with a modern update of the classic <i>Punch-Out!!</i> <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table width=\"200\" border=\"0\" cellpadding=\"5\" align=\"left\" cellspacing=\"0\"> <tr> <td valign=\"top\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.logo.200.jpg\" alt=\"\\'Punch-out!!\\' game logo\" width=\"200\" height=\"100\"><br/> <small><center><b><i></i></b></center></small></td></tr></table> <table align=right width=250 cellpadding=10> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=458\\'); return false;\"><img alt=\"Manhandling Glass Joe in \\'Punch-Out!!\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.01.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Tune your skills in early rounds.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=458\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=458\\'); return false;\"><img alt=\"Timing puches against Von Kaiser in \\'Punch-Out!!\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.02.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Key off tells in the ring.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=458\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=497\\'); return false;\"><img alt=\"Battling King Hippo in \\'Punch-Out!!\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.03.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">13 over the top opponents.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=497\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=497\\'); return false;\"><img alt=\"Star punch against Glass Joe in \\'Punch-Out!!\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.04.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Do max damage with \\'Star punches\\' .<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=497\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> <b>Little Mac Is Back</b><br/> Everyone&rsquo;s favorite underdog from the 1980s joins the best of the original <i>Punch-Out!!</i> cast in a modern re-imagining of the series. Players will find familiar names like Glass Joe, King Hippo and trainer Doc Louis. These boxers come to life again in cell-shaded 3-D, complete with hilarious fighting animations and backstories that capture all the fun and flair of the original <i>Punch-Out!!</i> games. <p/> <b>The Wii\\'s Motion Sensitivity</b><br> The motion-sensitive controls of the Wii console mean that when players throw punches, Little Mac throws punches as well. Additionally, you can control hooks and jabs by combining motion control with control-stick movement. The motion-sensing Wii Remote and Nunchuk controllers turn real-life swings into on-screen punches, so anyone can play. The game can also be played with classic NES-style controls by turning the Wii Remote sideways. <p/> <b>Characters</b><br> <i>Punch-Out!!</i> features a total of 13 opponents for Little Mac to step into the ring with. 12 of which are returning from previous games in the <i>Punch-Out!!</i> series. Each have their own backstory and patterns of attacks to learn and learn to counter. Just a few of the characters you can expect to see are: <br/> <table border=\"0\" cellpadding=\"2\"> <tr> <td valign=\"middle\" align=\"left\" width=\"8%\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.fighter01.75.jpg\" width=\"75\" height=\"75\" alt=\"Little Mac from \\'Punch-Out!!\\'\"></td> <td width=\"92%\"><b>Little Mac</b><br/> Small but extremely game, Little Mac is a young, up-and-coming fighter, who with the help of his trainer, ex-champion Doc Lewis, has set his sights on working his way through the ranks.</td> </tr> <tr> <td valign=\"middle\" align=\"left\" width=\"8%\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.fighter02.75.jpg\" width=\"75\" height=\"75\" alt=\"Glass Joe from \\'Punch-Out!!\\'\"></td> <td width=\"92%\"><b>Glass Joe</b><br/> A fearful French fighter due to his extremely weak chin, Glass Joe will crumple to the mat quickly with just a few well-placed shots, making him an easy mark and a good warm-up for the fighters to follow.</td> </tr> <tr> <td valign=\"middle\" align=\"left\" width=\"8%\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.fighter03.75.jpg\" width=\"75\" height=\"75\" alt=\"King Hippo from \\'Punch-Out!!\\'\"></td> <td width=\"92%\"><b>King Hippo</b><br> King Hippo is both huge and an immensely powerful fighter, but can be weakened with the right combinations to the head and body, giving you time to go for the knockout if you can survive his onslaught.</td> </tr> <tr> <td valign=\"middle\" align=\"left\" width=\"8%\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001TOQ8K2.fighter04.75.jpg\" width=\"75\" height=\"75\" alt=\"Von Kaiser from \\'Punch-Out!!\\'\"></td> <td width=\"92%\"><b>Von Kaiser</b><br/> An old-timey fighter whose rumored childhood difficulties have left him eager to dish out punishment in the ring, Von Kaiser is a dangerous opponent, but one who will turn tail if you can find his weakness.</td> </tr> </table> <br/> <b>Special Attacks</b><br> Players can obtain special \\'Star Punches,\\' which allow Little Mac to take more health from his rival in a single punch. Players can now use multiple stars in a single punch for an extra-powerful attack. <p/> <b>Controller Options</b><br> <i>Punch-Out!!</i> features multiple controller options. For players looking to take advantage of the Wii\\'s motion control capabilities, <i>Punch-Out!!</i> uses the Wii Remote and Nunchuck controllers to simulate throwing punches. Use the Nunchuck to throw a left punch and the Wii Remote to throw a right punch. Fans of the NES version and core gamers will be excited to see Nintendo has also included the option to play <i>Punch-Out!!</i> using the classic layout from the original NES controller. Use the 1 and 2 buttons along with the cross pad to throw hooks and jabs or to dodge. </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1266019200000,
        "asin": "B001C4AI96",
        "title": "Tomb Raider: Underworld",
        "overall": 3,
        "reviewText": "I have played two Tomb Raider games so far:  Underworld and Anniversary.  This review comes after playing both games, and I thought Underworld was an amazing game after playing it first, but when I played Anniversary, Underworld's faults became readily apparent.\n\nFor one thing, there are quite a few glitches in this game.  Please be sure to save at every two checkpoints or so!!  I've had my Wii freeze on me completely after some of the cutscenes, which really made me frustrated to the point where I didn't want to play the game ever again.  However, I did continue on because the story is fascinating.  Both the storyline and the gorgeous graphics are the highest points in the game.  The architectural and visual detail put into this game are truly sights to behold.\n\nThose good points mentioned above are what gives this game 3 stars.  Besides the glitches, the controls are also fumbly, in particular, the camera angles.  Getting Lara to face the precise direction while performing jumps is quite agonizing, to say the least.  In summary, this game is great to rent, but I'd only suggest buying it if it's $5 in the bargain bin at Walmart.",
        "description": "['MODEL- 30013              VENDOR- NAMCO  FEATURES- Curious George Gcube       Curiosity is coming home!       Beloved to readers for more than 60 years Curious George is about         to embark on his biggest adventure ever as the star of a new         animated feature film and his long-awaited videogame debut.       The Man with the Yellow Hat sets out on a journey to Africa in hopes        of finding an artifact exotic enough to save the museum where he         works. George a curious little monkey with an insatiable taste for        adventure follows the Man with the Yellow Hat back to the big city        where his spunky and fun-loving nature endears him to new friends         he meets along the way and lands him in a series of mis-adventures.* Guide George through a variety of adventure-packed levels based on the   Universal Pictures and Imagine Entertainment animated feature film   Curious George.* Explore solve puzzles collect items and above all be curious! * Meet and greet your favorite movie characters unlock special mini-games   and more. Loads of bonus content will keep you playing long after the   main quest is solved.    -- SPECIFICATIONs ---------------------------------------ESRB Rating       : E for EveryoneGenre/Category    : Action/AdventureSystem            : GameCubeNumber of Players : 1On-Line Compatible: No', 'Tomb Raider: Underworld for Wii by Eidos resumes where Tomb Raider: Legend left off. This installment introduces a new, interactive playing environment that gives players a chance to immerse themselves more fully into the game. Players once again take the role of Lara Croft as she explores such wide-ranging places as the Arctic, Mexico, and beneath the Mediterranean Sea.', '<style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <table align=left width=250 cellpadding=15 cellspacing=15> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-4-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=618\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-4-sm.jpg\" border=0 align=top></a><br><br><span class=\"caption\">Lara\\'s environment is now much more realistic and interactive. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-4-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=618\\'); return false;\">View larger</a>. </span> </td> </tr> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-3-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-3-sm.jpg\" border=0 align=top></a><br><br><span class=\"caption\">And now she can hold onto a ledge with one hand and fire a gun with the other. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-3-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> </table> <b>Interactive Worlds Introduces Realistic gameplay</b><br> Unlike the previous games in the series, Lara\\'s environment is now much more realistic and interactive. Footprints will be left in mud, for example, but only until it rains and then they will wash away. Lara\\'s shirt will also get wet, and she\\'s more likely to lose her grip if she is standing on a slippery, rain-soaked ledge. When the sun comes out, her shirt will dry and the slippery surfaces regain their friction.', \"In Underworld, Lara also has a lot more flexibility in how she makes her way through a level, as there is often more than one way to get from here to there. She can now climb walls with texture and rocky outcroppings to reach areas she previously wouldn't have been able to access.\", \"All of these additions have been made to give the game a non-linear, open feel. Players can interactive with the environment by doing things they find to be intuitive, and the game will respond in an appropriate way. When Lara interacts with trees, for example, she will push aside leaves using either one or two hands depending on whether or not she's holding something. These details give a lifelike, immersive sensation to the game.\", '<b>New Melee Combat System</b><br> Underworld introduces a new melee combat system that requires players to strategically strike with offensive, defensive, and evasive maneuvers. Lara can now attack enemies with different punches, kicks, knees, and other acrobatic onslaughts. Items lying on the ground, such as poles that were previously walked on, can be picked up and swung at enemies. Players can also perform a greater variety of actions with weapons; for example, Lara can now hold onto a ledge with one hand and fire a gun with the other.', \"<b>Exclusive Wii Content and Controls</b><br> The Wii version of Underworld features specially designed levels and environmental challenges that incorporate the unique capabilities of the Wii remote and nunchuck. Whether you're using the multi-tool kit to excavate secret treasures, taking advantage of the active aim combat system, or controlling the in-game camera angles, the Wii remote and nunchuck deliver unprecedented as you battle your way through challenging levels.\", '<b>Realistic Enemy and Animal AI</b><br> The AI in Tomb Raider: Underworld has also taken a big step forward--both enemies and animals now make independent decisions based on their surroundings, employ ambush and squad tactics when fighting, and will retreat if deemed necessary.', '<br clear=\"all\"> <center> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-1-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-1-sm.jpg\" border=0></a> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-5-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-5-sm.jpg\" border=0></a> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-2-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B001C4AI96-2-sm.jpg\" border=0></a><br><br> <span class=\"caption\">Tomb Raider: Underworld is loaded with a new melee combat system, various weapons, and smarter AI for both enemies and animals. </class> </center> <br clear=\"all\">']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1266192000000,
        "asin": "B000UW21A0",
        "title": "Uncharted: Drake's Fortune - Playstation 3",
        "overall": 5,
        "reviewText": "This game definitely belongs in your PS3 library.  In fact, it should be a requirement that you buy this immediately with your PS3 system.  Uncharted:  Drake's Fortune is a SPECTACULAR game, full of puzzles, non-stop action, and gorgeously breathtaking cinematics.\n\nNow what I'm going to say next isn't necessarily a bad thing, and it doesn't affect my 5-star review of the game, but the premise of Uncharted really isn't new at all.  In fact, this game borrows heavily (and at certain points, STEALS) from the Tomb Raider series A LOT.  Just take a look at the way Nate jumps on ledges, wall runs on vines, etc.  That's a bad thing when it comes to creativity/originality, but hey, Tomb Raider was awesome, and it's great to see another well-produced game along those same lines.\n\nAs for the storyline of the game, elements of it were heavily borrowed from the movie \"Romancing the Stone\" with Michael Douglas and Kathleen Turner (Nate taking Douglas' role, and the female journalist taking Turner's).  The similarities are remarkable here!  So obviously, the developers of the game had both Tomb Raider and \"Romancing the Stone\" in mind when they developed Uncharted.  Uncharted 2 is also out right now, so maybe that's like \"Jewel of the Nile\"?  I have yet to get the sequel (which I will definitely do), and then I'll see where the inspiration for that one came from.\n\nAmazing, isn't it?  I love how I can get to the heart of what's behind games such as these.",
        "description": "['A 400-year-old clue in the coffin of Sir Francis Drake sets a modern-day fortune hunter on a exploration for the fabled treasure of El Dorado, leading to the discovery of a forgotten island in the middle of the Pacific Ocean. The search turns deadly when Nathan Drake becomes stranded on the island and hunted by mercenaries. Outnumbered and outgunned, Drake and his companions must fight to survive as they begin to unravel the terrible secrets hidden on the Island. Using maps and ancient artifacts, uncover clues and unravel mysteries to find a forgotten island and a treasure that was thought to have never existed. Explore exotic locations. Traverse through living jungles and spectacular 400-year-old ruins. Drakes companions and allies play an important role in the adventure through cooperative mechanics, gun play and exploration. Experience fast-paced gunplay: use a variety of environmental elements for cover, shoot enemies off of moving vehicles in high speed chases and more. Use an array of hand-to-hand fighting moves to put your enemy off balance. Anything from wild haymaker punches to running drop-kicks.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1268611200000,
        "asin": "B002NN7AKU",
        "title": "God of War: Collection - Playstation 3",
        "overall": 5,
        "reviewText": "God of War: Collection is definitely one of the finest compilation games to ever hit the PS3.  These two games together on a single Blu-Ray disc at such a reasonable price are fantastic.  Great storyline revolving around Greek mythology, tons of blood and gore, excellent cinematics, decent control scheme, and lots of merciless killing.  Definitely my type of game (and not for the faint of heart or little kids)!  Not playing continuously, both games took me between 10 and 15 hours total to complete, so they're very epic in scope.  The puzzle portions of the games seemed a bit lackluster and could be more challenging, but overall, everything else trumps that particular aspect.  As of this writing, God of War 3 has just been released, and I'm psyched to get it in the mail soon (review of that one is pending).\n\nOn a side note, Greek mythology is a fantastic genre to make video games with, but after the God of War trilogy, there should not be any more video games revolving around that.  GoW has officially set the standard and raised the bar to which no other video game can compete, and it's best to leave the Greek mythos alone after this series is complete.  Mythology itself, however, should continue to be explored and developed in the video game industry.  Perhaps we'll see Roman, Celtic, or Hindu mythology next???  Would be an awesome idea (hint hint to any video game developers reading this!!!).  In fact, I'd LOVE to see a video game featuring a heavily Christian/religious element with saints and such.  Would make a mind-blowing concept, don't you think?\n\nIn any event, definitely pick up GoW: Collection when you get the chance.  These two games are considered to be staples for Playstation owners, and that's the truth.",
        "description": "['God of War: Collection', '<table border=\"0\"> <tr> <td> <a name=\"product_description\"></a> A must-have for action/adventure fans on the PlayStation 3 platform, the <i>God of War Collection</i> features both PlayStation 2 single player classics, <i>God of War</i> and <i>God of War II</i>. Remastered in high definition and re-released for play on the PS3 this collection allows both longtime fans of the series and those coming to it new to indulge in the addictive action and puzzle-solving fun of taking on the gods ruling the world of ancient Greek mythology. <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table align=left width=210 cellpadding=0> <tr> <td> <div align=\"center\"><img alt=\"God of War Collection game logo\" title=\"God of War Collection game logo\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.logo.200.jpg\" border=0 align=top width=\"200\" height=\"66\"></div> </td> </tr> </table> <table align=right width=250 cellpadding=10> <tr> <td height=\"194\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.01.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=697,height=570\\'); return false;\"><img alt=\"Kratos wielding the Blades of Chaos\" title=\"Kratos wielding the Blades of Chaos\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.01.sm.jpg\" border=0 align=top width=\"250\" height=\"160\"></a><br> <center> <span class=\"caption\">Over-the-top God of War combat.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=697,height=570\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.02.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=697,height=570\\'); return false;\"><img alt=\"Kratos grappling towards an orb\" title=\"Kratos grappling towards an orb\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.02.sm.jpg\" border=0 align=top width=\"250\" height=\"170\"></a><br> <center> <span class=\"caption\">Addictive puzzle play Kratos style.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=697,height=570\\'); return false;\">View larger</a>.</span> </center></td> </tr> <tr> <td height=\"157\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=697,height=570\\'); return false;\"><img alt=\"Kratos eye-balling a Cyclops\" title=\"Kratos eye-balling a Cyclops\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.03.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Huge baddies and boss battles.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002NN7AKU.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=697,height=570\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> <b>The <i>God of War</i> Saga Now for the PS3</b><br/> The <i>God of War</i> series, made up of <i>God of War</i> and <i>God of War II</i>, featuring the brutal yet tortured anti-hero Kratos, engrossing storylines based in Greek mythology, over-the-top addictive action and puzzle-solving gameplay and simple controls is often referred to as one of the best, and/or most popular single player action games series ever made for PlayStation 2. The truth in this can be seen in the fact that in an era dominated by more advanced game consoles, fans of the franchise who have held on to their PS2\\'s still revisit these two games from time to time, while gamers who missed their initial releases are tempted to give them a try, even though they have moved on to a PS3. Regardless which side of this you find yourself on the <i>God of War Collection</i> holds something for you. Released in advance of the highly anticipated <i>God of War III</i>, the first game in the series developed for the PS3 platform and rumored to also be the last overall, this collection allows players to properly prepare themselves for the final chapter in the adventures of Kratos, entirely through their PS3. <p/> <font size=\"+1\">The Games</font> <p/> <b><i>God of War</i></b><br/> Unleash the power of the gods and embark on a merciless quest as Kratos, an ex-Spartan warrior driven to destroy Ares, the God of War. Armed with the lethal double chainblades known as the Blades of Chaos, Kratos must carve through mythology&rsquo;s darkest creatures &mdash; including Medusa, Cyclops, the Hydra and more, while solving intricate puzzles in breathtaking environments. Driven by pure revenge, nothing can stop Kratos from achieving absolution. Over time, Kratos becomes the most vicious warrior in Ancient Greece and bathed in blood to a point where he can\\'t bare it anymore and sets out on a journey to kill Ares. However, the only way to destroy Ares is to find Pandora\\'s Box, which is located in a temple that\\'s perched upon a hill and guarded by traps, puzzles, enemies, etc. The story is told as a flashback of three weeks prior to where the opening movie cutscene starts and then sets the stage for the game. <p/> <b><i>God of War II</i></b><br/> <i>God of War</i> saw Kratos, a mortal warrior, set upon an epic quest to dethrone a god. But his journey did not end there. In <i>God of War II</i>, Kratos, the once mortal warrior turned ruthless god, sits atop his throne on Olympus, and is a threat far worse than his predecessor Ares had ever been, striking down anyone who crosses his path, or the path of his beloved Sparta. Filled with power and rage, the \"Ghost of Sparta\" sets out to alter that which no mortal or god has ever changed &#151; his fate. Facing mythical characters, all bent on preventing him from reaching his goal, Kratos\\' journey brings him to the very edge of the Earth. But this is Kratos, and his defiance is filled with such arrogance and contempt that all of the ancient world still trembles at his name: Kratos, The God of War. <p/> <b>Key Game Features</b> <ul> <li><i>God of War</i> and <i>God of War II</i> on one Blu-ray Disc.</li> <li>Remastered in high-definition at a resolution of 720p.</li> <li>Anti-aliased graphics for 60 frames per second gameplay.</li> <li>Full PlayStation Network (PSN) Trophies support for each game.</li> <li>Purchase includes a PSN voucher for the <i>God of War III</i> E3 2009 Demo.</li> </ul> </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1269820800000,
        "asin": "B000P46NMA",
        "title": "Assassin's Creed - Playstation 3",
        "overall": 3,
        "reviewText": "Overall, I did enjoy Assassin's Creed for the PS3:  excellent storyline with great kill animations and very detailed cutscenes with plenty of audio.  The cutscenes may be too much for some people, but I happen to enjoy games featuring those things.\n\nI give AC 3 stars mostly due to the fact that there is no trophy support at all, the game is extremely repetitive which could get boring after a while (same types of missions and basic linearity), and the controls are a bit clunky (particularly with the camera angles when running/climbing walls...Altair would jump in a direction you didn't intend him to jump in).  Without the trophy support, there was really no reason at all for me to complete every single mission, view point, etc.  Just completing the minimum 3 investigations required to gain access to the assassination memories is good enough.  I'm hoping that Sony will release trophy support as a free DLC in the future, but I'm not betting on it since they haven't done so already after 3 years.\n\nI will definitely purchase AC 2 sometime in the future, since all reviews are saying that it beats the original game by a long shot.  I'd still highly suggest that you play this game through first just because it's the first title in a supposed trilogy.",
        "description": "['<p/> The setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You, Altair, intend to stop the hostilities by suppressing both sides of the conflict. You are an Assassin, a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos, and your existence will shape events during this pivotal moment in history. As an assassin you will master the skills, tactics, and weapons of history&#146;s deadliest and most secretive clan of warriors. Plan your attacks, strike without mercy, and fight your way to escape. <p/> <b>Features:</b><br> <p/> <ul> <li>Experience a living, breathing world in which all your actions have consequences. Crowds react to your moves and will either help or hinder you on your quests <li>Eliminate your targets wherever, whenever, and however. Stalk your prey through detailed and historically accurate environments. Scale buildings, mount horses, blend in with crowds <li>This game immerses you in the Holy Land of the 12th century, featuring life-like graphics, ambiance, and the detail of a living world <li>Find action blended with fluid and precise animations. Use a wide range of medieval weapons, and face your enemies in sword fight duels </ul>', '<i>Assassin?s Creed</i> is the next-gen game developed by Ubisoft Montreal that will redefine the action genre. While other games claim to be next-gen with impressive graphics and physics, <i>Assassin?s Creed</i> merges technology, game design, theme, and emotions into a world where you instigate chaos and become a vulnerable, yet powerful, agent of change.<p/> The setting is 1191 AD. The Third Crusade is tearing the Holy Land apart. You, Altair, intend to stop the hostilities by suppressing both sides of the conflict.<p/> You are an Assassin, a warrior shrouded in secrecy and feared for your ruthlessness. Your actions can throw your immediate environment into chaos, and your existence will shape events during this pivotal moment in history.<p/> Key Features <ul> <li><b>Be an Assassin</b>: Master the skills, tactics, and weapons of history?s deadliest and most secretive clan of warriors. Plan your attacks, strike without mercy, and fight your way to escape. <li><b>Realistic and responsive environments</b>: Crowds react to your moves and will either help or hinder you on your quests. <li><b>Action with a new dimension - total freedom</b>: Eliminate your targets wherever, whenever, and however. Stalk your prey through richly detailed, historically accurate, open-ended environments. Scale buildings, mount horses, blend in with crowds. Do whatever it takes to achieve your objectives. <li><b>Relive the epic times of the Crusades</b>: <i>Assassin?s Creed</i> immerses you in the realistic and historical Holy Land of the 12th century, featuring life-like graphics, ambience, and the subtle, yet detailed nuances of a living world. <li><b>Intense action rooted in reality</b>: Experience heavy action blended with fluid and precise animations. Use a wide range of medieval weapons, and face your enemies in realistic swordfight duels. <li><b>Next-gen gameplay</b>: The proprietary engine developed from the ground up for the next-gen console allows organic game design featuring open gameplay, intuitive control scheme, realistic interaction with environment, and a fluid, yet sharp, combat mechanic. </ul>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1270684800000,
        "asin": "B001NX6GBK",
        "title": "Dante's Inferno Divine Edition - Playstation 3",
        "overall": 5,
        "reviewText": "Let me just get this out of the way first:  Dante's Inferno is most definitely a rip-off of the God of War gameplay.  That is completely undebateable and unquestionable.  Now that's not necessarily a bad thing.  God of War did set a defining standard for many future games with regard to combat systems and control schemes.  And to be honest, it WORKS for Dante's Inferno, and Electronic Arts perfected it.  So if you have played God of War, Dante's Inferno should be very easy to pick up and play right out of the box (and if you never played GoW, please do so immediately!).\n\nJust the whole concept of Dante's Inferno is terrific . . . traveling through the 9 Circles of Hell to find your long-lost love is one heck of a storyline to drive the rest of the game.  The graphics are fantastic, the GoW style is beautiful (with the additions of equipping relics and upgrading tons of stuff via Holy/Unholy Paths), and everything is just laid out wonderfully.  The enemy characters are also very well-designed, from the various demons and unbaptized babies to Lucifer Himself.  The only gripe I have is that the boss battles should have been a little more involved and not just about button mashing.  Same could be said for the puzzle component, but those points are just very minor compared to the game overall.\n\nAlso, I instinctively knew that this game was going to be the first of three more to come (basing things off the Divine Comedy itself).  The \"To Be Continued...\" epigram at the end of the game hints to that, so we should expect Purgatorio and Paradiso to come out over the next few years.  If EA does that, we have a fine contender on our hands to compete with the God of War Trilogy!  In fact, Dante's Inferno is much better than both God of War and GoW 2.  This game is a must-buy.  Highly recommended!!!!",
        "description": "['Dante&#x2019;s Inferno Divine Edition Includes', '<table border=\"0\"> <tr> <td> <table border=\"0\"> <tr> <td> <a name=\"product_description\"></a> <i>Dante&rsquo;s Inferno</i> is an epic single player, third-person action adventure game inspired by \"Inferno\", part one of Dante Alighieri&rsquo;s classic Italian poem, \"The Divine Comedy.\" Featuring nonstop action rendered at 60 frames-per-second, signature and upgradable weapons, attack combos and mana-fueled spells and the choice of punishing or absolving the souls of defeated enemies, it is a classic Medieval tale of the eternal conflict with sin and the resulting horrors of hell, adapted for a new generation and a new medium. <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table align=left width=210> <tr> <td height=\"80\" valign=\"top\"><img alt=\"Dante\\'s Inferno game logo\" title=\"Dante\\'s Inferno game logo\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.logo.200.jpg\" border=0 align=top width=\"200\" height=\"87\"> </td> </tr> </table> <b>Story</b><br/> The Italian mercenary Dante returns home from the bloodletting that was the Third Crusade to two pieces of soul-crushing news. The first is that although he was assured that he was absolved of mortal sins committed in the form of wartime atrocities in the name of the churches interests in the Holy Land, that is not actually the case and his immortal soul is in grave peril. The second and more terrible is that his beloved Beatrice has been murdered, and her soul pulled down into hell by a dark force. Vowing not to accept the damnation of either souls, he gives chase, vows to get Beatrice back and descends into the infamous nine circles of hell. For weapons, he wields Death\\'s soul-reaping scythe, and commands holy powers of the cross, given to him by Beatrice. <p/> <table align=right width=330> <tr> <td height=\"194\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.01.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=522,height=570\\'); return false;\"><img alt=\"Concept art from Dante\\'s Inferno showing Dante with stiched on crucifix and the Scythe of Death slung over his shoulder\" title=\"Concept art from Dante\\'s Inferno showing Dante with stiched on crucifix and the Scythe of Death slung over his shoulder\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.01.sm.jpg\" border=0 align=top width=\"320\" height=\"350\"></a><br> <center> <span class=\"caption\">Go to hell with Dante\\'s Inferno.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=522,height=570\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> <b>Scythe Combat</b><br/> To vanquish the foes you encounter on your journey through the hell of <i>Dante\\'s Inferno</i>, you must learn to wield Death\\'s Scythe with precision and deadly force. Mix light attacks with heavy attacks to create combos, then incorporate jumps and grabs to add another layer to your combat. With dodging and Holy Cross moves thrown into the mix, you can truly become a force to be reckoned with. Without using all of your combative skills and techniques, there is no hope of ever reaching Beatrice. <p/> <b>Holy Powers</b><br/> During your journey, you may collect magic abilities for use against the legions of hell. When you perform the Righteous Path power you make a dash attack and leave a trail of icy shards in your wake. With Martyrdom you sacrifice health and mana to deal a heavy amount of damage to surrounding enemies. Divine Armor regenerates your health and protects you from damage. Add these and other powers to your arsenal to vanquish all who stand in your way and when you need to replenish your mana-fueled abilities, visit the Holy Fountains scattered throughout the gameplay area. <p/> <b>Creature Taming</b><br/> As powerful as weapons and magic are, sometimes surviving the perils of hell requires brute force. With the power of Death\\'s Scythe, you are able to mount the beasts of hell and use them against your enemies. All of this, however, requires ridding the beast of its current rider first. If successful, you will become the beast&rsquo;s new master. Now use its awesome power to pulverize enemies and complete tasks that require a beast\\'s strength. <p/> <b>Key Game Features</b> <ul> <li>Epic story adapted from the first book of the Medieval Italian classic The Divine Comedy, by Dante Alighieri.</li> <li>Nonstop action as you fight through Dante\\'s allegorical nine circles of hell.</li> <li>Wield the power of Death\\'s soul-reaping scythe.</li> <li>Beautiful fast-paced action and intense combat rendered at 60 frames-per-second.</li> <li>Choice-based finishes with enemies that allow players to punish the damned, or absolve them as they are defeated.</li> <li>Over 60 weapons, magic and combo upgrades and modifications.</li> <li>Huge destructive, ridable mounts that can be taken from defeated enemies.</li> </ul> </td> </tr> </table> <b>Additional Screenshots</b>:<br/> <table cellspacing=\"0\" align=\"center\" width=\"832\"> <tr> <td width=\"212\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=473\\'); return false;\"><img alt=\"Dante entering an area of note in Dante\\'s Inferno\" title=\"Dante entering an area of note in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.02.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Experience the 9 circles of hell.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=473\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td width=\"229\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.03.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=810,height=556\\'); return false;\"><img alt=\"Dante wielding the Scythe of Death in Dante\\'s Inferno\" title=\"Dante wielding the Scythe of Death in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.03.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Wield the Scythe of Death.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.03.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=810,height=556\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td width=\"295\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.04.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"Dante using Holy Powers against a horned baddie in Dante\\'s Inferno\" title=\"Dante using Holy Powers against a horned baddie in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.04.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">As well as Holy Powers.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.04.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td width=\"212\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.05.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"Dante taking on a huge female Boss in Dante\\'s Inferno\" title=\"Dante taking on a huge female Boss in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.05.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Engage in epic boss battles.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.05.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> </td> </tr> </table> </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1271462400000,
        "asin": "B000ZK9QCS",
        "title": "God of War III - Playstation 3",
        "overall": 3,
        "reviewText": "Part Three of the Trilogy is officially one of the worst games I have ever played.  It is clear that this game went straight to the developers' heads, much like their well-beloved main character, Kratos.\n\nSo where do I begin?  Well, let me just say that the game started off brilliantly.  The battle with Poseidon is by far my favorite boss battle in the entire God of War series.  The graphics are really top-notch, except I did detect a tiny slow-down in the frame rate during the first section of the game.  I guess they were just trying to push the PS3's limits a little too far.\n\nI really can't say much for the game play, since it's just more of the same from the previous two GoW titles.  I absolutely loved the increased amount of gore and bloody finishers for the bosses.  On a side note, I really don't like the voice acting on Kratos' character.  It sounds like a black guy is speaking the voice of somebody who isn't black.  Very strange and odd if you ask me.\n\nBut besides all that, what I severely find fault with is the storyline.  Plain and simple, Kratos is seeking revenge on all the gods.  That's it.  Kill Zeus is his goal, and that's what he does.  Nothing wrong with that, since it seems to fit the overall plot of the entire trilogy.  However, the game really went downhill as soon as Pandora entered into the equation.  What an ANNOYING brat!  Why didn't Kratos kill her as well?  He turned his back on the Titans, mutilated the gods...why not also kill a helpless \"child\"?\n\nWhere things really got annoying was with the final boss battle with Zeus, particularly when you have to face him and his clones inside Gaia.  I'm very happy to admit that I never finished this game out of extreme rage and frustration during that part of the battle.  After the twenty-fifth try (YES, twenty-fifth!), I just said \"to **** with this game!\" and let it go.  I deleted the saved games from my system and everything.  Never in my life have I found ANY boss battle so tedious (and this was on NORMAL difficulty!).  The developers clearly committed some grave error during the battle with Zeus.  Twenty-five times, and STILL you can't beat him?  Is this some sick joke to actually turn the player himself INTO Kratos???  Perhaps so, but regardless, I got sick of all the BUTTON-MASHING during that part of the battle, since that's all you could do.\n\nTo sum everything up, God of War III felt like a drug that puts you into severe withdrawal:  a consistent high for quite some time, and then a sudden depression sets in.  This game should definitely not get any Game of the Year awards whatsoever.  If it does, I'd be very surprised.\n\nUPDATE:  I have beaten this game since this review was originally published, and I'm giving it an extra two stars (so three total, instead of the original one star I gave it).  This game is still by no means a 5-star title.",
        "description": "[\"God of War? III finds Kratos raining carnage and destruction upon the Gods who have betrayed him and the entire Ancient Greek world. Armed with his deadly double-chained blades, Kratos will take on mythology's darkest creatures while solving intricate puzzles on his merciless quest to destroy Olympus and the mighty Zeus himself.<br /><br />Features include: <br /><br />&bull;True to the series roots, the four pillars of game play - brutal combat, intricate puzzles, exploration of awe-inspiring worlds, and a compelling story - all return.<br/>&bull;God of War III is the epic conclusion to the Greek mythological trilogy, which will complete Kratos' story that began in the original title for the PlayStation 2.<br />&bull;New deadly weapons like the Cestus, powerful metal gauntlets with devastating strength, and other brutal instruments of war that open up ruthless new techniques.<br />&bull;The menacing creatures of Greek mythology can now be manipulated against their will, to cross chasms, inflict blind rage against enemies, reveal puzzles and secrets, and as tools of complete annihilation.<br />&bull;God of War III picks up exactly where God of War II left off ? Kratos must take his quest for vengeance to the very stronghold of the Zeus.<br />\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1272672000000,
        "asin": "B001E8VB6O",
        "title": "Batman: Arkham Asylum - Playstation 3",
        "overall": 4,
        "reviewText": "When Joker says that line over the loudspeaker outside Arkham Asylum, I almost died laughing.  \"Hello kiddies!  It's your Uncle J!\"  You just have to love The Joker, and he's reason enough for you to buy this game.\n\nBatman: Arkham Asylum is a watershed moment for the Dark Knight himself.  It's truly a fantastic game with a superb storyline.  The graphics and cinematics are splendidly done.  The FreeFlow combat system is pretty ingenious, albeit a bit too easy to use.  Batman also has a vast plethora of gadgets available at your disposal to kick some serious thug *ss.\n\nWhat prevented me from giving Arkham Asylum a stellar 5-star review was the fact that not enough villains were included in the game.  I would've loved to see the Penguin, Catwoman, Mr. Freeze, and the Riddler in the flesh (or the pixels, in this case).  I also felt that there should have been more boss fights.  The Titan henchmen were sort of lame, and you just fight Bane, Poison Ivy, and Joker as the three main villains.  I don't count Zsasz and Harley Quinn, since their demise was pathetic.\n\nI also found the Challenge Maps to be quite repetitive and optional at best.  For those of you who are all into getting every single trophy in the game, you may want to take a look at the Challenge Maps, but they're not necessary.  Finding every Riddler Trophy and riddle in the game is also purely an option, but they add a little spice to the fiesta.\n\nIs the game a must-buy for your PS3?  YES, but I'd suggest only buying it if you're into Batman to begin with.",
        "description": "['In Batman: Arkham Asylum, the Dark Knight takes on his greatest challenge yet when he becomes trapped with all of his most dangerous villains inside the insane asylum of GOTHAM CITY - ARKHAM ASYLUM!  Batman: Arkham Asylum exposes players to a unique, dark and atmospheric adventure that takes them to the depths of Arkham Asylum &#8211;Gotham&#8217;s psychiatric hospital for the criminally insane.  Gamers will move in the shadows, instigate fear amongst their enemies and confront The Joker and Gotham City&#8217;s most notorious villains who have taken over the asylum.  Using a wide range of Batman&#8217;s gadgets and abilities, players will become the invisible predator and attempt to foil The Joker&#8217;s demented scheme.  Batman: Arkham Asylum features an original story penned exclusively for the game by famous Batman author and five-time Emmy award winner, Paul Dini, whose credits include Lost season one and Batman: The Animated Series.  With amazing graphics and a moody, immersive setting, Batman: Arkham Asylum offers diverse gameplay options that push the envelope for all action, adventure and superhero games.', '<table border=\"0\"> <tr> <td><a name=\"product_description\"></a><i>Batman: Arkham Asylum</i> is a single player, third-person action/adventure in which the Dark Knight is forced to take on his greatest challenge yet when he is trapped by arch rival, the Joker, within Gotham City\\'s facility for the criminally insane, Arkham Asylum. A blend of exciting arcade style combat and stealth mechanics packed with amazing graphics in a moody, immersive setting, <i>Batman: Arkham Asylum</i> offers diverse gameplay options that push the envelope for all action, adventure and superhero games. <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table width=\"200\" border=\"0\" cellpadding=\"5\" align=\"left\" cellspacing=\"0\"> <tr> <td valign=\"top\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.logo.200.jpg\" alt=\"\\'Batman: Arkham Asylum\\' game logo\" width=\"200\" height=\"86\"><br/> <small><center><b><i></i></b></center></small></td></tr></table> <table align=right width=250 cellpadding=10> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"Batman in hand to hand combat in \\'Batman: Arkham Asylum\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.01.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Kick it in combat gameplay.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=770,height=620\\'); return false;\"><img alt=\"Batman gliding in on an enemy in \\'Batman: Arkham Asylum\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.02.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">And stealth action.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=770,height=620\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"The Joker in \\'Batman: Arkham Asylum\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.03.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Match wits with The Joker.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"The batarang in flight in \\'Batman: Arkham Asylum\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.04.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Utilize utility belt gadgets.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/batman.aa.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> <b>Story</b><br/> <i>Batman: Arkham Asylum</i> features an original story penned exclusively for the game by famous Batman author and five-time Emmy award winner, Paul Dini, whose credits include \"Lost\" season one and \"Batman: The Animated Series.\" As the game begins Batman is personally delivering his nemesis, The Joker, to the asylum at Arkham Island, but he is uneasy. Although the Arkham asylum is well fortified, he has a nagging feeling that all is not well, which proves to be the case when seconds after turning The Joker over to the guards, the master criminal breaks free of his captors. Even more surprising than this quick turn of events is the revelation that it was never The Joker\\'s intent to escape the vault-like facility, but instead to trap Batman there. Surrounded by an asylum full of dangerous criminals, many of which he put there and all at the beck and call of the Joker, can Batman survive and discover what is behind the Joker\\'s intricate plot? <p/> <b>Gameplay</b><br> In <i>Batman: Arkham Asylum</i> players strap on the gadget-heavy utility belt of the Caped Crusader. Gameplay here is a combination of both the knuckle crunching rush of hand to hand combat as you take on the hordes of thugs that infest Arkham Asylum, and stealth gameplay in which you must dispatch individuals from the shadows. Players can expect an engrossing single player campaign in which Batman continually moves forward to face the henchmen, bosses and traps that The Joker has set for him. With regards to opponents, in addition to The Joker who you will hear more than you see, the dark walls of Arkham also hold familiar villains from the the Batman criminal universe including Harley Quinn, Victor Zsasz and Killer Croc, that you will have to deal with, but don\\'t expect a one-dimensional experience. As players progress from environment to environment within Arkham they will have to use varying combinations of muscle, detective skills, gadgetry and a certain degree of light RPG-like leveling of Batman\\'s skills, arsenal and physical characteristics to survive and discover what The Joker\\'s underlying scheme is. <p/> In addition to the story-driven single player campaign <i>Arkham Asylum</i> also contains various additional play modes. These include an arcade styled combat mode where players accumulate points by engaging hordes of thugs in a hand to hand slugfest across a series of maps, in which Batman\\'s physical strength and agility play a major role. The key here is to chain together as many attacks as possible due to the fact that with each successful combo players increase the point multiplier associated with their actions. The game also features a time-based stealth mode where players must hone their ability to strike silently from the shadows. This gameplay, referred to as \\'Invisible Predator\\' utilizes the Dark Knight\\'s skill with gadgets like the grapple tool, batarang and explosives. These allow for vertical/horizontal mobility, the ability to quickly strike from above and at a distance and to take out enemies and create distractions, even through walls. But remember that Batman works solo and is not superhuman. Your enemies will congregate around trouble areas and work as a team against you, so you must be silent, plan your attacks wisely, strike quickly and discover the value of encouraging fear within enemies. <p/> <b>Key Features</b> <ul> <li>Utilize the unique FreeFlow combat system to chain together unlimited combos seamlessly and battle with huge groups of The Joker\\'s henchmen in brutal melee brawls.</li> <li>Investigate as Batman, the world\\'s greatest detective, by solving intricate puzzles with the help of cutting edge forensic tools including x-ray scanning, fingerprint scans, \\'Amido Black\\' spray and a pheromone tracker.</li> <li>Face off against Gotham\\'s greatest villains including The Joker, Harley Quinn, Victor Zsasz and Killer Croc.</li> <li>Become the Invisible Predator with Batman\\'s fear takedowns and unique vantage point system to move without being seen and hunt enemies.</li> <li>Choose multiple takedown methods, including swooping from the sky and smashing through walls, and use the predator camera get a closer look at the action.</li> <li>Explore every inch of Arkham Asylum and roam freely on the infamous island, presented for the first time ever in its gritty and realistic entirety.</li> <li>Experience what it\\'s like to be Batman using batarangs, explosive gel aerosol, the Batclaw, sonar resonator and the line launcher.</li> <li>Unlock more secrets by completing hidden challenges in the world and develop and customize equipment by earning experience points.</li> <li>Enjoy complete superhero freedom in the environment with the use of Batman\\'s grapple to get to any place you can see, jump from any height and glide in any direction.</li> <li>PlayStation 3 exclusive Joker Challenge Map DLC.</li> </ul> </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1278460800000,
        "asin": "B000X1TC0U",
        "title": "Dead Space (PlayStation 3)",
        "overall": 4,
        "reviewText": "Dead Space has plenty of shocks and thrills, especially for a horror-sci fi title.  I wouldn't call it a \"survival horror\" per se.  It's nothing like the Resident Evil series, but it does deliver plenty of chills.  I had to deduct a star because I would have loved to see some cinematic cutscenes interspersed with the storyline, which really doesn't develop until much later in the game.  It's not until the 8th or 9th Chapter when you're fully hit with what's going on (i.e. the Unitologists).  Also, the semi-3rd person view was a little clunky at times.  Maybe this would have been better in strictly first-person?  I don't know, but that's just my two cents on the issue.  Overall, it's a must-own title, so be sure to pick it up, especially at this great price.",
        "description": "['Dead Space PS3', 'Dead Space from EA is sure to please any action-adventure gamer looking for a bloody battle against deadly aliens. Dead Space for PlayStation 3 begins when a massive mining ship, the USG Ishimura, comes in contact with a mysterious alien artifact and suddenly loses its communications with Earth. Engineer Isaac Clarke is sent to repair <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <table align=left width=250 cellpadding=15 cellspacing=15> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-1-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-1-sm.jpg\" border=0 align=top></a><br><br><span class=\"caption\">Deep Space pits Isaac Clarke against deadly aliens. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-1-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-2-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-2-sm.jpg\" border=0 align=top></a><br><br><span class=\"caption\">Zero-G game play allows you to walk on walls and the ceiling. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-2-lg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> </table> <table align=right width=250 cellpadding=15 cellspacing=15> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-3-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-3-sm.jpg\" border=0 align=top></a><br><br><span class=\"caption\">EA delivers an incredibly frightening experience with state-of-the-art graphics and effects. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-3-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </td> </tr> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-5-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-5-sm.jpg\" border=0 align=top></a><br><br><span class=\"caption\">Neutralize the attacking enemies with weapons and telekinetic powers. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000X1TC0U-5-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </td> </tr> </table> the Ishimura\\'s communications, but arrives to find a floating vessel that has become a complete bloodbath. The crew is mutilated and infected with an ancient alien scourge. Clarke\\'s repair mission is transformed to one of survival as he fights to save himself and return the artifact to the planet at any cost.', \"<b>Fight with Weapons and Telekinesis</b><br> The alien hordes are incredibly resilient. You'll have to find creative ways to neutralize the attacking enemies by shearing off limbs with powerful weapons. And when the ammo runs out you'll be thankful that you can use your telekinetic powers to pick up objects (even the aliens' own severed arms and legs) and hurl them at your advancing enemies.\", \"<b>Graphics, Effects, and Sound Increase the Horror</b><br> EA delivers an incredibly frightening experience with state-of-the-art graphics and effects, an audio system that will have you jumping out of your seat, and a truly horrific atmosphere that is permeated with death, mutilation, and despair. You'll have to be resilient to slash through the alien onslaught and stop this virulent scourge. As you explore the ship, the tragic story of the USG Ishimura will unfold in gory detail as you discover frantic logs from the hideously transformed crew in their final days.\", \"<b>True Zero-G Effects</b><br> You'll be able to take full advantage of zero gravity in Deep Space. Battling enemies and solving puzzles takes on new challenges and present ingenious opportunities with the Zero-G game play. You can use zero gravity to create your own path around obstacles by walking on walls and the ceiling. Leap across vast distances or change your perspective to gain a strategic advantage over your enemies.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1289952000000,
        "asin": "B002I0J6DC",
        "title": " Castlevania",
        "overall": 4,
        "reviewText": "Alright, the very first thing I'm going to say is this:  those of you who came into this game with a jaded mindset, thinking that it was going to be like all the other Castlevania titles, should really be ashamed of yourselves for giving this game low marks.  Your bad reviews for this game should never be taken into consideration because you let your biased opinions get in the way of your judgment.  Lords of Shadow is NOT like any other Castlevania game, and it must be judged on its own.\n\nSecondly, those of you who give this game sub-par reviews for its lack of originality and \"derivative gameplay\" should also be chastised severely.  Yes, it borrows from previous titles (God of War, Shadow of the Colossus, etc.), but SO WHAT?  It WORKS.  It's a great game with an awesome storyline...enough said.  The graphics are beautiful, the cutscenes are gorgeous, and you really get the most bang for your buck.  LoS clocks in at between 15 and 20 hours worth of gameplay, and it's enough to actually keep you interested.  Until the day comes when a \"new\" style of gameplay is introduced, we just have to deal with this type of action-combat-hack n slash format.  So just deal with it, learn to love it, and shut up!\n\nOne last comment that I'd like to make about Lords of Shadow refers to the voice acting.  All of the major actors play great roles and read their lines well...BUT, I'm a little annoyed at Patrick Stewart's performance.  His presence in this game was actually the number one reason that caused me to purchase LoS...me being a huge Star Trek: The Next Generation fan and all.  But I must say that Patrick should have read his lines with a little more emotional \"oomph\" during the opening scroll scenes for the chapters. During those introductory scenes, it just feels as if he falls flat when saying certain lines, with a couple of long and drawn out sections.\n\nAlso, my favorite word that I LOVE hearing him say is \"artifacts.\"  Not ONCE did he mention this word in the game!  In the scroll scenes, the word \"relic(s)\" pops up like 10 or 15 times.  WHY couldn't they have replaced that word with \"artifact(s)\"?  I was so annoyed by that that I had to write to Patrick Stewart myself and also send a comment about it to Hideo Kojima Productions.  The only time I felt that Patrick really hit his stride was during the very last chapter of the game.  Only then did I hear any REAL performance from him.\n\nSo there you have it.  Should you buy it or rent it?  Buy it!  The game has plenty of replay value since you have to complete all the trials if you want to collect some silver trophies.  You will also have to replay some of the levels if you want to find any weapons upgrades.  All in all, the game is great.",
        "description": "['Castlevania &#x2013; Lords of Shadow is a dark and vivid new re-imagining of the Castlevania mythology. It is the end of days and ungodly powers isolate the Earth. The worlds&#x2019; alliance with the heavens has been threatened by a dark and malevolent force &#x2013; the mysterious Lords of Shadow. Across this shattered land, the souls of the dead wander unable to find peace, whilst creatures of evil wreak chaos and death upon the living. Gabriel Belmont is a member of the Brotherhood of Light, an elite group of holy knights who protect and defend the innocent against the supernatural. His beloved wife was brutally murdered by the evil forces of darkness and her soul trapped for eternity. Neither living nor dead she realizes the horrific truth of what is at stake and guides Gabriel to his destiny &#x2013; and hopefully salvation for the world.', '<div class=\"aplus\">', '<i>Castlevania: Lords of Shadow</i> is a single player Action-Adventure game developed as a reimagining of the classic <i>Castlevania</i> mythology. An entirely modern action console game, <i>Lords of Shadow</i> combines fast-paced weapons and magic based combat against otherworldly enemies, with platforming and puzzle-solving gameplay, to create a fresh gameplay experience that will thrill both fans of the original game series and gamers more rooted in modern action games.', \"It is the end of days and ungodly powers isolate the Earth. The worlds' alliance with the heavens has been threatened by a dark and malevolent force - the mysterious Lords of Shadow. Across this shattered land, the souls of the dead wander unable to find peace, whilst creatures of evil wreak chaos and death upon the living.\", 'Gabriel Belmont is a member of the Brotherhood of Light, an elite group of holy knights who protect and defend the innocent against the supernatural. His beloved wife was brutally murdered by the evil forces of darkness and her soul trapped for eternity. Neither living nor dead she realizes the horrific truth of what is at stake and guides Gabriel to his destiny &ndash; and hopefully salvation for the world.', 'Although based on the classic arcade side-scrolling platformer and the string of games that have followed over the years, <i>Castlevania: Lords of Shadow</i> is a modern single player Action-Adventure game played from the third-person perspective. Based around the tragic past and seemingly inescapable destiny of the Gabriel Belmont character, the player engages in a mix of combat, platforming and puzzle-solving skills. To deal with the hell-spawned beasties and bosses encountered, Gabriel uses a mix of upgradable weaponry and magical powers. Weapons range from a cross that can be extended into a whip with grapple capabilities, to a gauntlet, knives and more. As players wield these they will gain access to energy orbs that reveal themselves as enemies are dispatched. This energy is stored in on-screen gauges and powers multiple kinds of usable magic within the game. Some of its uses involved improve attacks, while the other aids reflect regenerative health. It is the players choice to juggle where these energies are applied. The availability of energy can also be increased by avoiding the attacks of enemies as you battle them, with the payoff coming when they are bested.', 'In addition to run of the mill bad guys, the game contains loads of huge bosses, success against which requires patience, attention to screen prompts and timing. The player will also come up against many other creatures that although vulnerable to weapons can also be defeated and tamed by Gabriel. In many cases these can then be used as mounts and used either in boss battles or in puzzle-solving scenarios that may not be able to be solved without them. These potential mounts include wargs, spiders, warthogs and more. Taken together, all of these elements make for an entirely new take on the <i>Castlevania</i> gaming experience that is destined to satisfy new and current fans alike.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1293667200000,
        "asin": "B00269DX5W",
        "title": "Assassin's Creed II - Greatest Hits edition - Playstation 3",
        "overall": 4,
        "reviewText": "Assassin's Creed 2 (AC 2) is such a tremendous improvement over its predecessor in many areas:  graphics, layout of the levels (gorgeous graphics and painstaking attention to detail), the addition of more weapons and gadgets, and some fun side quests.\n\nHowever, they still didn't get something right:  the jumping and wall climbing!!!  Why is it that when you want Ezio to jump in an intended direction, he jumps in a totally different direction?  Performing quick button presses when you have to jump or wall climb can get very annoying.  Also, there are quite a few glitches in the game.  When you viciously slaughter enemies, their body parts may get stuck in the floor.  I also encountered a glitch where I performed a jump off a building, landed in between a tree and the side of the wall, and got stuck in the wall.  I had to reset my PS3 after that happened.\n\nAnother thing:  it is very well-known that Leonard da Vinci was a homosexual.  In Dan Brown's book, \"The Da Vinci Code,\" he mentions that da Vinci was a flamboyant homosexual.  Other sources also seem to confirm Leonardo's flamboyance.  If he was so flamboyantly gay, why is he portrayed in such a masculine fashion in AC 2?  If the designers of this game REALLY wanted to be historically accurate, they should have altered Leonardo's behavior to more accurately reflect his natural \"flair\" for the aesthetic arts.  And who knows...a plot twist of Ezio and Leonardo getting it on maybe would have made the game a LOT more interesting!!  But I digress...\n\nOverall, 4 stars due to the glitching, jumping/wall-climbing nuisances, and historical inaccuracy.",
        "description": "[\"PS3 edition of Ubisoft's Assassin's Creed II.\", '<table><table>The world of the assassin is one cloaked in shadow and steeped in danger. Ensnared in a web of revenge and conspiracy, the assassin embraces power at its most elemental, acting as the dividing line between life and death. As an assassin confronted by perilous new challenges and difficult choices, what path will you choose?<br /><br /><table align=right width=200 cellpadding=10> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img01.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=585\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img01_sml.jpg\" alt=\"Stunning Graphics\" width=\"200\" height=\"113\" border=0 align=top ></a><br> <small><center> <b><i>Stunning Graphics<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img01.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=585\\'); return false;\">View larger</a>.</i></b> </center></small> </td> </tr> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img02.jpg\" onclick=\"window.open(this.href,null,\\'width=766,height=570\\'); return false;\"><img alt=\"Roam Freely\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img02_sml.jpg\" border=0 align=top width=\"200\" height=\"113\"></a><br> <small><center> <b><i>Roam Freely<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img02.jpg\" onclick=\"window.open(this.href,null,\\'width=766,height=570\\'); return false;\">View larger</a>.</i></b> </center></small> </td> </tr> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img03.jpg\" onclick=\"window.open(this.href,null,\\'width=766,height=570\\'); return false;\"><img alt=\"All New Weapons\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img03_sml.jpg\" border=0 align=top width=\"200\" height=\"113\"></a><br> <small><center> <b><i>All New Weapons<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_img03.jpg\" onclick=\"window.open(this.href,null,\\'width=766,height=570\\'); return false;\">View larger</a>.</i></b> </center></small> </td> </tr> </table> <table><tr><td valign=\"top\" style=\"text-align:center;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_BG.jpg\" align=\"center\" alt=\"Assasin\\'s Creed 2\" width=\"250\" /></td><td valign=\"top\"><div style=\"text-align:center;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B00269DXCK_logo.jpg\" width=\"450\" height=\"217\" alt=\"Assasin\\'s Creed 2\"/></div><p style=\"margin-top:-20px;\"><b>Synopsis</b><br/> Get ready to plunge into the lush and deadly world of the Italian Renaissance, an era of arts, riches and murderous conspiracy. Assassin\\'s Creed II introduces you to Ezio, a new assassin carrying on the deadly lineage of his forebears. Confront an epic tale of power and corruption as you hone your assassin\\'s art, wielding weapons and instruments designed by the legendary Leonardo da Vinci himself in this gripping and deadly sequel.', '<b>Key Game Features</b>:']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1294790400000,
        "asin": "B0045ZIEPY",
        "title": "Dragon Age Origins: Ultimate Edition - Playstation 3",
        "overall": 4,
        "reviewText": "The game was pretty solid overall, and I enjoyed the storyline tremendously.  The final battle was a killer, though.  It took me 6 tries before I finally beat it.  Hint:  use the Mages right away, then once the Darkspawn arrive, go to the ballisters and start shooting.  Do that for about 3 minutes, then go up to the Archdemon and slash away at it while using health poultices.\n\nThe only \"bad\" thing I can say about the game is the combat system, which really isn't that bad at all.  It just gets a little too repetitive at times.  Other than that minor issue, this is a pretty decent game.  I put in 45 hours just on the main storyline, and I haven't touched any of the DLC yet (working on that now).\n\nWhat I also found decent was the voice work.  You have Kate Mulgrew and Tim Russ (both from Star Trek:  Voyager), Claudia Black (from Stargate SG-1), Dwight Schultz (from Star Trek: The Next Generation, \"Lt. Reginald Barclay\"), and Tim Curry (!).  Very eclectic mix of actors, if I don't say so myself.  The end credits were also interesting.  Right after the fantasy-themed music, 30 Seconds to Mars came on with \"This Is War\" (written by Jared Leto, who's now dead).  Such a weird choice of music and voice actors, but it works surprisingly well.\n\nFour stars.",
        "description": "[\"Get the ultimate Dragon Age experience! Dragon Age: Origins - Ultimate Edition is a limited-time offer including the 2009 RPG of the Year' Dragon Age Origins, the Dragon Age Origins-Awakening expansion pack, plus all nine additional content packs.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1305676800000,
        "asin": "B000HKP88C",
        "title": "Grand Theft Auto IV - PlayStation 3",
        "overall": 1,
        "reviewText": "I can't believe how many hours of my life I literally wasted playing this game.  60% of the game is based on completing the main storyline missions, and I got up to 51%.  The mission \"Paper Trail\" is THE most ridiculous mission ever in GTA history.  In that mission, you are supposed to take a helicopter and shoot down a target helicopter miles away with Little Jacob in the passenger seat.\n\nI can't tell you how many times I tried doing this mission, to the point where I'm about to write an official letter to Rockstar Games.  GTA MUST have a difficulty setting adjustment!!!!  No excuses.  How can you make a game with ridiculously frustrating missions towards the end of the main storyline without any difficulty adjustment whatsoever?  This is mindless and idiotic, to say the very least.\n\nI've had a lot of difficulty with some previous missions, and luckily, I got through those, but \"Paper Trail\" really puts the icing on the cake.  The other 40% of the game consists of side missions, which are worthless, in my opinion.  That's an even bigger waste of time!  And if you're one of those trophy-hunting nuts who needs to have every trophy in this game, then you've got no life at all.  Save your efforts on another game, not this one.\n\nAs a result of all this, I'm happy to say that GTA 4 is now collecting dust on my shelf.  Early on in the game, I was heavily thinking about purchasing Episodes from Liberty City, but that's definitely not happening.  It gives me great pleasure that Rockstar Games will not be making $20 to $30 off me!\n\nI'm very glad that I got this game for free through Amazon promotional credits I've saved up, because I tell ya....I would not have spent any sort of currency on this title!!!  I haven't played Red Dead Redemption yet (which is on my shelf in the shrink wrap), but if it gives me the same amount of frustration, I will NEVER purchase a game featuring the \"golden R\" ever again.",
        "description": "['', \"What does the American dream mean today? For Niko Bellic fresh off the boat from Europe, it is the hope he can escape from his past. For his cousin, Roman, it is the vision that together they can find fortune in Liberty City, gateway to the land of opportunity. As they slip into debt and get dragged into a criminal underworld by a series of shysters, thieves and sociopaths, they discover that the reality is very different from the dream in a city that worships money and status, and is heaven for those who have them and a living nightmare for those who don't.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1314403200000,
        "asin": "B000PE0HBI",
        "title": "The Orange Box - Playstation 3",
        "overall": 4,
        "reviewText": "\"The Orange Box\" for the PS3 is definitely worth every penny spent.  For 5 games all wrapped up onto a single Blu-Ray disc, this collection will keep you busy for hours on end.  Half Life 2, Episode 1, and Episode 2 are amazing.  If you're a fan of first-person shooters, the Half-Life saga is one of the best.\n\nFrom a gameplay/story perspective, I personally thought it would have been even better to include cinematic cutscenes rather than real-time dialogue and action, but I found it to be an OK style regardless.  I deducted one star from my review because the audio crackles randomly during certain points of all three Half-Life installments.  The fact there is no trophy support for this collection also is worthy of a full star deduction in itself (and there are no plans for trophy support from PSN in the near and distant future....a real pity, if you ask me).\n\nAs for Team Fortress, I never bothered to play it because I'm not a multiplayer type of guy at all.  Portal is great, I know, but I only played up to the 12th room.  I got bored of it really quickly, and physics-based puzzle games just aren't my thing.  If you like that kind of stuff, great, but it just doesn't wet my whistle.\n\nOverall, 4 STARS",
        "description": "['The Orange Box delivers five innovative games from Valve, creators of the Half-Life franchise, in one box. The Orange Box includes <i>Half-Life 2: Episode Two, PortalTM,</i> and <i>Team Fortress 2</i> in addition to full versions of the award-winning <i>Half-Life 2</i> and <i>Half-Life 2: Episode One</i> for an engrossing first-person action experience. <p/> Features: <ul> <li><b>Five Games, One Box:</b> The Orange Box is the ultimate collection of innovative action games for the console, and an amazing introduction to the Half-Life series for console gamers. <li> <b>Epic Storyline:</b> <i>Half-Life 2: Episode Two</i> takes you deeper into one of the best-known stories in gaming, following the desperate struggle of Gordon Freeman against the mysterious Combine. In this episode, you must leave the confines of City 17 for the first time and face even greater dangers beyond the city walls. <li> <b>Redefining Action:</b> <i>Portal</i> delivers an innovative new action gaming experience. Arming you with a portal gun that lets you create portals from one location to another with the press of a button, Portal will forever change the way that you interact with your environment. <li> <b>World-Class Multiplayer:</b> <i>Team Fortress 2</i> is the sequel to granddaddy of role-based multiplayer action games. Featuring nine distinct roles Heavy, Spy, Scout, Demoman, Engineer, Medic, Sniper, Soldier, and Pyro Team Fortress 2 is one of this year&#146;s most anticipated multiplayer games for any platform. </ul>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1315785600000,
        "asin": "B001D7T2VC",
        "title": " Darksiders",
        "overall": 5,
        "reviewText": "What a game!  The other reviewers were right that Darksiders is a blend of God of War and Legend of Zelda.  Great combination!  I just finished this game in time for the release of the God of War Origins Collection, and I must say . . . what a prelude!  Anybody who's a fan of GoW or Zelda MUST get this game, and at the super low price of (currently) $18, do yourself a favor and immediately get it!\n\nCan't wait for Darksiders 2!",
        "description": "['Cinematic Gameplay Experience - Harnessing the power of next-generation console systems, Darksiders: Wrath of War will immerse players in a rich cinematic gameplay experience - featuring beautiful graphics, detailed special effects, cinematic lighting and an epic musical score that compliments the in-game action.', '<table border=\"0\"> <tr> <td><a name=\"product_description\"></a> <i>Darksiders</i> is a third-person, single player action/adventure game inspired by the characters, themes and mythology of the apocalypse and the battle of Armageddon described by the Book of Revelation. But this modern interpretation is not your run of the mill Sunday school stroll through the New Testament. In the game players take on the role of \"War,\" one of the dread Four Horsemen of the Apocalypse. But things are not as they were. <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table width=\"210\" border=\"0\" cellpadding=\"0\" align=\"left\" cellspacing=\"0\"> <tr> <td valign=\"top\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.logo.200.jpg\" title=\"\\'Darksiders\\' game logo\" alt=\"\\'Darksiders\\' game logo\" width=\"200\" height=\"44\"><br/> <small><center><b><i></i></b></center></small></td></tr></table> <table align=right width=250 cellpadding=10> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=492\\'); return false;\"><img alt=\"War swinging his primary weapon in \\'Darksiders\\'\" title=\"War swinging his primary weapon in \\'Darksiders\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.01.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Devastating weapons arsenal.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=492\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=520\\'); return false;\"><img title=\"War using an magical ability on an enemy in \\'Darksiders\\'\" alt=\"War using an magical ability on an enemy in \\'Darksiders\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.04.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Upgradable abilities.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=520\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img title=\"Demon enemy from \\'Darksiders\\'\" alt=\"Demon enemy from \\'Darksiders\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.02.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Enemies from heaven &amp; hell.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> <tr> <td valign=\"top\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=520\\'); return false;\"><img title=\"War fighting atop his trusted mount Ruin in \\'Darksiders\\'\" alt=\"War fighting atop his trusted mount Ruin in \\'Darksiders\\'\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.03.sm.jpg\" border=0 align=top width=\"250\" height=\"141\"></a><br> <center> <span class=\"caption\">Fight &amp; explore atop your mount.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/darksiders.03.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=520\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> Once the unstoppable and just wielder of divine retribution, War is now reduced in stature and cast out amongst the ruined lands of the Earth that he himself devastated. All that remains is the search for the truth behind his betrayal and the survival of its consequences. <p/> <b>The Story</b><br/> Deceived by the forces of evil into prematurely bringing about the end of the world, War - the first Horseman of the Apocalypse - stands accused of breaking the sacred law by inciting a war between heaven and hell. Dishonored and stripped of his powers, War must return to Earth to search for the truth and punish those responsible. But there is no clear definition of good and evil in this tale. Hunted by a vengeful group of angels, War must take on the forces of Hell, forge uneasy alliances with the very demons he hunts, and journey across the ravaged remains of the Earth on his quest for vindication. But the answers he seeks will reveal a deep conspiracy in which War will find, and have to resign himself to the reality that although once the hand of God, he is just a pawn in the eternal battle between heaven and hell. <p/> <b>Gameplay</b><br/> A mix of exploration and fast-paced action gameplay, <i>Darksiders</i> is based on nonlinear play situations. That means that as War slowly regains his previous powers of destruction and carnage in order to continue his search for the origins and reasons for his betrayal, players will be able to backtrack to areas and scenarios that they may have left unexplored upon first discovery. Almost all areas of the game can be explored and some of the things players will find as they do so are treasure chests, health chests, and bonus life points, etc. The ability to go back and explore areas is important, especially as the game progresses and War finds himself up against enemies whose defeat require special skills and/or weaponry. <p/> As for combat gameplay, <i>Darksiders</i> features a variety of weapons--including blades and firearms--that can be used in combo moves or in single strikes. Some of these can be charged up for quick, but devastating attacks on enemies and all can be arranged on your controller\\'s D-pad for easy and preferred access. Additional gameplay elements include the ability/necessity to fight from the back of your mount, Ruin, and the collection of the souls in the form of glowing orbs that fall to the ground as enemies are dispatched. The latter can be used to level up War with new items and abilities. <p/> <b>Varied Characters and Environments</b><br/> Although players take on the imposing role or War, <i>Darksiders</i> also contains a wide variety of equally intriguing and sometimes frightening characters. These include: an assortment of vengeful angels; demons, such as \"the Jailer\" whose body is made up of the remains of countless cadavers; a bestiary of wicked and vile creatures created to bolster the armies of hell on Earth; and Ruin, the trusty steed of War. Gameplay environments players will experience are equally varied, and include areas both underground and on the surface, that call to mind both familiar, if ruined modern urban environments, as well as ones seemingly pulled from the nightmarish scenes of the biblical apocalypse. <p/> <b>Key Features</b><br/> <ul> <li><b>Apocalyptic Power of War</b> - Unleash the wrath of War, combining brutal attacks and supernatural abilities to decimate all who stand in your way.</li> <li><b>Extreme Arsenal</b> - Wield a devastating arsenal of angelic, demonic, and Earthly weapons, and blaze a trail of destruction atop Ruin, War\\'s fiery phantom steed.</li> <li><b>Epic Quest</b> - Battle across the wastelands and demon-infested dungeons of the decimated Earth in your quest for vengeance and redemption.</li> <li><b>Character Progression</b> - Uncover powerful ancient relics, upgrade your weapons, unlock new abilities, and customize your gameplay style.</li> <li><b>Battle Heaven and Hell</b> - Battle against all who stand in your way&mdash;from war-weary angelic forces to hell\\'s hideous demon hordes.</li> <li><b>Weapons and Gear</b> - <i>Darksiders</i> features an extensive arsenal and inventory of weapons and gear.</li> <li><b>Varied Play Environments</b> - Players will fight through varied environments, including those above and underground, and modern and nightmarishly mythical in design.</li> <li><b>PlayStation Network</b> - Although a single player game, <i>Darksiders</i> features PlayStation Network Trophy support and other features to heighten the gameplay experience.</li> </ul> </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1318636800000,
        "asin": "B002AB7TX8",
        "title": "Demon's Souls",
        "overall": 4,
        "reviewText": "Ok, so this review is a little incomplete since I didn't finish the game yet, but whatever.  It's a great dungeon-crawling, boss-slaying RPG with decently good graphics.  Yes, it's hard...yes, it's difficult.  My main build is the Royalty class Assassin build.  I just use magic all of the time, and it's a breeze.\n\nSo far, I beat levels 1-1, 1-2, 2-1, 3-1, 4-1, and 5-1.  When I got to 2-2 (Flamelurker level), I stopped playing.  I came very close to beating him, then I died and got sent back to the beginning of the level (which is what usually happens when you die anywhere in the level anyway).  No big deal, so I started over.  The thing is that I just got bored of that level, and for some reason, I kept dying trying to get through it again.  No clue why because I breezed through it the first time around.  The level has plenty of platform jumping and falling if you choose to go that route.  I tried that a few times, and I kept on dying.  A major disappointment with the game is that you can't control your direction of falling.  Once you fall, you just go down.  To me, that's a major weakness in this game.\n\nOther than that, it's pretty solid.  And here's a tip:  if you know you're going to die or immediately when your health is completely depleted, just press the PS button and quit the game.  When you load your file up again, you'll respawn at the point before you died.  Doing that has been a lifesaver for me, and if I never knew that, I probably would've gotten very frustrated with the game and quit it a long time ago haha.\n\nSo yeah, after losing my patience with 2-2, I just put the game on my shelf for the time being.  I just don't have the patience anymore for it, especially since I have 11 unopened games that I still have to play.  Rest assured though that I will return to Demon's Souls in the future (next year, most likely).",
        "description": "[\"Beautiful, compelling, and at times unforgiving, Demon's Souls is the hardcore RPG experience PS3 owners have been waiting for since the platform's launch. Revolutionary online features define your adventure like never before, presenting seamless interconnectivity that serves in every instance to enhance the single-player game. Unprecedented in its depth and subtlety, peerless in its relentlessly challenging gameplay, Demon's Souls is the ultimate action RPG. KEYFEATURES - Ultimate hardcore RPG challenge - In this brutal land, death is inevitable, but not final. Combining the best features of an action game and RPG, you'll slice, smash, shoot, and cast magic against some of the most horrible, vicious enemies ever encountered. Are you strong enough to face up to the impossible and win? - Ground-breaking online capabilities - Network features go far beyond any previous RPG, allowing players to leave hints for each other, replay death scenes, cooperatively revive dead players, or invade and wreak havoc in another's game. Not merely an add-on feature, multiplayer options are vast, and uniquely focused on changing and intensifying the single player experience. - Freeform and flexible - The open-ended structure of the game means that there is no single path, but rather a wealth of options. Set your own pace and progress as you like. Build exactly the character you want by creating a detailed avatar, nurturing the right stats, and customizing your skills and equipment.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1320364800000,
        "asin": "B001SGZL2W",
        "title": "Red Dead Redemption - Playstation 3",
        "overall": 4,
        "reviewText": "Simply put, Red Dead Redemption should be in every PS3 gamer's library.  It has Rockstar's signature sandbox formula a la Grand Theft Auto, yes, but it's set in the Wild West!  RDR is definitely a unique game in its own right for that reason.  The cutscenes are plentiful and beautifully rendered.  The storyline is decently good, too, with a large cast of characters.  There's also PLENTY to do in this game, from main story missions to side objectives to hunting & gathering.\n\nI decided to give it 4 stars because the controls at times could be a little clunky....I thought that activating Dead Eye could be a little less troublesome.  When you have to switch weapons on horseback and then go into Dead Eye, that can pose a problem and it cost me a few deaths in the process.  Also, I didn't like the fact that if you're out hunting & gathering, every single animal/herb collection is completely lost if you die in between main missions.  They could have at least put in an auto-save feature after each collection, like they did with Demon's Souls.  So the control scheme and the loss of items definitely warranted a one-star deduction from this game.\n\nKeep in mind that it will take you at least a month to really complete this game.  I personally did not finish the game (i.e. achieve 100% completion), but I feel qualified to post a review for it based on the fact that I completed the entire Main Story missions.  All Amazon reviewers for this game should have at least accomplished that before posting their reviews.  I'm going to put this game on my shelf and come back to it later after I beat 10+ other games I have left to play.  When the time comes, I'll go for 100% completion and also buy the Undead Nightmare pack.\n\nI can't comment on the multiplayer portion of the game because I never tried it.  I'm more of a single player type of guy than multiplayer, but that's just my own personal thing.\n\nThis game knocks 'em red dead with 4 stars.",
        "description": "['Red Dead Redemption is a Western epic, set at the turn of the 20th century when the lawless and chaotic badlands began to give way to the expanding reach of government and the spread of the Industrial Age. The story of former outlaw, John Marston, Red Dead Redemption takes players on a great adventure across the American frontier.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1322611200000,
        "asin": "B0015MISAG",
        "title": "Mayflash Wii/PS3 VGA HDTV AV Cable",
        "overall": 2,
        "reviewText": "Alright, so I bought this cable to hook up my Wii to my PC monitor.  I have a 2011 27-inch Acer 3D HDMI 1080p monitor.  I followed the instructions and successfully \"calibrated\" the cable on my family's downstairs TV first.  Then I hooked up my Wii via the cable to my computer monitor.  Please note that you need another VGA to VGA cable in order to hook it up to your monitor.  Luckily, I had one of those on hand...\n\nSo after setting it up, both audio and visual worked, and the colors looked fantastic.  However, after a few minutes of playing, the screen would suddenly fade to black for 2 seconds, and it kept on doing that every few minutes.  It's VERY annoying!!  This seems to be a common complaint for a lot of consumers, and after scouring the Internet for answers, I could not find any.\n\nI know the problem can't be my monitor because it's top-of-the-line.  My Wii settings were all set perfectly at 480p, widescreen or standard (doesn't matter, I got the same 2-second black screen).  SO WHAT'S THE PROBLEM??\n\nMy guess is that the cable is faulty or built incorrectly.  Maybe that extra VGA to VGA cable you need is screwing up the transmission somehow?  The connection is a little loose there, too..like you can't screw in the male VGA into the female VGA tightly enough since there are screws on both ends.  The problem definitely is not with my monitor at all, that's a fact.  I'm not sure what alternative I have left...maybe purchasing a VGA to HDMI cable (although I read that's impossible without also buying a converter)?  I don't know, but if I don't get an email response and a definitive answer within a week from Sewell Direct (where I bought it from), I'm returning it for a full and unquestionable refund.\n\nI'm going to be moving next year, and I really don't want to have to purchase a TV just to play Wii through the component cables (I don't need cable television since I have Netflix on my PS3 through my monitor).  So when that time comes, this thing HAS TO work on my PC monitor; otherwise, I won't be able to play Wii at all.\n\nThis review will be updated again.  If I get an answer that allows me to stop the black screen fades, then I may add a star or two.  If I don't get an answer or the problem continues, I'm downgrading this review to one star, getting my refund, and filing a complaint with the Better Business Bureau against Sewell Direct for selling faulty equipment to the American consumer and charging him/her for it.\n\nUPDATE:  I notified the manufacturer about the black screen issue, and they told me that it's due to the Wii overheating and that Nintendo has done nothing to address this problem.  I'm not sure if that's just a blame-game type of maneuver, but I wound up emailing Nintendo, and they told me to call them.  I don't know why they couldn't resolve this through e-mail and tell me what to do.  The black screen only lasts for 2 seconds every 4 minutes or so...not that big of a deal really.  I'll live with it.  My 2-star review still stands as is.",
        "description": "[\"Experience mind blowing, high-definition brilliance gameplay with the High Definintiion VGA Cable for PS3 and Nintendo Wii. Designed for HDTVs, LCD TVs, projectors as well as PC monitors, you can now play your PS3 at 480p, 720p, 1080i, or 1080p high resolution, or you can play your Nintendo Wii at 480p resolution. Don't settle for your standard component cable when you get the best output quality for your PS3 or Nintendo Wii with the High Definition VGA Cable for PS3 and Nintendo Wii.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1323043200000,
        "asin": "B002BSA388",
        "title": "Super Mario Galaxy 2",
        "overall": 2,
        "reviewText": "I'm a lifelong Mario gamer, and I must say that this game is NOT for first-time Mario players.  I would never recommend this game to a Mario newbie.  The game is visually amazing, yes, but when you get to World 5, things get pretty insane...enough to throw your controller at the screen and give up after 50 stars (which is exactly and proudly what I did).\n\nYou see, the thing is that once you get to World 5, you need 55 stars to get to World 6.  At most, you can only get about 51 stars from doing only the main star missions in all the galaxies up to that point.  You then have to get stars by doing the Prankster comets and various timed race missions (which are HORRIBLE...I've always hated those timed races).  That should not have to be the case at all.  In previous Mario games utilizing the star system, you were able to advance only by doing the main star missions.  Why isn't this the case here?\n\nBecause of that fact, I give this game 2 stars overall and it's the worst Mario game to date.  It's also a practically complete repeat of the first Super Mario Galaxy game, so it's lacking in originality severely.  Also, most of those side missions actually require a second person to play co-op.  Absolutely sucks...The end of Mario games as single player endeavors is over, and that's really sad.",
        "description": "['Launch into a new universe of gravity warping worlds in the sequel to one of the greatest games of all time! Yoshi joins Mario as they traverse a wild variety of galaxies exploding with imagination, helping out our hero as he gulps enemies, runs at super speed, or inflates like a blimp to reach high cliff tops. Whether Marios leaping into orbit around tiny micro-planets, tumbling through rooms with constantly flip-flopping gravity, or drilling through craggy worlds to emerge on the other side, hell need new abilities and serious jumping skills to survive the all-new challenges ahead!', '<table border=\"0\"> <tr> <td> <table border=\"0\"> <tr> <td> <a name=\"product_description\"></a> <i>Super Mario Galaxy 2</i> is an action platformer for Wii that continues the space-based fun begun by the 2007 runaway hit <i>Super Mario Galaxy</i>. Featuring out-of-this-world platforming across a wide array of unique planets and space environments, players can go it alone as Mario or team up with his old buddy Yoshi as they platform and puzzle-solve to their hearts content. Additional key features include new and returning power-ups, special power-up abilities when teamed with Yoshi and the new drill mechanic that allows Mario burrow into and through planets. <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table align=left width=210> <tr> <td valign=\"top\" height=\"2\"><img alt=\"Super Mario Galaxy 2 game logo\" title=\"Super Mario Galaxy 2 game logo\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.logo.200.jpg\" border=0 align=top width=\"200\" height=\"91\"></td> </tr> </table> <table align=right width=175 cellpadding=10> <tr> <td valign=\"top\" height=\"240\"> <div align=\"center\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.01.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=586,height=570\\'); return false;\"><img alt=\"Yoshi, Luma and Mario in Super Mario Galaxy 2\" title=\"Yoshi, Luma and Mario in Super Mario Galaxy 2\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.01.sm.jpg\" border=0 align=top width=\"300\" height=\"292\"></a><br> </div> <center> <span class=\"caption\">Team up with Yoshi for space-based platforming fun in Super Mario Galaxy 2.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=586,height=570\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> <b>New Out-of-this-world Adventure</b><br/> Like its predecessor, <i>Super Mario Galaxy 2</i> is an action platformer set in space. Platforming takes place between worlds, known as galaxies. Mario can move between smaller examples of these by jumping. He can also embark on longer jaunts via a small steerable planet in the shape of Mario\\'s head, but as a new twist he can also move into and through planets as well using the new drill mechanism. This allows for both a new direction in action as well as an opening to problem-solving and coin collection. Players can expect the return of a variety of powerups from the original game including Bee and Boo Mushrooms, but also many that are new varieties including the Rock Mushroom that temporarily turns Mario into a rock that can smash through barriers. Another key change to gameplay is the ability for Mario to join with his pal Yoshi. Once Mario hatches Yoshi from his egg he can ride him through a variety of scenarios. Yoshi\\'s particular reaction to specific powerups makes for fun with gravity. For example, when Yoshi eats a \"Dash Pepper\" he is able to move at hyper speed allowing the pair to literally run up the side of walls. Also, after eating a Blimp Fruit power-up Yoshi can swells up and floats like a blimp, taking Mario with him to areas of the game otherwise unreachable. <p/> <b>Key Game Features</b> <ul> <li>Mario collects stars as he travels from galaxy to galaxy. Every level is new, but the game retains the charm, sense of wonder and beauty in line with Mario\\'s history. Mario works his way through the various levels, sometimes upside-down, sometimes floating from place to place.</li> <li>On some stages, Mario can find an egg, smash it open and hop onto the back of Yoshi. Yoshi can use his tongue to grab items and shoot them back at enemies, or to snag attach points and swing across chasms.</li> <li>Yoshi has an interesting diet. When he eats a Dash Pepper, he gets so hot and frenzied he can run up steep inclines and vertical walls. When he eats a Blimp Fruit, he inflates like a balloon and floats to new heights.</li> <li>New powerups include a drill that Mario uses to tunnel through the planet\\'s surface all the way to the other side of a planet.</li> <li>Skilled players will want to collect new Comet Metals, which will unlock harder levels with even more challenges.</li> </ul> </td> </tr> </table> <b>Additional Screenshots</b>:<br/> <table cellspacing=\"0\" align=\"center\"> <tr> <td><div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.02.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=832,height=476\\'); return false;\"><img alt=\"Mario in space in Super Mario Galaxy 2\" title=\"Mario in space in Super Mario Galaxy 2\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.02.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Even better platforming fun.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=832,height=476\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.03.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=831,height=477\\'); return false;\"><img alt=\"The sawblade filled Puzzle Plank Galaxy in Super Mario Galaxy 2\" title=\"The sawblade filled Puzzle Plank Galaxy in Super Mario Galaxy 2\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.03.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Over-the-top challenges.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.03.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=831,height=477\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.04.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=832,height=476\\'); return false;\"><img alt=\"Mario chasing a star atop Yoshi in Super Mario Galaxy 2\" title=\"Mario chasing a star atop Yoshi in Super Mario Galaxy 2\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.04.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Special Yoshi abilities.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.04.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=832,height=476\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.05.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=832,height=476\\'); return false;\"><img alt=\"Starship Mario from Super Mario Galaxy 2\" title=\"Starship Mario from Super Mario Galaxy 2\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.05.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Explore Starship Mario.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B002BSA388.05.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=832,height=476\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> </td> </tr> </table> </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1323388800000,
        "asin": "B000JLIXIG",
        "title": "Resistance: Fall of Man - Playstation 3",
        "overall": 4,
        "reviewText": "Resistance: Fall of Man is one of the first (if not, THE first) game to debut with the original launch of the Playstation 3 system, and by golly, it's a great one!  It's a great first person shooter with an excellent storyline akin to \"War of the Worlds\".\n\nThe game is divided up into 30 levels of non-stop, alien-mutilating action with cutscenes at the completion of each level.  The A.I. in this game is truly amazing.  The Chimera are somewhat difficult to target, and they sneak right up on you!  You really need to actually focus your shots every time.  The theme song to this game is also great to listen to.  Armin Shimerman is one of the voice actors in this game.  I'm sure you remember him if you're a Trekkie.  He played Quark in Star Trek DS9.\n\nNow I took off one star from the game because I felt that there weren't enough checkpoints adequately placed within the levels.  There's nothing more frustrating than dying in a level and then have to go alllll the way back to the beginning because there wasn't a checkpoint where it should be.  Also, I was disappointed that this game doesn't have a trophy system.  There are \"skill points\" to accumulate, but I don't see how they would benefit unless you're into the multiplayer portion of this game (which I didn't bother to play).  Those skill points could have easily been translated into trophies, and that's what Sony should have done.\n\nOther than that, this is a solid 4-star game at the very least, and it should be a staple in your PS3 library.",
        "description": "[\"Only you can save mankind. Through brute force, a species of unknown origin known only as the Chimera have conquered Asia and most of Europe in mere decades during the early 20th century. Recognizing the potential for humanity's total annihilation, the United States supports the British Resistance in a European counterattack. The story follows Hale, a US Ranger, as he struggles for survival and desperately seeks a means to eliminate the Chimeran blight. * Believable Environments: Gameplay elements and enemies that create a sense of unease and set an atmosphere that frightens the player through bleak, dark and foreboding undertones. * Epic Battles: Engage in some of the largest turbulent battles ever witnessed on a console gaming system. * Technology: An immersive world delivers photo-realistic characters, environments and lighting effects that capture the power of the PlayStation 3. * Multiplayer Gaming: Co-Op play via split screen or compete against up to 40 players via online or LAN play.\", 'In Resistance: Fall of Man, US and British forces band together in a last-ditch effort to save England from a horric scourge -- the Chimera. This parasitic species infects other life forms with a virus that rapidly mutates victims into new Chimera. In mere decades this race has ripped apart populations across Asia and Europe and by 1951 has landed on the shores of England. You play the part of US a Army Ranger, fighting alongside a group of British resistance soldiers to free the country from the Chimera and to halt their spread across the globe.', '<b>The Chimera wars</b><br> War is everywhere and everything in Resistance. An alien race began toying with the planet just after Word War I and in mere decades, the Chimera &#x2568; a species of unknown origin propagating a virus that converts other life forms into more Chimera &#x2568; has overrun Russia and all of Europe. Humanity&#x2552;s hope for survival is slim, and the tide of the battle rests on the shoulders of U.S. Army Ranger, Sgt. Nathan Hale.', \"The Chimera didn't plan to take this protracted war lying down, however, and amassed their forces in Russia. Once Russia was captured, they quickly erected a wall around the former country, rebuking all efforts at communication or contact. While the world waited and wondered what other terrors might spill from the wall, England prepares for and falls to a major Chimera invasion in 1951.\", \"The United States comes to aid their English allies, but all does not go as planned. The next three days will see some of the most intense fighting the war has known thus far, and it's up to you to end the Chimera threat before the plague of defeat can encircle the globe.\", '<b>Next-generation gameplay and style</b><br> The gameplay of Resistance is classic First Person Shooter. Insomniac Games has combined its passion for creating exotic weapons and vehicles with a proprietary physics system to create unique human and alien weaponry. Many of the weapons of the game are era-appropriate, such as pistols and grenades. Other weapons, such as the Chimeran Auger, are of alien design. Due to the differences in the ways that the various weapons handle, great care must be taken when entering an area infested with Chimera with their own weaponry. In addition to the obvious array of weapons, players can use melee attacks and jump to avoid attack.', 'Special game actions, called \"Skill Tasks,\" are worth set number of points that can be spent to unlock new content in the game. A Skill Task may be something as simple as killing a number of enemies in a short period of time or as involved as locating a hidden area in the single player campaign. The mystery of the tasks, however, is that they aren\\'t actually revealed until you have completed the task. This makes for a great reply incentive, as you will be mowing down Chimera and be suddenly rewarded with task points, often when you least expect the reward.', \"Obviously, presentation is one of the areas in which Resistance shines. The frame rate is silky-smooth, and never seems to get bogged down when there is a large number of Chimera or teammates on screen. Animations are believable, the locations are detailed, and the voice acting is top-notch. Explosions are especially impressive, sending shrapnel and smoke in all directions. If you're looking for a game to impress your friends with graphically, look no further. Resistance is the type of game that makes you feel confident about the future of the PLAYSTATION 3.\", '<b>Track stats and more online</b><br> Resistance also boasts an impressive 40 player online multiplayer mode. It\\'s not uncommon to find large-scale battles with both intricate strategy and simple \"run and gun\" play styles. Created and managed jointly by Insomniac Games and Sony Computer Entertainment, MyResistance.net is the official online community destination for Resistance: Fall of Man. At MyResistance.net, players can view their multiplayer stats in near-real time, participate in forums with other fans, download unlockable content and more.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1325894400000,
        "asin": "B004X56OU8",
        "title": "Sonic Generations - Xbox 360",
        "overall": 5,
        "reviewText": "Sonic Generations is the finest Sonic game in years.  It's such a return to form for the franchise, and it's great to see a Sonic game with both 2D and 3D elements.  All the levels are cleverly designed, and you can tell a lot of work went into them.  At times, I felt like some of the levels were just way too fast-paced, but hey, this IS Sonic the Hedgehog we're talking about!\n\nThe time travel element to the storyline is pretty good, too.  You can get through the main story in a good day or so, but the collectible items and achievements really add a nice touch to it all.  The only minor issue I had with the game was the final boss.  I found that level to be a little odd, and it took me a few tries to find out exactly how to beat it.  All you have to do is keep holding down the X button to boost and dodge all the debris.  When I found that out, this level became the easiest boss stage in the game.\n\nThe challenge gates are a very nice addition as well, and they keep you busy even after you beat the game.  I didn't collect all the items and pass all the challenges, though, but if you're an achievement getter, then you should definitely attempt the extra levels.\n\nAll in all, this is a very fine game, and a work of art as far as Sonic is concerned.  5 stars",
        "description": "[\"Set across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognizable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic's most recent adventures.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1326844800000,
        "asin": "B002I0F5M8",
        "title": "Batman: Arkham City for Playstation 3",
        "overall": 4,
        "reviewText": "Batman: Arkham City (AC) is a worthy sequel to its predecessor, Arkham Asylum.  In this game, you explore a city rather than a prison colony, and the controls are exactly the same.  The FreeFlow combat system is also similar, with the inclusion of new gadgets and double counters.\n\nAs far as the storyline goes, I found Arkham Asylum's story to be better on the whole.  In AC, I did not like Hugo Strange's role in the plot, as well as his collaboration with Ra's al-Ghul.  Joker is the main villain once again, and that's definitely not a bad thing.  I just felt that all the other villains detracted from the focus on Joker (disconnected plot lines were apparent).\n\nSpeaking of the villains, I'm glad that the designers decided to incorporate plenty of new bad guys in this game; however, I felt that a few of them weren't designed like they should be.  For example, the Penguin has this weird, cockneyed English accent when he really should be speaking with a nasal bird-like sound.  Also, his hands were not webbed at all.  For Mr. Freeze, he never spoke in a Germanic accent at all, although his robotic suit voice was pretty cool.\n\nThe Riddler was also never seen as a physical entity in the game, other than in projection form.  Supposedly, he appears in the flesh at the very end of a side mission when you collect all 400 (yes, FOUR HUNDRED) riddler achievements.  That's not good enough for me, though.  No way did I go around collecting all the riddler trophies and solving all the riddles.\n\nSpeaking of collectibles, there's a TON of stuff to find in this game, and I certainly didn't bother with collecting everything.  All I did was beat Batman and Catwoman's main storyline and called it a day.  All the other Riddler trophies, Riddler's Revenge, and side missions I found to be extraneous.  The other DLC (Robin & Nightwing) are completely useless and a waste of money, unless you're a trophy collector.\n\nWhen you beat the main storyline, that's enough to have beaten the game entirely (in my opinion).  When I beat 100% of the main storyline, my total progress was only 36% (according to the game).  According to me, I was at 100%.  My other statistics at time of completion included:  16% side missions, 25% upgrades & collectibles, 13% Catwoman's collectibles, and no Riddler Challenges.  I didn't even bother with New Game + mode either.  In fact, playing the whole game on Normal difficulty was extremely hard.  The fights are very tough on that mode!\n\nThe Catwoman DLC package wasn't bad either.  Her main storyline revolved around her stolen goods with Two-Face.  As far as she is concerned, she wears these pinkish sunglasses on the top of her head, and I wished that she'd actually wear them on her face while you were playing.  You only see her put them on for 2 seconds at the very end of the game.  Such a cheap blow...  Also, her detective radar mode was very poorly designed.  You can't tell who's armed and who's not, which led to plenty of needless deaths.\n\nSpeaking of deaths, a major character dies at the end of the game.  If said character is indeed dead, how are they going to make another Batman game?  They'll have to either bring the character back, or never make another Batman game again.  And IF they do make another one, I hope it doesn't fall under the Call of Duty syndrome (i.e. same old story again).\n\nOverall, I give Batman: Arkham City four stars (really 3.5, but I gave it the benefit of the doubt).  It's a 2011 Game of the Year nominee, but it never reached that iconic status this time around.",
        "description": "['Arkham City&#xA0;is an open world&#xA0;action video game&#xA0;that incorporates elements of stealth and predator tactics. All of the gadgets previously obtained in the first game are present at the start of&#xA0;Arkham City&#xA0;(with the exception of the Ultra Batclaw, which is replaced with the regular Batclaw and Sonic Batarangs). Most of them have improved or new capabilities; for example, the Cryptographic Sequencer can also track signals, the line launcher now has a feature that allows Batman to flip over and launch another zipline perpendicularly across, switching directions, the remote control Batarang now has a built in brake and boost, and the grappling gun can now be used while gliding to boost Batman further up into the air. Four additional gadgets have been revealed: smoke pellets to confuse armed enemies when spotted by them, the Remote Electrical Charge which is a sniper-like taser gun used to power generators and shock enemies, ice grenades used to freeze enemies and make pathways through water, and a balled rope for tying up enemies. The game incorporates more puzzle elements; the use of Batman\\'s \"Detective Mode\", which highlights elements such as enemy skeletons and clues on-screen, is used to perform forensic activities such as tracing the origin of a sniper round.', '<div class=\"aplus\">', \"<i>Batman: Arkham City</i> is third-person Action-Adventure game that delivers an authentic Dark Knight experience rooted in an original and engrossing story as well as a combination of melee combat, stealth, investigative and speed-based challenge gameplay. A sequel to 2009's <i>Batman: Arkham Asylum</i>, <i>Arkham City</i> features the full range of classic enemies seen in the previous game, in addition to Catwoman, who is a playable character and has her own storyline in the new release. Additional features include: a range of new gadgets, an increased number of possible melee opponents and a range of movement options for Batman that include leaping, sliding, gliding and the grapple hook.\", 'Developed by Rocksteady Studios, <i>Batman: Arkham City</i> builds upon the intense, atmospheric foundation of <i>Batman: Arkham Asylum</i>, sending players soaring into Arkham City, the new maximum security \"home\" for all of Gotham City\\'s thugs, gangsters and insane criminal masterminds. The game features an unique combination of melee combat, stealth, investigative and speed-based challenge gameplay. Set inside the heavily fortified walls of a sprawling district in the heart of Gotham City, this highly anticipated sequel introduces a brand-new story that draws together a new all-star cast of classic characters and murderous villains from the Batman universe, as well as a vast range of new and enhanced gameplay features to deliver the ultimate experience as the Dark Knight.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1329436800000,
        "asin": "B005VBVQBU",
        "title": "Xbox 360 250GB Holiday Value Bundle (OLD MODEL)",
        "overall": 1,
        "reviewText": "I bought this system in November 2011.  It is now July 2013, and I got the solid red ring of death!  Do you believe this???\n\nWell, I do.  Microsoft's Xbox is NOTORIOUS for having hardware failures and other problems, and this time, I fell victim to it all.  I don't abuse my system at all (never dropped the controller, banged the system, or played for extremely long hours).  As I was playing Bioshock Infinite, I noticed that my system was making these weird clicking noises with subtle long, intermittent beeping occurring.  Then I couldn't autosave anything during the game. I managed to finish the game while the clicks and beeps were going on, but after I shut the system off and restarted, RED RING!  This system should NOT have failed in less than 2 years of owning it!  I've had my PS3 since February 2010, and that system has not failed me whatsoever.\n\nI will NEVER, EVER buy anything XBox-related ever again.  It's Sony all the way, and I strongly suggest that nobody purchases the Xbox One.  With all the outlandish policies Microsoft has regarding that system, as well as the apologies Microsoft has given about them, that's reason enough to boycott the Xbox gaming line.\n\nHappy 4th of July, Microsoft!  In the dumpster you go!",
        "description": "['Xbox 360 has more ways to play, and now for a limited time get two free games and a 3 Month Xbox LIVE Gold Membership.', '<div class=\"aplus\"> <div class=\"leftImage\" style=\"width: 450px; padding-right: 20px;\"><img border=\"0\" height=\"726\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/KinectHoliday_HaloFable.jpg\" usemap=\"#Screenshots\" width=\"450\" /></div> <h4>Xbox 360 250GB Holiday Bundle</h4> <br /> Xbox 360 has more ways to play, now with 2 free games and a 3 Month Xbox LIVE Gold Membership included for a limited time.', '', '', '', '<em>* Xbox LIVE Gold membership and/or other subscriptions and requirements apply for some Xbox LIVE features. See xbox.com/live. Broadband, games, add-ons and media content sold separately. Inside marked packages, while supplies last.</em>']",
        "domain": "Video_Games"
    }
]