[
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1356912000000,
        "asin": "0786958154",
        "title": "Bury Elminster Deep: The Sage of Shadowdale, Book II",
        "overall": 4,
        "reviewText": "I really like this series of Elminster books, but this book felt more like a filler that took way to long. still a decent read if your a fan none the less.",
        "description": "[\"ED GREENWOOD is the creator of the <b>Forgotten Realms</b> fantasy world setting and the author of more than 170 books that have sold millions of copies worldwide in over two dozen languages. In real life, he's a Canadian librarian who lives in the Ontario countryside with his wife, a cat, and far too many books.\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1356912000000,
        "asin": "0786942479",
        "title": "The Measure and the Truth (Dragonlance: Rise of Solamnia, Vol. 3) (v. 3)",
        "overall": 5,
        "reviewText": "Even though the plot is rather simple, don't expect any surprises here, but theres enough action to keep you interested in reading the next book of the series.",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1364947200000,
        "asin": "0786958421",
        "title": "Neverwinter: The Neverwinter Saga, Book II",
        "overall": 5,
        "reviewText": "Much what we come to expect from RA Salvatore, only complaint is this Nerverwinter series seems forcefully drawn out with a lot of filler.",
        "description": "[\"R.A. Salvatore is the <i>New York Times</i> best-selling author of more than forty novels, including the popular <b>Forgotten Realms</b> series <i>The Legend of Drizzt</i>. He's an avid gamer, father of three, and loyal citizen of Red Sox Nation.\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1364947200000,
        "asin": "078696362X",
        "title": "Charon's Claw: Neverwinter Saga, Book III",
        "overall": 5,
        "reviewText": "But the story & RA Salvatore's writing style is still enjoyable non the less, A must read for any fan!",
        "description": "[\"R.A. Salvatore is the<i>New York Times</i>best-selling author of more than forty novels, including the popular<b>Forgotten Realms</b>series The Legend of Drizzt. He's an avid gamer, father of three, and loyal citizen of Red Sox Nation. Residence:Massachusetts\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1414022400000,
        "asin": "1613778465",
        "title": "Dungeons &amp; Dragons: Fell's Five",
        "overall": 5,
        "reviewText": "Simply Fantastic! a Must for any fantasy reader fan, Very well written & the artist does a superb job bringing the action to life. only disappointment was in the end when you realize there won't be any more continued adventures of fell's five.....",
        "description": "['', '']",
        "domain": "Books"
    }
]