[
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1235260800000,
        "asin": "B000CEVC9W",
        "title": "Ultimate Avengers: The Movie",
        "overall": 5,
        "reviewText": "I can honestly say I enjoying the blu-ray version so much better then the regular dvd,its becoming all to difficult to settle watching anything but blu-ray's\nand these animated  movies were well done and stood out so much more when watched on blu-ray plus the fact I paid 12$ for the set which makes it a must own for any fan!",
        "description": "['Based on the comic book THE ULTIMATES, this animated feature is flush with heroes and excitement, as Captain America rises from oblivion to save the world once more from self-destruction. Aiding him is a team of diverse heroes of near-unstoppable power, including the Hulk, Wasp, Giant Man, Thor, and Iron Man.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1235260800000,
        "asin": "B00YSG2ZPA",
        "title": "Band of Brothers(Elite SC/BD+DCExp12-21)",
        "overall": 5,
        "reviewText": "The series is great! but the blu-ray version is makes it simply phenomenal A must own for lovers of great movies,I watched it on a 61\" hd full 5.1 surround sound tuned way up and many times I got chills from the feeling of immersion of being there in the middle of the action. buy Blu-ray now if you already don't own it,this is one of those movies that regular dvd's do it no justice.",
        "description": "['<![CDATA[', 'Band of Brothers (Rpkg/DC Exp2021/Blu-ray)', \"Based on the bestseller by Stephen E. Ambrose, the epic 10-part miniseries Band of Brothers tells the story of Easy Company, 506th Regiment of the 101st Airborne Division, U.S. Army. Drawn from interviews with survivors of Easy Company, as well as soldiers' journals and letters, Band of Brothers chronicles the experiences of these men who knew extraordinary bravery and extraordinary fear. They were an elete rifle company parachuting into France early on D-Day morning, fighting in the Battle of the Bulge and capturing Hitler's Eagle's Nest at Berchtesgaden. They were also a unit that suffered 150 percent casualties, and whose lives became legend.\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1235260800000,
        "asin": "B00006CXSS",
        "title": "Band Of Brothers (DVD)",
        "overall": 5,
        "reviewText": "The series is great! but the blu-ray version is makes it simply phenomenal A must own for lovers of great movies,I watched it on a 61\" hd full 5.1 surround sound tuned way up and many times I got chills from the feeling of immersion of being there in the middle of the action. buy Blu-ray now if you already don't own it,this is one of those movies that regular dvd's do it no justice.",
        "description": "[\"Based on the bestseller by Stephen E. Ambrose, the epic 10-part miniseries Band of Brothers tells the story of Easy Company, 506th Regiment of the 101st Airborne Division, U.S. Army. Drawn from interviews with survivors of Easy Company, as well as soldiers' journals and letters, Band of Brothers chronicles the experiences and fascinating tale of comradeship that is, in the end, a tale of ordinary men who did extraordinary things. Packed in a 6-disc gift box collection, The Band of Brothers DVD box set features interviews with the veterans, cast and crew and the making of the HBO series.\", 'HBO\\'s impressive miniseries may have the most handsome DVD packaging to date: a tin container enclosing the accordion sleeves holding six discs. The extras on the set are just as classy. Besides the rudimentary 30-minute making-of, there\\'s an hour\\'s worth of video diaries by actor Ron Livingston (who portrays Lewis Nixon) detailing the tough \"actors\\' boot camp.\" The first-person recollections of the real Easy Company soldiers that begin each episode are expanded in the 80-minute documentary <I>We Stand Alone Together</I>. The real footage and heartfelt recollections complement the series, but viewers may want more interaction between the lifelong friends. The documentary is better in the final minutes, when the veterans are not talking about the specific incidents depicted in the film. Another big help in this set is the \"field guide,\" a dossier of maps, glossary, definitions of ranks, a timeline, and a who\\'s who for each episode. <I>--Doug Thomas</I>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1257552000000,
        "asin": "B000BB1520",
        "title": "The History Channel Presents The Crusades - Crescent &amp; The Cross",
        "overall": 5,
        "reviewText": "History Channel did a great job with this series my only complaint was it lacked battle strategies and tactical overview maps of the warring parties,which would of been sweet! but as it stands they did do a great job none the less.",
        "description": "['THE CRUSADES: CRESCENT & THE CROSS presents the epic battle between two Middle Age superpowers: the Christian Crusaders and the Muslims. Fought over two centuries, the conflict decided the fate of the Holy Land of the Middle East. Only a tiny strip of land, just a few hundred miles long, it contained the ultimate prize, the city of Jerusalem.<br><br>The documentary is driven by the key personalities of the First, Second and Third Crusades, the popes, kings, sultans and knights who, in the name of God, ruthlessly fought for land and power. Experience the murder, treachery, and bloodshed of this legendary chapter of history through the eyes of key historical figures such as Richard the Lionheart and Saladin, King Louis VII and Nur al-Din.<br><br>With breath-taking CGI-enhanced visuals, heart-pounding reenactments, and stunning footage from rarely-seen locations THE CRUSADES: CRESCENT & THE CROSS brings the first three Crusades alive for a new generation in conflict.<br><br>DVD Features: Timeline; Behind-the-Scenes Featurette History in the Making: The Crusades ; Bonus Documentary The Knights Templar ; 16:9 Widescreen Format; Interactive Menus; Scene Selection', \"The Christian invaders were regarded as infidels. The Arabs were scorned as lawless pagans. The Westerners saw their quest as literally a sanctified crusade, while the Muslims launched their own holy war, called a jihad, in retaliation. Sound familiar? It should, because although the events depicted in the History Channel's <I>The Crusades - Crescent & The Cross</I> took place nearly a thousand years ago, they are but a distant mirror to what's going on in the Middle East right now. This two-part, three-hour program, released here on two discs (the second includes over an hour of bonus material), impressively details all three Crusades, starting in the late 11th Century, when Pope Urban II dispatched a huge force to reclaim Jerusalem, which had been under Muslim control for some 400 years. For the knights and others who made the journey, it was a noble spiritual quest, not to mention an escape from Europe's petty wars and famines; in the end, the fact that many of them were greedy butchers who murdered Muslims, Jews, and even other Christians indiscriminately (sometimes even eating the flesh of the vanquished) detracted not at all from their conviction that they were acting in the name of God. Of course, so were the Muslims, who, after the bloody first crusade succeeded in seizing the holy city, mounted a massive counterattack under leaders like Nur al-din and his son Saladin, who managed to take back Jerusalem (from whence Mohammed was said to have ascended to heaven) and hold on to it through the failed second and third crusades, the latter led by England's Richard the Lionheart.\", 'All of this is presented by way of techniques that will be recognizable to History Channel buffs. They include modern-day historians, who re-trace the routes of the crusaders and examine the ancient sites where the action took place, as well as actors who portray characters of the time (chroniclers, knights, and others); numerous re-enactments, aided by excellent cinematography and skillful use of CGI (whereby a few dozen extras could be made to look like many thousands), vividly illustrate the battles and other events that took place during this roughly 200-year period. Add to that a bonus documentary about the Knights Templar (the soldier-monks in charge of protecting the Kingdom of Jerusalem) and a decent \"making of\" documentary, and you have an absorbing, enlightening look at events that prove one thing above all: the more things change, the more they stay the same. <I>--Sam Graham</I>']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1356912000000,
        "asin": "B0021L8V1Q",
        "title": "Iron Man 2",
        "overall": 5,
        "reviewText": "I'm seriously liking what they are doing with Iron man series RD jr. was a perfect for the part of tony stark! this is a perfect example when they stay true to what made the comic characters great. Hollywood needs to stop trying to change what works. it's not broken don't try to fix it!",
        "description": "['Get the ultimate <em>Iron Man 2</em> experience with this special edition loaded with bonus features that take you inside the suit, plus a digital copy of the film that you can watch anywhere, anytime! Now that Tony Stark&rsquo;s superhero secret is revealed to the world, he must once again suit up in order to face his most dangerous enemy yet &ndash; but not without a few new allies of his own!']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1356912000000,
        "asin": "B004ULEEY8",
        "title": "Battle: Los Angeles",
        "overall": 3,
        "reviewText": "Movie doesn't break any ground in the alien taking over the world action genre, but it is still entertaining none the less with special affects. just don't expect anything deep here & you won't be disappointed.",
        "description": "[\"Witness the end of civilization unfold as hostile alien invaders attack the planet. As people everywhere watch the worlds great cities fall, Los Angeles becomes the last stand for mankind in a battle no one expected. Now it's up to a Marine staff sergeant (Aaron Eckhart) and his platoon to draw a line in the sand as they take on an enemy unlike any theyve ever encountered in this epic sci-fi action film.\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1364947200000,
        "asin": "B01AHWLX2O",
        "title": "King Kong (The Huntsman: Winter's War Fandango Cash Version) [Blu-ray]",
        "overall": 5,
        "reviewText": "While not the kinda movie known for it's great deeply thought out plot, it does it's job providing entertainment for everyone, the level of details shown on Blu ray are amazing!",
        "description": "[]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1364947200000,
        "asin": "B00005JO20",
        "title": "King Kong",
        "overall": 5,
        "reviewText": "While not the kinda movie known for it's great deeply thought out plot, it does it's job providing entertainment for everyone, the level of details shown on Blu ray are amazing!",
        "description": "['Academy Award-winning director Peter Jackson (The Lord of the Rings Trilogy) brings his sweeping cinematic vision to King Kong. Naomi Watts, Jack Black and Adrien Brody star in this spectacular film filled with heart-pounding action, terrifying creatures and groundbreaking special effects unlike anything you\\'ve seen before! Get ready for breathtaking action in this thrilling epic adventure about a legendary gorilla captured on a treacherous island and brought to civilization, where he faces the ultimate fight for survival. Experience the movie that critics are hailing as a \"rousing, exciting cinematic adventure!\" (Scott Mantz, Access Hollywood)', \"Movies don't come any bigger than Peter Jackson's <I>King Kong</I>, a three-hour remake of the 1933 classic that marries breathtaking visual prowess with a surprising emotional depth. Expanding on the original story of the blonde beauty and the beast who falls for her, Jackson creates a movie spectacle that matches his <I>Lord of the Rings</I> films and even at times evokes their fantasy world while celebrating the glory of '30s Hollywood. Naomi Watts stars as Ann Darrow, a vaudeville actress down on her luck in Depression-era New York until manic filmmaker Carl Denham (a game but miscast Jack Black) entices her with a lead role. Dazzled by the genius of screenwriter Jack Driscoll (Adrien Brody), Ann boards the tramp steamer S.S. <I>Venture</I>, which she--and most of the wary crew--believes is headed for Singapore. Denham, however, is in search of the mythic Skull Island, hoping to capture its wonders on film and make a fortune. What he didn't count on were some scary natives who find that the comely Darrow looks like prime sacrifice material for a mysterious giant creature....\", \"There's no point in rehashing the entire plot, as every movie aficionado is more than familiar with the trajectory of <I>King Kong</I>; the challenge facing Jackson, his screenwriters, and the phenomenal visual-effects team was to breathe new life into an old, familiar story. To that degree, they achieve what could be best called a qualified success. Though they've assembled a crackerjack supporting cast, including Thomas Kretschmann as the <I>Venture</I>'s hard-bitten captain and young Jamie Bell as a plucky crewman, the first third of the movie is rather labored, with too much minute detail given over to sumptuous re-creations of '30s New York and the unexciting initial leg of the <I>Venture</I>'s sea voyage. However, once the film finds its way to Skull Island (which bears more than a passing resemblance to <I>LOTR</I>'s Mordor), <I>Kong</I> turns into a dazzling movie triumph, by turns terrifying and awe-inspiring. The choreography and execution of the action set pieces--including one involving Kong and a trio of Tyrannosaurus Rexes, as well as another that could be charitably described as a bug-phobic's nightmare--is nothing short of landmark filmmaking, and a certain Mr. Spielberg should watch his back, as <I>Kong</I> trumps most anything that has come before it.\", \"Despite the visual challenges of <I>King Kong</I>, the movie's most difficult hurdle is the budding romance between Ann and her simian soulmate. Happily, this is where Jackson unqualifiedly triumphs, as this unorthodox love story is tenderly and humorously drawn, by turns sympathetic and wondrous. Watts, whose accessibility balances out her almost otherworldly loveliness, works wonders with mere glances, and Andy Serkis, who digitally embodies Kong here much as he did Gollum in the <I>LOTR</I> films, breathes vibrant life into the giant star of the film without ever overplaying any emotions. The final, tragic act of the film, set mostly atop the Empire State Building, is where <I>Kong</I> earns its place in movie history as a work that celebrates both the technical and emotional heights that film can reach. <I>--Mark Englehart</I>\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1366848000000,
        "asin": "B004EPZ07K",
        "title": "Green Lantern",
        "overall": 4,
        "reviewText": "Came in thinking the worse..but wasn't as bad, the visuals were great casting was good Ryan did an ok job, my only complaint was, why did the animated movie have better script writers then the live action Version?????  baffles the mind!",
        "description": "[\"In a universe as vast as it is mysterious, an elite force of protectors for peace and justice has existed for centuries. They are the Green Lantern Corps. When a new enemy called Parallax threatens to destroy the Universe, their fate and the fate of Earth lie in the hands of the Corps' newest recruit, the first human ever selected: Hal Jordan (Ryan Reynolds). Bringing the popular superhero to the big screen for the first time, Green Lantern also stars Blake Lively (<i>Gossip Girl</i>), Peter Sarsgaard (<i>Orphan</i>), Mark Strong (<i>Sherlock Holmes</i>), Academy Award nominee Angela Bassett* and Academy Award winner Tim Robbins**.\", \"As far as superheroes go, Green Lantern may lack the clean, iconic lines of his more respectable DC counterparts Superman and Batman, but the very wonkiness of the premise (earthling joins elite force of space cops) lends itself to a pulpy, operatic, not-entirely-serious approach. (One of his teammates is a talking carrot, after all.) Capitalizing on a charming performance by Ryan Reynolds, the feature-film adaptation is a big, messy movie that, at its best, generates a feeling of aw-shucks wonder. Much like <i>Thor</i>, it isn't afraid to loosen up on the inner turmoil of its hero and go macro. Based on comic writer Geoff Johns's retrofitting of the title character, the story follows Hal Jordan (Reynolds), an impulsive test pilot whose encounter with a dying alien leaves him with an energy ring capable of weaponizing his imagination. While struggling to master his will-based powers, he must deal with threats both earthbound (a hilariously nebbishy Peter Saarsgard, who may be the first supervillain to rock a hoodie) and galactic. Martin Campbell, a director who specializes in more down-to-earth heroics (<i>Casino Royale</i>,<i>The Mask of Zorro</i>), brings a pleasing matter-of-fact baseline to the proceedings, an approach that makes the increasingly outlandish effects truly feel special when they occur. <i>Green Lantern</i> has its debits, certainly--the lack of a memorable theme, a second act that hems and haws before getting to the action, the standard origin story shoehorning in too many secondary plots--but its final scenes succeed on a Gigantor, cosmic level where most superhero movies fear to tread. The bigger it goes, the more goofily enjoyable it gets. <i>--Andrew Wright</i>\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1414022400000,
        "asin": "B00EXPOCXY",
        "title": "Godzilla [DVD] [2014]",
        "overall": 5,
        "reviewText": "Loving this remake I couldn't stand the last remake the acting was well done. Do wish there were more battle scenes and back story such as time period\\evolutionary progression\\etc.",
        "description": "['Godzilla DVD movie. New version.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1414022400000,
        "asin": "B00D91GRA4",
        "title": "Man of Steel",
        "overall": 5,
        "reviewText": "Was very surprised by this remake was expecting the worse, but I really enjoyed it enough to add it to my Blu-ray collection!",
        "description": "['A young boy learns that he has extraordinary powers and is not of this Earth. As a young man, he journeys to discover where he came from and what he was sent here to do. But the hero in him must emerge if he is to save the world from annihilation and become the symbol of hope for all mankind.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1414022400000,
        "asin": "B00H2FPY20",
        "title": "The Amazing Spider-Man 2 2014",
        "overall": 5,
        "reviewText": "I'm totally digging this remake it's more true to the comics(sort of) I couldn't stand the whiny Tobey Maguire rendition!  over all it's very entertaining & visuals are awesome down right Amazing ;-) .",
        "description": "['It&rsquo;s great to be Spider-Man (Andrew Garfield). For Peter Parker, there&rsquo;s no feeling quite like swinging between skyscrapers, embracing being the hero, and spending time with Gwen (Emma Stone). But being Spider-Man comes at a price: only Spider-Man can protect his fellow New Yorkers from the formidable villains that threaten the city. With the emergence of Electro (Jamie Foxx), Peter must confront a foe far more powerful than he. And as his old friend, Harry Osborn (Dane DeHaan), returns, Peter comes to realize that all of his enemies have one thing in common: Oscorp.<br /><br />DVD Bonus Features Include: <br /> <ul> <li>4 All-New Deleted Scenes with Commentary by Marc Webb </li> <li>Filmmaker Commentary </li> <li>Alicia Keys &ldquo;It&rsquo;s On Again&rdquo; music video </li> <li>New Public Service Announcement for the Worldwide Orphans Foundation (WWO), featuring Andrew Garfield &amp; WWO CEO Dr. Jane Aronson</li> </ul>']",
        "domain": "Movies_and_TV"
    }
]