[
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1338249600000,
        "asin": "B0050SYNYQ",
        "title": "Elder Scrolls V: Skyrim Collector's Edition -Xbox 360",
        "overall": 5,
        "reviewText": "Skyrim for the PC is simply epic due to the simple fact it's online mod community is unmatched! I'm currently running 200+ mods and it's simply blows away everything that typical development companies can invest the time & money into putting together what Bethesda & it's Mod community.\n\nAs for CE to be honest it is rather seem over-priced but if you visit a hobby shop typical style models range about the same price so it's not that bad compared to the fact you get a game with the package, the Alduin & wall perch are well-made so well that Alduin scared my 1yr old lol",
        "description": "['The next chapter in the highly anticipated Elder Scrolls saga arrives from the makers of the 2006 and 2008 Games of the Year, Bethesda Game Studios. Skyrim reimagines and revolutionizes the open-world fantasy epic, bringing to life a complete virtual world open for you to explore any way you choose.', '<table width=\"1024\" border=\"0\">   <tr>     <td colspan=\"2\">The next chapter in the highly anticipated Elder Scrolls saga arrives from the   makers of the 2006 and 2008 Games of the Year, Bethesda Game Studios. Skyrim   reimagines and revolutionizes the open-world fantasy epic, bringing to life a   complete virtual world open for you to explore any way you choose.</td>   </tr>   <tr>     <td align=\"center\">', '<img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/skyrim_ce_logo.jpg\" width=\"447\" height=\"212\" />', '<sub>PUBLISHER: Bethesda Softworks <br />       DEVELOPER: Bethesda Game Studios<br />       RELEASE   DATE: 11/11/11<br />       PLATFORMS: Xbox 360&trade; / PLAYSTATION&reg;3 /<br />       Games for   Windows<br />     GENRE: Role-Playing</sub>', '&nbsp;', '&nbsp;', '&nbsp;']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1364947200000,
        "asin": "B0053BQN34",
        "title": "uDraw Game tablet with uDraw Studio: Instant Artist - Xbox 360",
        "overall": 2,
        "reviewText": "Simply due to the fact you must apply a large amount of pressure in-order for it to draw on the tablet due to it's push down tip, my 6yr old lost interest due to annoyance. the sale price makes sense now....cause it's simply collecting dust on my shelf now.",
        "description": "[\"The uDraw GameTablet comes to your Xbox 360 & PS3 video game consoles this fall! The only creative tool of its kind, the uDraw GameTablet offers endlessly imaginative gameplay, new functionality and hands-on fun. uDraw's debut on Xbox 360 & PS3 comes packaged with the all-new version of the uDraw Studio creativity suite. From artists of all ages to art styles that are classic or street-inspired, uDraw GameTablet and uDraw Studio: Instant Artist offer limitless variety and infinite ways to play.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1366848000000,
        "asin": "B0050SYYTK",
        "title": "Kinect Disneyland Adventures - Xbox 360",
        "overall": 4,
        "reviewText": "Over all it's not the best for children under 5yrs old can be a little daunting to circumnavigate around the park for them much less moving around, the mini games are pretty entertaining but do have inherent bugs in them like swapping out my little girl for some random guest boy??? don't have that problem with other Kinect games. over all the kids love all the Disney characters so it's win win for me cause it helps keep them distracted so I can play my games! ;p hehe",
        "description": "['Harnessing the controller-free magic of Kinect for Xbox 360, Kinect: Disneyland Adventures will allow children and Disney fans of all ages to explore Disneyland park, enjoy immersive adventures based on popular attractions, engage in challenging quests, and interact with beloved Disney characters using their full bodies and voices, no controller required. Kinect: Disneyland Adventures is your ticket to the magical world of Disneyland through Kinect, right in your living room.', '', 'Harnessing the controller-free magic of Kinect for Xbox 360, Kinect: Disneyland Adventures will allow children and Disney fans of all ages to explore Disneyland park, enjoy immersive adventures based on popular attractions, engage in challenging quests, and interact with beloved Disney characters using their full bodies and voices, no controller required. Kinect: Disneyland Adventures is your ticket to the magical world of Disneyland through Kinect, right in your living room.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1366848000000,
        "asin": "B001NTFATI",
        "title": "Logitech G9X Programmable Laser Gaming Mouse with Precision Grips",
        "overall": 5,
        "reviewText": "Hands down the best mouse I have ever laid hands on!!! perfectly smooth & responsive! I love playing 1st person shooters, so a high speed accurate mouse is a must, I can honestly say my KDR went up right away when I switched to this mouse, this is my 2nd G9x  last one died after a year of heavy use(non abusive not a rage gamer :p  ) so it's long term reliability is suspect, but I loved it so much I had to give it another chance, and it's still going strong so far..",
        "description": "['Interchangeable gripsGaming-grade laserOnboard memory to save settingsWeight tuning to personalize feel and control of mouseAdjustable sensitivity; shift from pixel-precise targeting (200dpi) to lightning-fast maneuvers (up to 5700dpi)Dual-mode scroll wheel with precise click-to-click and hyper-fast scrollingSuper-slick (Polytetrafluoroethylene) feetWorks with Windows 7 XP and Vista Includes wide load and precision grips weight-cartridge tuning weights and case']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1372636800000,
        "asin": "B001NX6GBK",
        "title": "Dante's Inferno Divine Edition - Playstation 3",
        "overall": 5,
        "reviewText": "Great game! don't listen to all those nay Sayers, complaining it's a God Of War clone. Yes it's very similar in play styles but that's where the similarities end. story line is visceral & brutal as expected being your trip takes you through the 9 levels of hell, so not recommended for children under 18! there is also brief nudity so take responsibility as a parent read the rating on the cover that states this fact!\n\nOver all story & game play are very well done and should not be missed! Deus vult!",
        "description": "['Dante&#x2019;s Inferno Divine Edition Includes', '<table border=\"0\"> <tr> <td> <table border=\"0\"> <tr> <td> <a name=\"product_description\"></a> <i>Dante&rsquo;s Inferno</i> is an epic single player, third-person action adventure game inspired by \"Inferno\", part one of Dante Alighieri&rsquo;s classic Italian poem, \"The Divine Comedy.\" Featuring nonstop action rendered at 60 frames-per-second, signature and upgradable weapons, attack combos and mana-fueled spells and the choice of punishing or absolving the souls of defeated enemies, it is a classic Medieval tale of the eternal conflict with sin and the resulting horrors of hell, adapted for a new generation and a new medium. <style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } </style> <p/> <table align=left width=210> <tr> <td height=\"80\" valign=\"top\"><img alt=\"Dante\\'s Inferno game logo\" title=\"Dante\\'s Inferno game logo\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.logo.200.jpg\" border=0 align=top width=\"200\" height=\"87\"> </td> </tr> </table> <b>Story</b><br/> The Italian mercenary Dante returns home from the bloodletting that was the Third Crusade to two pieces of soul-crushing news. The first is that although he was assured that he was absolved of mortal sins committed in the form of wartime atrocities in the name of the churches interests in the Holy Land, that is not actually the case and his immortal soul is in grave peril. The second and more terrible is that his beloved Beatrice has been murdered, and her soul pulled down into hell by a dark force. Vowing not to accept the damnation of either souls, he gives chase, vows to get Beatrice back and descends into the infamous nine circles of hell. For weapons, he wields Death\\'s soul-reaping scythe, and commands holy powers of the cross, given to him by Beatrice. <p/> <table align=right width=330> <tr> <td height=\"194\"><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.01.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=522,height=570\\'); return false;\"><img alt=\"Concept art from Dante\\'s Inferno showing Dante with stiched on crucifix and the Scythe of Death slung over his shoulder\" title=\"Concept art from Dante\\'s Inferno showing Dante with stiched on crucifix and the Scythe of Death slung over his shoulder\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.01.sm.jpg\" border=0 align=top width=\"320\" height=\"350\"></a><br> <center> <span class=\"caption\">Go to hell with Dante\\'s Inferno.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.01.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=522,height=570\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table> <b>Scythe Combat</b><br/> To vanquish the foes you encounter on your journey through the hell of <i>Dante\\'s Inferno</i>, you must learn to wield Death\\'s Scythe with precision and deadly force. Mix light attacks with heavy attacks to create combos, then incorporate jumps and grabs to add another layer to your combat. With dodging and Holy Cross moves thrown into the mix, you can truly become a force to be reckoned with. Without using all of your combative skills and techniques, there is no hope of ever reaching Beatrice. <p/> <b>Holy Powers</b><br/> During your journey, you may collect magic abilities for use against the legions of hell. When you perform the Righteous Path power you make a dash attack and leave a trail of icy shards in your wake. With Martyrdom you sacrifice health and mana to deal a heavy amount of damage to surrounding enemies. Divine Armor regenerates your health and protects you from damage. Add these and other powers to your arsenal to vanquish all who stand in your way and when you need to replenish your mana-fueled abilities, visit the Holy Fountains scattered throughout the gameplay area. <p/> <b>Creature Taming</b><br/> As powerful as weapons and magic are, sometimes surviving the perils of hell requires brute force. With the power of Death\\'s Scythe, you are able to mount the beasts of hell and use them against your enemies. All of this, however, requires ridding the beast of its current rider first. If successful, you will become the beast&rsquo;s new master. Now use its awesome power to pulverize enemies and complete tasks that require a beast\\'s strength. <p/> <b>Key Game Features</b> <ul> <li>Epic story adapted from the first book of the Medieval Italian classic The Divine Comedy, by Dante Alighieri.</li> <li>Nonstop action as you fight through Dante\\'s allegorical nine circles of hell.</li> <li>Wield the power of Death\\'s soul-reaping scythe.</li> <li>Beautiful fast-paced action and intense combat rendered at 60 frames-per-second.</li> <li>Choice-based finishes with enemies that allow players to punish the damned, or absolve them as they are defeated.</li> <li>Over 60 weapons, magic and combo upgrades and modifications.</li> <li>Huge destructive, ridable mounts that can be taken from defeated enemies.</li> </ul> </td> </tr> </table> <b>Additional Screenshots</b>:<br/> <table cellspacing=\"0\" align=\"center\" width=\"832\"> <tr> <td width=\"212\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=473\\'); return false;\"><img alt=\"Dante entering an area of note in Dante\\'s Inferno\" title=\"Dante entering an area of note in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.02.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Experience the 9 circles of hell.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.02.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=473\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td width=\"229\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.03.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=810,height=556\\'); return false;\"><img alt=\"Dante wielding the Scythe of Death in Dante\\'s Inferno\" title=\"Dante wielding the Scythe of Death in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.03.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Wield the Scythe of Death.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.03.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=810,height=556\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td width=\"295\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.04.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"Dante using Holy Powers against a horned baddie in Dante\\'s Inferno\" title=\"Dante using Holy Powers against a horned baddie in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.04.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">As well as Holy Powers.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.04.lg.jpg\" onClick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> <td width=\"212\"> <div align=\"center\"> <table align=center width=200 cellpadding=3> <tr> <td><a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.05.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img alt=\"Dante taking on a huge female Boss in Dante\\'s Inferno\" title=\"Dante taking on a huge female Boss in Dante\\'s Inferno\" border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.05.sm.jpg\" width=\"200\" height=\"150\"></a><br> <center> <span class=\"caption\">Engage in epic boss battles.<br/> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/dantes.inferno.ng.05.lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>.</span> </center> </td> </tr> </table></div> </td> </tr> </table> </td> </tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1397692800000,
        "asin": "B0085L2T14",
        "title": "WWE '13",
        "overall": 2,
        "reviewText": "Very disappointed in the control setup is horrible! they keep trying to fix it yet end up messing it up...it's not fluid and intuitive like some of the prior games of the series... I simply can't fathom why they keep trying to fix something that worked great before by changing what worked before like Smackdown VS Raw 2007 worked fantastically?!?!\n\nAll other aspects of the game are great graphics, number of wrestlers match types, and story plot modes. but the problem always falls to the problem the control scheme is so not user friendly that don't expect random friends whom never played before to simply join you in a game and enjoy it, it will quickly lead to frustration and them losing interest rather quickly....much to the disappointment of the reason buying this game to play with others...",
        "description": "['It takes blood, sweat, and tears to become the best in the world.  And if you want to rise to the top on your terms, you better bring the Attitude, and ignite a revolution. Last summer, one man revolutionized the sports entertainment industry.  In a legendary moment at the end of Monday Night Raw, CM Punk shook up WWE and a hero was born.  Fifteen years ago, the legendary &#x201C;Stone Cold&#x201D; Steve Austin revolutionized entertainment, sparking a new generation of supporters with his relentless Attitude.  Now, a new crusade is upon us, and it doesn&#x2019;t start with an iconic WWE Superstar on television, online, or at a live event.  WWE &#x2019;13 is imminent, and it&#x2019;s time to Live the Revolution.  The WWE videogame franchise returns to provide the most authentic, seamless and passionate experience to date, presented with a grittier Attitude.  WWE &#x2019;13 will transform WWE gameplay through the introduction of WWE Live, completely changing the videogame&#x2019;s audio and presentation elements.  Predator Technology returns to further implement critical gameplay improvements, while fan favorites in WWE Universe Mode and the franchise&#x2019;s renowned Creation Suite are poised to offer the utmost in player freedom.  Furthermore, WWE &#x2019;13 will introduce a groundbreaking, single-player campaign based on the highly influential Attitude Era.  Complete with a robust roster &#x2013; the largest to date in the franchise &#x2013; along with a host of additional features, WWE &#x2019;13 is ready to live a revolution all its own.', '<div class=\"singlecolumnminwidth\">    <div class=\"aplus\" >', 'LIVE THE REVOLUTION. It takes blood, sweat, and tears to become the best in the world. And if you want to rise to the top on your terms, you better bring the Attitude, and ignite a revolution.', 'Bring the atmosphere, spectacle, and fervor of a raucous WWE Live event into your living room with awe-inspiring Spectacular Moments and a new audio system that delivers the most authentic and dynamic commentary, sound effects and crowd participation ever in a WWE game.<br />                               It was a time when Stone Cold Steve Austin battled for supremacy against his maniacal boss, Mr. McMahon. An era where The Rock told opponents to &ldquo;know your role, and shut your mouth&rdquo;, where the Undertaker threw Mankind off the top of the Hell in a Cell, and D-Generation X broke all the rules. Now, for the first time, relive this groundbreaking era in an all-new single player campaign mode that will make you experience the Monday Night Wars like never before.<br />                               The fan-favorite WWE Universe mode returns, giving you more control over WWE than ever before. Your choices determine your destiny as you dynamically shape your schedules, television shows, and rosters, and form alliances and make enemies on your way to the top.<br />                             With new animations, transitions, and modified controls built on the Predator Technology&trade; game engine, WWE &rsquo;13 will deliver strategic, fluid, and fun WWE action that plays more smoothly than any prior WWE game.', '&nbsp;']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A1I77V5LJLN8PB",
        "reviewerName": "Paul K",
        "reviewTime": 1414022400000,
        "asin": "B0058GNK30",
        "title": "CTA Digital Xbox 360 - Kinect Perfect Range Anti-Slip Gaming Mat",
        "overall": 5,
        "reviewText": "Serves it's purpose by keeping the kids fighting for positioning when playing games like Kinect party, does slid a bit on the carpet so I would recommend using carpet tape, also a bit slippery when wearing socks but has additional padding on it to soften any spills that they make. also picked it up 10$ cheaper then Walmart!",
        "description": "['The Xbox 360 Kinect is the first of its kind in controller-free motion capture gaming.  Make the most of this new technology with the Perfect Range Game Mat for the Xbox 360 Kinect from CTA Digital.  The beauty of the Game Mat is that it allows for a clear view of Kinect&#x2019;s 1 and 2 player gaming zone, while protecting your floors and carpets and reducing noise.  By placing the mat centered, 4&#x2019; from the Xbox 360 Kinect&#x2019;s camera, players can see a clear visual guide of the gaming area for a flawless Kinect experience.  Without the mat&#x2019;s visual guide, gamers can easily find themselves outside the gaming zone.  While playing a controller-free system it&#x2019;s also very easy to become misaligned with the camera, making it frustrating to again find the correct area and distance.  The Perfect Range Game Mat makes it incredibly easy to stay within Kinect&#x2019;s gaming zone, but also to find your way back once you&#x2019;ve moved.  It&#x2019;s also made of durable and comfortable foam, and includes an anti-slip material to keep the mat in place during intense gaming sessions.  The Game Mat is compatible with all Xbox 360 Kinect games and rolls up to store easily in your home.  The stylish design and practical function of CTA Digital&#x2019;s Perfect Range Game Mat is sure to make the most of your Xbox 360 Kinect.', '<div class=\"aplus\"> <H4>Perfect Range Game Mat for the Xbox 360 Kinect</H4>', 'The Xbox 360 Kinect is the first of its kind in controller-free motion capture gaming.  Make the most of this new technology with the Perfect Range Game Mat for the Xbox 360 Kinect from CTA Digital. The beauty of the Game Mat is that it allows for a clear view of Kinect&rsquo;s 1 and 2 player gaming zone, while protecting your floors and carpets and reducing noise.  By placing the mat centered, 4&rsquo; from the XBOX 360 Kinect&rsquo;s camera, players can see a clear visual guide of the gaming area for a flawless Kinect experience.', 'The beauty of the Game Mat is that it allows for a clear view of Kinect&rsquo;s 1 and 2 player gaming zone, while protecting your floors and carpets and reducing noise. So you will know exactly where to be standing for optimal kinect camera viewing.', 'By placing the mat centered, 4&rsquo; from the Xbox 360 Kinect&rsquo;s camera, players can see a clear visual guide of the gaming area for a flawless Kinect gaming experience.', 'Without the mat&rsquo;s visual guide, gamers can easily find themselves outside the gaming zone.  While playing a controller-free system it&rsquo;s also very easy to become misaligned with the camera, making it frustrating to again find the correct area and distance. The Perfect Range Game Mat makes it incredibly easy to stay within Kinect&rsquo;s gaming zone, but also to find your way back once you&rsquo;ve moved.', 'It&rsquo;s also made of durable and comfortable foam. It is safe for children of all ages to play on.  Includes an anti-slip material on the bottom to keep the mat in place during intense gaming sessions. This mat will eliminate scuff marks on your tile or wood floors, and reduce the wear to your carpets.', 'The Game Mat is compatible with all Xbox 360 Kinect games and rolls up to store easily in your home.  The stylish design and practical function of CTA Digital&rsquo;s Perfect Range Game Mat is sure to make the most of your Xbox 360 Kinect.', '(1) 55&rdquo; x 78&rdquo; Game Mat for the Xbox 360 Kinect']",
        "domain": "Video_Games"
    }
]