[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1343606400000,
        "asin": "0683306502",
        "title": "Langman's Medical Embryology",
        "overall": 5,
        "reviewText": "I used this book for embryology class in my Pathologist's Assistant program, and it's excellent.  What actually made the book so great was that my professor completely bypassed all the useless junk about molecular regulation in every chapter (which is very useless in pathology....in fact, unless you're going to be working in a children's hospital, embryology is a very useless course as a whole, in my opinion).  My professor also took most of his exam questions from BRS Embryology.  What an easy A this course was, and I hope it will look good for my prospective applications to medical school down the road.\n\nBut anyway, I highly recommend this text overall.  The pictures are very well done, so if you're a visual learner, they will be of great use to you.  For me, I could not look at any of the pictures because they confused me to no end, and they were doing more harm than good.  I found that all the different color-coded schemes in each picture to be too convoluted.  As long as I memorized the processes word for word, I understood what was going on with ease.  My personal favorite part of the book was the clinical correlations in every chapter.  If you're into pathological disease processes and viewing twisted pictures of fetuses, you're in for a treat!  Thanks for this great textbook, Tommy S.!",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1344211200000,
        "asin": "080361599X",
        "title": "Laboratory Management: Principles and Processes",
        "overall": 4,
        "reviewText": "I had to take a lab management course during the summer semester for my Master's program, and Denise Harmening's \"Laboratory Management: Principles and Processes\" is perhaps the most thorough textbook out there about the subject.  I don't have any real complaints about the book itself, except for the fact that I wish there were some color photographs in it as well as less complex diagrams.  But other than that, the book handles the major tenets of laboratory management quite nicely.",
        "description": "[\"The laboratory environment changes in response to trends in health care. Laboratory managers who can create solutions to today's problems and effectively manage change are in high demand. Here is a problem-based approach to teaching the principles of laboratory management. The text focuses on presenting underlying managerial concepts and how to successfully apply theoretical models to real-life situations. Each chapter contains Suggested Problem-Based Learning Activities, which instructors can use for student group activities or assignments.\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1344211200000,
        "asin": "1416034927",
        "title": "The Language of Medicine",
        "overall": 3,
        "reviewText": "I had to take a Medical Terminology course for the summer semester of my Master's program, and Davi-Ellen Chabner's \"The Language of Medicine\" is a great book that touches on all the vocabulary aspects of the terminology used in medicine, but the book itself has a few very annoying aspects to it.\n\nFor one thing, she uses a lot of family photographs in this textbook.  Not that there's anything wrong with seeing a picture of children in the dedication/preface page (which I don't know if those are her biological children, adopted children, or just a picture of kids in general), but she also has pictures of those kids (and her family) in later chapters as well.  Now, when I'm studying a particular subject, I certainly don't want to see family photographs of any kind.  Save those for your Christmas cards, Davi-Ellen...not a professional textbook!\n\nAlso, I was really offended by one of her \"circle the correct term\" exercises at the end of her Immune System chapter.  The topic of said question deals with HIV/AIDS, and the author uses a married man who cheated on his wife with a few homosexual affairs to arrive at that answer.  To me, that's a very poor topic choice to use.  Why couldn't she have used someone who got a needle-stick from a patient who previously tested HIV+ as her example?  I sincerely hope that she changes that review question in her next edition, because right now, she's really painting herself out to be a homophobic Christian fundamentalist or born-again Christian type of individual.\n\nThe above discrepancies caused me to deduct two stars from my review, so I give this textbook three stars overall for excellent treatment of the subject matter.",
        "description": "[\"This market-leading text helps readers understand and learn complex are generously illustrated in full color and reinforced with exercises on combining forms and word parts. medical terms by dividing them into their component parts, clearly explaining the meanings of these terms in the context of how the body works in health and disease. Terminology and complex medical processes are described in an easy-to-understand manner that is readily accessible to learners of all levels. The Language of Medicine brings medical terms to life with a text/workbook format organized by body systems, offering additional chapters on specific key areas of health care, such as cancer and psychiatry. Anatomy and physiology sections 5 out of 5 stars<br /><br /> <br /><br />-Doody's Book Review Service\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1351987200000,
        "asin": "0142001198",
        "title": "The Art of Seduction",
        "overall": 3,
        "reviewText": "Robert Greene's \"The Art of Seduction\" leaves much to be desired in the end. Basically, this \"manual\" on the seductive arts is nothing more than a history lesson with manipulative \"tips and tricks\" enveloped around it. I decided to deduct two stars from my review for the following reasons:\n\n1) The use of long-winded quotes and passages on the sides of every page takes up too much space and is quite distracting. On numerous occasions, I found myself reading through a quote that took up 3 pages, and I wound up losing my original place in the book. This fact is frustrating, to say the least, and the book deserves a one-star deduction just for this.\n\n2) The other deductive star is for the author's premise of the book. Mr. Greene makes the text out to be like a \"how-to manipulate your victim\" type of manual. He uses plenty of historical examples to back up his tips and tricks. The historical accuracy of these examples is open to scrutiny as well. I feel as if the author over-exaggerated a few examples in the text, but I digress...\n\nOverall, \"The Art of Seduction\" did open my eyes regarding what seduction really is all about and how it plays out in male/female interactions. You see, I firmly believe that if you're going to seduce somebody for whatever reason, you were never a match for that person to begin with. If you're going to actually put effort or hard work into making somebody fall for you, he or she is not a good fit for you in the long term. Mark my words on that! Falling in love and forming long-term relationships should NEVER pose a challenge at all. It should happen with ease and overall free-flowing compatibility (like a soul mate connection). The act of seducing others has absolutely nothing to do with soul mate-type connections or falling in actual, real love. People \"seduce\" other people because unconsciously they know that who they're seducing is not a match at all for them (or at least not their perfect match), so they get a sadistic (or masochistic?) thrill out of seducing. Ulterior motives are also usually present in the seductive act. That's the key human psychology behind the art of seduction right there.\n\nWith that stated right off the bat, I was also enlightened on male/female interactions. It's amazing how the male must \"give up\" his masculinity and adopt femininity to an extent if he is to bond/mate/involve himself with a female. With all the bigoted comments against homosexuals and homosexuality, wouldn't this emasculating act being performed on the part of a heterosexual male be labeled as feminine? YES! In this respect, all heterosexual males emasculate themselves in order to bond with a female. Amazing, isn't it? I will NEVER, EVER give up any portion of my masculinity just to mate with someone else. This is exactly why I'm not into women and never will be. Thank GOD!\n\nOverall, 3 STARS. Thanks for opening my eyes about male/female relationships, Mr. Greene!",
        "description": "['Priase for the work of Robert Greene: \"Compelling.\"<i><b>Forbes</b></i><br /><br />\"Greenes specialty is analyzing the lives and philosophies of historical figures like Sun Tzu and Napoleon, and extracting from them tips on how to manipulate people and situationsa cutthroat worldview that has earned him a devoted following among a like-minded readership of rappers, drug dealers and corporate executives.\"<b><i>The New York Times</i></b><br /><br />\"Illuminating.\"<i><b>The Guardian<br /><br /></b></i>Machiavelli has a new rival. And Sun Tzu had better watch his back. Greene . . . has put together a checklist of ambitious behavior. Just reading the table of contents is enough to stir a little corner-office lust.<i><b><b><i>New York</i> magazine</b><br /> </b></i><b><i><br /></i></b> Beguiling . . . literate . . . fascinating. A wry primer for people who desperately want to be on top.<b><i>People</i> magazine</b><br /><br /> An heir to Machiavellis Prince . . . gentler souls will find this book frightening, those whose moral compass is oriented solely to power will have a perfect vade mecum.<i><b><b><i>Publishers Weekly</i></b><br /><br /></b></i>', \"<b>Robert Greene,</b>the #1<i>New York Times</i>bestselling author of<i>The 48 Laws of Power</i>,<i>The 33 Strategies of War</i>,<i>The Art of Seduction</i>,<i>Mastery,</i>and<i>The Laws of Human Nature,</i>is an internationally renowned expert on power strategies. He lives in Los Angeles.<br /><br /> <b>Joost Elffers</b> is the packaging genius behind Viking Studio's Secret Language series, <i>Play with Your Food</i>, and <i>How Are You Peeling?</i> He lives in New York City.\", '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1362009600000,
        "asin": "161072657X",
        "title": "Praxis II General Science: Content Knowledge (5435) Exam Secrets Study Guide: Praxis II Test Review for the Praxis II: Subject Assessments",
        "overall": 2,
        "reviewText": "First of all, the price for the Kindle edition of this study guide is astronomical.  I purchased the Kindle version for $97.12 because Amazon wasn't selling it directly brand new, and I don't trust buying books from third-party sellers who are not Amazon-certified.  I therefore had no choice but to purchase the Kindle edition.\n\nSecondly, the content of this study guide doesn't exactly match the exam topics specified in the ETS PDF test manual.  The study guide also drifts from topic to topic in a non-sequential order at multiple places throughout the book.  The topics that the book does cover are either presented in not enough detail or in extreme detail with extraneous information that you don't need to know for the Praxis exam.\n\nAt the end of the study guide is a practice test.  I'm not sure how well this exam mirrors the actual Praxis test, but I sincerely hope that it's nothing like it.  After reading the study guide and taking a few notes, I got 29 wrong out of 120 questions.  That equates to a score of 76%, which I hope is passing.  The guide should have included a Praxis score rating system so that you can find out if you met or exceeded the passing score required as set forth by your state.  There were 3 questions in the practice test that I feel should be thrown out.  Here are the questions that are under debate:\n\nQuestion 6 about the student conducting an experiment using a poorly calibrated thermal-infrared gun.  The book says answer C is correct...that this is a systematic error and the student should increase the temperatures for a school project to compensate for the incorrect temperature reading.  NO.  You cannot just fudge the numbers in an experiment!  That completely goes against proper scientific investigation!  The answer should be A:  The student should recalibrate the instrument and redo the project.  For this answer, the book states that recalibrating it isn't realistic because the student may not be qualified to recalibrate it.  Ummm, then why is the student using such a sophisticated piece of equipment in the first place?  In ANY scientific experiment, you need to make sure that your instruments are properly calibrated first and foremost, and if you don't know how to calibrate or are unqualified to calibrate it, then why are you even using it?  The correct answer is indeed A.\n\nQuestion 119 about the potential drawback of medical advances on human life.  The book says answer B is correct....that medical advances have drastically increased the human life span, placing stress on the environment and the economy.  It's true that medical advances have that effect if they increase the human life span, but they have not DRASTICALLY increased it.  The over-exaggeration of that answer makes it incorrect.  The correct answer should be C:  While medical advances have cured many diseases, new diseases may still arise and threaten lives.  All you have to do is look at antibiotic resistance.  The answer is C, folks...not B.\n\nFinally, Question 120 about which result of increased health awareness is most likely to have negative effects on society if not regulated properly.  The book gives answer C as correct...wide availability and use of prescription drugs.  Sure, that is a correct answer because it can lead to abuse.  However, answer A is also correct...increased funding for medical research.  What to do with that funding and where to delegate it for what type of medical research can have negative effects if you're funding human experiments of an immoral or unethical nature.  So both A and C are correct and plausible\n\nSo because I consider the answers provided by the book for these 3 questions to be incorrect, I really got 26 wrong instead of 29 for a score of 78%.  Again, I don't know what that equates to in Praxis terms, but I hope it's passing.\n\nIt's a shame how this is the only guide on the market that comes close to helping you prepare for the Praxis General Sciences Content Knowledge exam, but it falls far short of the mark.  We need a more effective study guide out there for this particular exam.  Will this have to do in the meantime?  Yeah, unfortunately.  I plan on taking the Praxis test next month as of the date of this review, and I just hope to do my best on it.  I'm a biology expert, so having to deal with the other sciences like physics and geology are really annoying for the sake of this exam, and I'm not going to bother looking up those topics in outside sources for review.  Your best bet is to take the ETS practice test and go to a Praxis practice test website to purchase a ton of exams.  That appears to be the only way to effectively prepare for the General Sciences test.\n\nUPDATE:\n\nAs of March 13, 2013, I scored a 186 on the Praxis General Sciences: Content Knowledge exam.  That qualifies for Recognition of Excellence for this exam as well.  I honestly don't know how I scored that high because I guessed on practically all of the Physics questions.  I thought for sure that I got almost all of those questions wrong.  I do not attribute my success to this guide, however.  With regard to the Physics questions I saw (which a lot were mathematically based), this guide completely did not prepare me for that section at all.  I must have done well due to smart guesswork then.  That's the only reason I have to explain my score on the Physical Sciences portion of the test.",
        "description": "['', '<b>A Praxis II Test Study Guide Unlike Any Other</b>', \"If you'd like to get the Praxis II test score you deserve, to quit worrying about whether your score on the Praxis II test is &#34;good enough,&#34; and to beat the test taking game, then this might be the most important message you read this year.\", \"Our comprehensive study guide for the Praxis II Subject Test is written by our Praxis II test experts, who painstakingly researched the topics and the concepts that you need to know to do your best on the Praxis II test. Our original research into the Praxis II: Subject Assessment, offered by the Educational Testing Service (ETS), reveals the specific content areas and the essential skills that are critical for you to know on the Praxis II test. We've taken the information and developed a study guide that is guaranteed to help you be successful on the Praxis II test.\", 'Regardless of which Praxis II test you have to take- you have come to the right place. Here you will find everything you need to know in order to be successful and get your certification.', 'Now, we know you may be skeptical, so let us give you three good reasons we can back up what we claim:', '<b>The Three Reasons To Believe What We Say</b>', '<b>The First Reason:</b>', \"Our company's name is Mometrix Test Preparation, and we have a team of standardized test researchers who have worked on developing our study guide for the Praxis II test. The standards for who gets to work on the team are very strict- we demand the best for our customers, and only those who met our exacting standards made the cut. The dedicated research staff have years of combined experience in mastering the content and skills necessary to succeed on the toughest exams.\", '<b>The Second Reason:</b>', 'Some academic studies have revealed that test takers do not really benefit from the traditional test preparation process. But we knew there had to be a solution- if test takers were not doing well on the Praxis II test despite high intelligence, there had to be a set of secret keys to the test that would open the door of success for these test takers.', 'We believe we have succeeded in finding the secret keys of the exam. What we found was surprising, and in some cases <b>ridiculously simple</b> once explained to the average test taker.', 'We put the findings together in a thorough, concise study guide that we believe allows any test taker, at any skill level, to <b>improve his or her results dramatically</b> with a <i>minimum of effort</i>.', '<b>The Third Reason:</b>', 'We created the product in part because we were frustrated by the options available to test takers who really wanted to do well on the Praxis II test.', \"A common approach is to TEACH the material, instead of TEACHING THE TEST. That's not necessarily good enough for the Praxis II test- you have to know how to apply the knowledge. Most test takers already have a general knowledge of the material that will be covered on the exam.\", 'One reason some test takers do well on the day of the test is that they have made the critical connection between the material they learned and how to use the material to succeed on the Praxis II test.', 'Our guide addresses the difference between merely knowing the material and knowing how to use the material to <b>perform on test day</b>.', \"You're going to save time, money, and aggravation. You'll learn to avoid the mistakes and the bad strategies that you've been vulnerable to. --Just for starters, here are some ways our product can help your score on the Praxis II test...<br /><br />\", \"<b>The Exclusive Test Taking Techniques</b><ul><li>Explains how the Praxis II test time limits are the #1 enemy of most test takers, and what you can do about it- You avoid falling into the many &#34;time traps&#34; built into the test, giving you an immeasurable advantage over those who go into the test unaware<li>Shows you super speed methods to get through the questions you know with ease- Saving you time so you concentrate on the hardest questions without rushing<li>Get quick, customized help for the questions you have- just send us a quick email and we'll get back to you promptly with the answer.<li>Keys to questions that &#34;give away&#34; the wrong (or right) answers- You get credit for some of the questions without really even knowing anything about them<li>Details the EXACT STUDY PLAN for the Praxis II test that we believe gives the most results in the least time- No matter if you're studying for a week or a month, you won't waste the precious study time you have on useless activities<li>Our researchers are more than just academic theoreticians who understand the technical nature of standardized tests, but are also experts on test taking itself- they reveal the exact skills and the information you'll need to perform under pressure during the test.<li>A systematic analysis and the best breakdown into &#34;plain language&#34; of how to deconstruct and master complex problems- You turn the problems that most of the test takers will stumble over to your advantage<li>Learn why, when, and how to guess to your advantage. Many test takers use exactly the wrong strategy, but you can avoid the pitfalls with the help of our standardized test experts<li>The secret keys that &#34;gives away&#34; the right answer a lot of the time- You know the special &#34;flags&#34; and the specific &#34;giveaways&#34; to look for<li>Includes instructions detailing the best way for you to get started with your preparation efforts so you can begin the path of improving your scores immediately<li>The most efficient and accurate method for picking the right answer- You won't be scratching your head trying to read the mind of the test question writer, but will instead know exactly what to look for to pick the best answer<li>Our quick problem solving method for difficult problems- You speed right through these notorious time-wasters<li>Courteous, unlimited customer service is 100% free- if you need the product emailed to a different address, lose the product, or have any other difficulty- the help you need is just a short email away and our representatives are active 7 days a week helping customers<li>The research of our team of test experts is 100% independent and original<li>Our exclusive &#34;calibration strategy&#34; to help you never go too fast OR too slow when answering even the toughest questions<li>The 5-step process we've developed, what we call the &#34;phased&#34; approach, concerning the use of the various study aids and practice tests<li>How the problem of procrastination can kill your chance of success, and the most important thing you can do about it<li>How to know when you've studied as much as you need to for the exam- and the reason why we think some people should spend LESS time studying for the test<li>The Top 20 things you should take care of within 24 hours of taking the test- use the list we provide as a checklist to make sure you've taken care of the &#34;little things&#34; in addition to studying hard<li>How to predict the right answer before you see the answer choices- and how to prevent the wrong answers from &#34;polluting&#34; your mind and tempting you into a trap designed by the test writers --<li>Why answers that &#34;sound&#34; correct are often the very ones that are wrong- and how to tell the difference between the right answer and the many clever-sounding traps set for you by the test writers<br /><br /><li>Do you know what a &#34;hedge phrase&#34; is? Learn why looking for the key &#34;weasel words&#34; in the question can help identify the correct answer<li>Why &#34;new information&#34; in the answer choices almost always means that the answer choice is wrong- and the way to avoid this trick planted by the clever test writers<li>Learn to avoid this time-draining mistake on the test - why the technical terms you don't know can be a major stumbling block and waste precious time, and the way that you can work around them<li>The secret to using the contextual clues in the questions and the answer choices to make important distinctions between the right and the wrong answer choices<li>The two situations where you should NOT check your answers thoroughly<li>How to avoid careless mistakes by using the quick &#34;double check&#34; system. It will more than pay for itself relative to the time it will take you<li>Test writers will often quote directly from the question in an answer- learn whether this is something you should trust or avoid<li>Why &#34;extreme statements&#34; in the answer choices are dead giveaways for wrong answers- find out how to detect the subtle differences between reasonable answers and the answers that are almost always wrong<li>Learn how to group your answer choices into &#34;families&#34; that often narrows down the pool of correct answers- this is a quick way to immediately eliminate one or two of the answer choices and increase your odds of getting the question right</ul>\", \"Now, you're probably wondering how and why we can do all the things we claim.\", 'Let us explain.', 'Before we go any further, let us clarify what <b><i>Praxis II Exam Secrets</i></b> is not. It is not a stale rehash of all of the things you have already learned in the past.', \"<b><i>Praxis II Exam Secrets</i></b> is our exclusive collection of the tips and the information that we have specially selected to give you the best results on the Praxis II test for the least time spent studying. It's written in everyday language and is easy to use.\", 'We cover the <b>5 essential skills</b> necessary to do well on the Praxis II test, plus a <b>comprehensive review</b> covering your specific Praxis II test.', \"<b>Don't take our word for it. Listen to what our customers say about other Mometrix test preparation products.</b>\", 'I purchased the Secrets file, and I just wanted to let you know that I got a 99% on my test. I just want to thank you again, and hope you have continued success in your ventures. Sincerely, Paul L.', \"My name is Chris. I used the Secrets study guide for five days. The study guide made the test so easy to understand. Like you said this program is worth 100's of dollars. To me 1,000's!! THANKS, Chris G.\", 'I just had to thank you guys for the test prep! I bought the guide as a last minute prep, I mean maybe 5 hours before the test. Like I said, I had ZERO preparation! I was nervous about the test let alone receiving the score I needed. I read the guide through only once before test time and needless to say, the only way I passed was thanks to your refresher!! Brian', 'Just dropping you a note to let you know that I am completely satisfied with the product. I had already taken the test once and landed in the 75 percentile of those taking it with me. I took the test a second time and used some of your tips and raised my score to the 97 percentile. Thanks for my much improved score. Denise W.', \"I heard about your website from a friend. I am enrolled in a review course, and in hindsight, I wish I wouldn't have taken my review course and instead spent a fraction of the money on your program. Thank you! Zac L.\", \"<b>You get at least 10 times your money's worth!</b> --When you consider what's at stake with the exam, we believe the value of our study guide gives you at least ten times your money's worth.\"]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1362441600000,
        "asin": "0892541415",
        "title": "Finding Success in the Horoscope: The Slevin System of Horoscope Analysis",
        "overall": 1,
        "reviewText": "There's one thing that I can't stand in astrology books:  tons and tons of example charts!  I consider it an extreme waste of time to read examples of historical figures that clearly don't apply to your unique case.  Where are the interpretations of MY aspects, MY planets, etc.?  I don't want a history lesson, Jackie.  I want to know how the aspects apply to ME.  That's why I purchase astrology books...to find out how I can apply astrological information so that it relates to me, my chart, and my own personal road to success.  Your book does not do that at all for me, and I am extremely disappointed.\n\nGranted, you seem to have come up with a very novel system with regard to career and finding success, but your execution of that system is way off the mark.  You outline your 12-step process, but the specifics of each step are not clearly explained anywhere in your book.  For example, Step 6 states:  \"Determine the aspects the Principal Planet makes.\"  Ok, fine. I have those. Step 3 states:  \"Note any planets in the 10th House.\"  Ok, I have no planets there...  Now where are the interpretations of these aspects and non-tenanted 10th House according to the Slevin System?  Nowhere to be found in this book, folks.\n\nHere's what I got out of this book:  My midheaven is Scorpio, Principal Planet is Saturn conjunct the midheaven by less than a degree.  The ruler of the Midheaven is Pluto, which is conjunct both Saturn and my Midheaven, so I have a \"beholding\" aspect that indicates that I'm a \"poster child for success\" and \"Fate will enable me to reach the top\" through an express elevator. I guess that's all I need to know then, right? Well, it's certainly not happening right now, which is why I bought your book so that it would guide me on the right path.  All I got was a jumbled mess with words and chart examples that are serving to blow my ship off-course.\n\nYour chart examples are beautifully written and all, but they do not encompass or explain each step of your system in its totality.  More cookbook-style interpretations are needed, and I mean \"cookbook\" not in the sense of one-line interpretations.  I'm referring to a more in-depth analysis of each planetary aspect as it relates to the Midheaven, possibly with each MC aspect taking up a paragraph or so in length. Perhaps an updated version of this book should be written with the interpretations at the end of the book?  I don't know, but your chart example style of delivery is very ineffective, and I really hate how a lot of astrology books out there are leaning towards that trend.  Instead of writing about historical figures (people who are now dead), why don't you try writing for the people who are currently alive and trying to find their way towards success?",
        "description": "['', 'An internationally published fulltime professional Astrologer, Jackie Slevin M.A., C.A, served as the codirector of the National Council for Geocosmic Research (NCGR) Education from 2000-2003 and is the founder and dean of the University of Geocosmic Studies, a distance learning program. She was the conference coordinator of NCGR Education Conferences in Hartford in 2001 and Minneapolis in 2003. A graduate of Classical Studies in Horary, she was a track coordinator at UAC 1995 and a member of the UAC 2002 Education Committee. She has served on the Board of New Jersey NCGR since 1983 and is currently a member of the NCGR Board of Examiners.', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1363132800000,
        "asin": "0738607746",
        "title": "Praxis II Biology 0235 w/CD-ROM (PRAXIS Teacher Certification Test Prep)",
        "overall": 3,
        "reviewText": "I used this study guide along with three other resources (a college-level biology textbook, Cliff's QuickReview of Biology, and Cliff's Biology StudySolver) to prepare for the Praxis II Biology: Content Knowledge exam.  My score:  186!  That qualifies me for the Recognition of Excellence award, too.  I attribute 95% of my success to the other sources I mentioned above and 5% to this study guide.\n\nThe problem with this book is that it doesn't cover most of the biology topics in enough depth.  For example, I saw questions on the different types of natural selection (stabilizing, diversifying, etc.) that this study guide never mentioned.  There were also plenty of genetics questions that had concepts and terminology that were not explicitly reviewed in this book.  Fortunately for me, I think I got one of the easier versions of the Praxis Biology exam, since a lot of the questions were like the simple ones found in the practice exams of this study guide.\n\nThe benefit of using this guide is that it gives a logical format to what the real Praxis test covers topic-wise.  However, like I said before, it doesn't cover all of the topics listed in the official ETS Biology topics outline.  Hence, greater depth is needed, which can only be found if you utilize the other three sources I mentioned.  In fact, you can probably just skip this study guide entirely and only use those 3 sources with the ETS topics outline as your guide, then just take notes on whatever you don't know.\n\nRegarding the practice exams on the CD, they are the same exact ones found in the book.  It would have been better if they were different.  Also, neither the paper-based nor computer-based versions tell you how well you might have done if it was a real Praxis test.  The authors don't provide any raw score/scaled score conversion charts.  I highly suggest that the authors revise this study guide to A) make it more current to the ETS topic guidelines, B) make the CD tests different from the paper-based tests, and C) develop accurate score conversion charts so you can predict how well you would do on the actual Praxis test.\n\nIf you use the sources I mentioned as your study prep material, you will have no problem passing the test!  I still can't believe I scored a 186!!!!  In fact, I did a double whammy:  I took the Biology CK test, and then the General Sciences CK test back to back in one testing session.  Coincidentally enough, I also got a 186 on the General Sciences test.  That's not only two passing scores, but TWO Recognition of Excellence awards as well.  I'm very, VERY fortunate and blessed that I can now embark on my overdue career change.",
        "description": "['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', 'Laurie A. Callihan is a doctoral candidate in Science Education at Florida State University with an expected graduation date of December 2010. She has a B.S. in Biology and extensive training in the natural sciences and teacher education. She is the author of several Biology test preparation books, including several books for REA, and has many years experience as a classroom teacher. She currently resides in Tallahassee, Florida.<br /><br /><br /><br />Rebekah Warner has been a Registered Nurse (RN) since May 2004, when she graduated from the nursing program at Roberts Wesleyan College in Rochester, New York, with a Baccalaureate of Science in Nursing (BSN).<br /><br />While in nursing school, Rebekah was inducted into Delta Sigma Tai, the Honor Society for Nurses. Rebekah became a member of the American Association of Critical Care Nurses (AACN) in 2005. Over her career as a Registered Nurse, Rebekah has worked in various nursing areas, including Medical, Surgical, Orthopedic and Progressive care.<br /><br />Since August of 2007, Rebekah and her family have been living in Colorado Springs, Colorado. She is currently working on a busy Medical/Cardiac floor of a Catholic hospital in the area. Prior to this book Rebekah authored other various works, including the <i>NCLEX-PN Flashcard Book</i> published by REA.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1363564800000,
        "asin": "091581160X",
        "title": "The Life You Were Born to Live: A Guide to Finding Your Life Purpose",
        "overall": 4,
        "reviewText": "Dan Millman's \"The Life You Were Born to Live\" is an excellent inspirational book for anyone seeking more meaning in their lives or discovering their true life purpose.  For me, it contains nothing that I haven't read before or intuitively know first-hand.  I really enjoy books like these because I always feel that sense of validation while reading the topics that specifically apply to me.  It's not that I'm actively looking for validation, mind you.  It's just comforting that even when you're not actively seeking any advice, you can read something that just resonates with you very strongly.\n\nGoing back to what I said about intuitively already knowing the material of this book, I'm not a newbie in the spiritual realm of things.  I have an advanced knowledge base in astrology, numerology, tarot, and other spiritually based disciplines.  My life path is a 36/9.  Everything stated in this book is very true for me, and the section on the Spiritual Laws that apply to each and every life path was very well written and well thought out by the author.\n\nIt also amazes me how 3's, 6's, and 9's factor very strongly in my life.  Those numbers make up my own personal Holy Trinity, so to speak.  In numerology, my life path is 9, destiny number is 3, and the day number of my birth adds up to 6.  Speaking of days of birth, every single member of my immediate family has their days adding up to either 3 or 6!  That fact I find really amazing.  Astrologically, my North Node is in my 6th House in Gemini.  Gemini is the 3rd sign of the zodiac.  My essential planets (Sun and Moon) are also placed in two of my Holy Trinity houses:  Moon in the 3rd, Sun on the cusp of the 9th.  So everything in my life revolves around the 3/6/9 dynamic.  I've struggled with career issues for the past 10 years of my life, and after studying these numbers intensely, I finally discovered that teaching is my way to fulfillment.\n\nNow, to change the subject to more practical matters here, you should all be shocked to find out that the contents of this book are already published online, freely viewable by all.  I can't list any specific websites here, but if you do a search on \"Dan Mittman\", you will find this whole book online.  The website has a Russian domain associated with it.  There are some typos throughout (i.e. like the author's name), but they seem to be intentionally done so that the website is not discoverable.  On the contrary, I thought it was rather easy to find since all I had to do was type in the title of the book into Google search!  Try that or \"Dan Mittman\" and you'll find it.\n\nI'm not sure if the website is a copyright violation or not.  My guess is that the author has absolutely no clue about it.  It's a Russian domain, so if it IS a violation of copyright, then the author would be embroiled in international law, which could be a real pain for him.  My heart goes out to Mr. Millman if he decides to pursue the Russians about this matter.  However, I think it is best that he leave it alone for his own sake.  Information of such a highly valued and inspirational nature as this SHOULD be freely available for the public to see, and I am delighted that I did not have to pay ten-plus dollars to view this information.  Being an 8 life path, Dan Millman may not agree with me here, but that's to be expected when it comes to money for those crazy 8's.  They lie on the money axis, so I wouldn't be a bit surprised that Dan Millman might be rather upset if he finds out that his entire book has been published online in Russia!\n\nOh well.  Again, I am grateful to have seen this entire book online, and I strongly suggest that everybody view it while it is still available!",
        "description": "['', 'Dan Millman presents an entirely new way of understanding life and the forces that shape it. The Life-Purpose System, a modern method of personal growth based on ancient wisdom, has helped thousands of people find new meaning, purpose, and direction in their lives. <i>The Life You Were Born to Live</i> features:<br /><br />', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1368316800000,
        "asin": "0140276238",
        "title": "The Undertaking: Life Studies from the Dismal Trade",
        "overall": 3,
        "reviewText": "Thomas Lynch's \"The Undertaking: Life Studies from the Dismal Trade\" left me rather puzzled and bewildered.  Just going by the title, I thought that this book would be about real-life accounts of the funeral trade.  Clearly, if you've read the book, it is not.\n\nYes, there are reminiscences of his experiences as a funeral director, but it wasn't what I was looking for.  I gleaned absolutely nothing from this book as far as the details of what the funeral industry is really like.  You see, Thomas Lynch is a poet, and a poet he should remain.  This book was chock-full of haughty, pretentious speech....exactly what constitutes poetry itself.  I've always had an extreme disdain for poetry just for that reason.  I find it brutishly snobby to the extreme.  Beautiful, you say?  I disagree.  It's arrogance displayed in the guise of beauty, and Lynch weaves this arrogant style in a longer form...the sentence.\n\nWhat's also misleading is the fact that this book is a MEMOIR.  On the upper left-hand corner of the back cover, in red capitalized type, is the word \"MEMOIR.\"  Amazon fails to state this fact in its product description, and it's worth telling the public about this.  If I can't stand poetry, you better believe that I can't stand a poetic memoir!\n\nRearranging the word, \"memoir\" becomes \"memori.\"  Literally, a person's memories of past experiences or of something that ceased to be, in a recorded format.  I never understood the logic behind writing your memoir if you aren't on your deathbed or finished something of a worthy nature, never to be performed again.  Thomas Lynch never quit his job as a funeral director, so why write a memoir about it?  It just doesn't make any sense to me.  You write a memoir once you know for sure that those memories are solidly in the past if it's to be a true reflection.  Otherwise, the same circumstances currently occurring would cloud your judgment and potentially warp the memories under reflection.\n\nPersonally, I can't believe that PBS filmed a documentary off this book (which I haven't seen, and I don't intend on seeing it).  One misleading memory has begotten another...\n\nIf you're looking for a book on the funeral industry, this isn't for you.  But if you like reading poetic memoirs, then pick this one up.",
        "description": "['', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1372377600000,
        "asin": "1402250835",
        "title": "Does This Mean You'll See Me Naked?: Field Notes from a Funeral Director",
        "overall": 5,
        "reviewText": "Robert D. Webster's \"Does This Mean You'll See Me Naked?\" is one of the best books out there about the funeral industry.  The author pulls a no holds barred approach in discussing exactly what goes on in today's funeral homes while mixing things up with his own laugh-out-loud anecdotes.\n\nI recently was considering going to mortuary science school to pursue a career as a funeral director.  However, this book helped to persuade me not to undertake (no pun intended) such an endeavor.  I really think that this book would dissuade someone from entering the funeral business.  I can't see how it would encourage anyone to become a funeral director.  Sure, I love studying death, and I was a previous Pathologist's Assistant, but the funeral industry is so political and conniving in nature that it's disgusting.  With the current (and ever-expanding) corporate takeover of the funeral business, it's best to just stay out of it entirely.  Although I would love the anatomical and paperwork-related parts of the business, I just can't see myself dealing with grieving people all the time and (most likely) working for a greedy company.\n\nI think the beauty of this book is the fact that it prepares people to make well-informed decisions when it comes time for their own funerals.  The author's down-to-earth, intelligent writing style really encourages you to prepare for your own under-the-earth future.  For this reason, Webster's book should be standard reading for everyone, and it's never too late to think about your own funeral!",
        "description": "['', '<b>Robert Webster </b>has been a licensed embalmer and funeral director in Ohio since 1977. He attended the Cincinnati College of Mortuary and opened the Webster Funeral Home in Fairfield, Ohio, in 2001.', '', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1380326400000,
        "asin": "0140088946",
        "title": "Less than Zero (Contemporary American Fiction)",
        "overall": 4,
        "reviewText": "As other reviewers have commented, you either love or hate this book. If I had to choose between the two, I love it. Anyone who gives a two-star review or lower just doesn't get it. There isn't supposed to be any particular plot line here. The author is painting a rather stark and realistic portrait of L.A. teenage life in the 1980s, no more and no less, and he does a very fine job of it. In fact, he goes beyond dealing with the nihilism of young adulthood in L.A. He provides fictionally realistic commentary on the film industry along with the mentality of kids (and their parents) coming from rich backgrounds. Keep in mind that there isn't supposed to be any logical storyline to the novel at all. That fact parallels the lack of depth consistent with the L.A. populace.\n\nAlthough I was only a toddler in the 80s, I have no doubt that the lifestyle(s) depicted in \"Less Than Zero\" is/are highly accurate for that decade. In fact, after having been to L.A. a few times in the past, I encountered subtle hints that this type of lifestyle was (and is) still rampant in that city. If I had a dime for every \"Clay the Cokehead\" characters that are currently in L.A., I would be a billionaire.",
        "description": "['Written when the author was 20, this first novel tells the story of Clay, a New Hampshire college student who returns home to Los Angeles for Christmas vacation. Vignettes show Clay and his friends aimlessly traveling from party to party, doing drugs, having sex with one another. PW noted that Ellis \"brilliantly conveys this crowd\\'s delirium as well as the lack of fulfillment they cannot remedy.\" <BR>Copyright 1986 Reed Business Information, Inc.']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1380326400000,
        "asin": "B000X70KLY",
        "title": "Less Than Zero.",
        "overall": 4,
        "reviewText": "As other reviewers have commented, you either love or hate this book. If I had to choose between the two, I love it. Anyone who gives a two-star review or lower just doesn't get it. There isn't supposed to be any particular plot line here. The author is painting a rather stark and realistic portrait of L.A. teenage life in the 1980s, no more and no less, and he does a very fine job of it. In fact, he goes beyond dealing with the nihilism of young adulthood in L.A. He provides fictionally realistic commentary on the film industry along with the mentality of kids (and their parents) coming from rich backgrounds. Keep in mind that there isn't supposed to be any logical storyline to the novel at all. That fact parallels the lack of depth consistent with the L.A. populace.\n\nAlthough I was only a toddler in the 80s, I have no doubt that the lifestyle(s) depicted in \"Less Than Zero\" is/are highly accurate for that decade. In fact, after having been to L.A. a few times in the past, I encountered subtle hints that this type of lifestyle was (and is) still rampant in that city. If I had a dime for every \"Clay the Cokehead\" characters that are currently in L.A., I would be a billionaire.",
        "description": "['Less Than Zero by Bret Easton Ellis. Vintage Books,1985']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1387756800000,
        "asin": "0132722992",
        "title": "Technology in the Law Office (3rd Edition)",
        "overall": 3,
        "reviewText": "I had to get this book for a Computer Applications for Law class in my paralegal program.  Already being technologically savvy, I really didn't need to take this course, but being how it counts towards one of the ten courses needed to get my certificate, I decided to take it for an easy A.\n\nMy major complaint with the book is the price and the lack of color photos.  The only color used in this book is blue for the chapter headings.  You would think that for the $100 this book costs new (as of 12/23/2013), they would fill up the pictures in color (especially the parts where they discuss software tutorials).  Other than that, the content of the book is OK at best.\n\nDo yourself a favor and buy it used.  If you pay the high price for it new, you're really shooting yourself in the foot.  After my semester ended, I sold this book back to Amazon for a $54 gift card, which isn't bad at all considering I paid $65 for it used.",
        "description": "['<P style=\"MARGIN: 0px\">In thisinnovative text,distinguished authors Donna Ogle and Jim Beers bring language arts to life for teachers through a focus on contemporary communication and visual literacy, coupled with varied genre and electronic resources. This book focuses on helping teachers ensure that students learn to use language to communicate with others effectively in our increasingly culturally and linguistically diverse society a nd to draw upon the greatest resource at their disposal to do this: the language power of their students themselves.</P> <P style=\"MARGIN: 0px\"></P> <P style=\"MARGIN: 0px\">Unlike any other book on the market, <I>Engaging in the Language Arts</I> offers readers a firsthand look at the language challenges teachers face in todays classrooms, how to identify language possibilities, and how to make optimal use of these possibilities in their own classrooms. </P> <P style=\"MARGIN: 0px\"></P> <P style=\"MARGIN: 0px\">The new second edition improves upon the well-lauded first edition in a number of ways, including:</P> <UL> <LI> <DIV style=\"MARGIN: 0px\"><B>Key Teaching Strategy with rubrics</B> appears in all of the instructional chapters and present an effective language arts strategy that can be used in the classroom with a corresponding rubric to help teachers evaluate their own success in teaching with the strategies. Examples include Language Experience, DR-TA, K-W-L, Shared Writing, and more.</DIV> <LI> <DIV style=\"MARGIN: 0px\"><B>The new common core standards being implemented across the US</B> are included and highlighted.</DIV> <LI> <DIV style=\"MARGIN: 0px\"><B>The newly revised NCTE/IRA standards are included</B> and referenced throughout the book.</DIV> <LI> <DIV style=\"MARGIN: 0px\"><B>Sections on <I>Children Who Struggle</I> </B>are included in all instructional chapters.</DIV> <LI> <DIV style=\"MARGIN: 0px\"><B>Exploring Technology boxes</B>, found in all chapters, include useful URLs that teachers can use in the classroom or to help them find meaningful content, or that they can use with student who struggle .</DIV> <LI> <DIV style=\"MARGIN: 0px\"><B>Marginal A+RISE</B><B> Teaching Strategies </B>align with relevant concepts in the main body of the text and give teachers in grades K-12 quick, research-based strategies to get to the how of targeting their instruction and making content accessible for all students, including English language learners. </DIV></LI></UL> <P style=\"MARGIN: 0px\"></P> <DIV sercontent> <P style=\"MARGIN: 0px\"><B>About the Authors</B></P> <P style=\"MARGIN: 0px\"><B>Donna Ogle </B>is Professor of Reading and Language at National-Louis University in Chicago, Illinois, and is actively involved in staff development projects work in the Chicago Public Schools, the Reading Leadership Institute, and in other American school districts. Dr. Ogle serves as a literacy consultant internationally, including Critical Thinking International and as a part of the editorial review boards of Lectura y Vida and the Thinking Classroom. She recently finished her term as president of the International Reading Association (IRA). Donna also conducts research on visual literacy and content comprehension, having developed both the K-W-L and PRC2 (partner reading in content, too). She is the author of many books, book chapters, and professional articles and conducts national and international workshops on teaching for comprehension and higher order thinking, as well as using the arts in teaching. Her K-W-L procedure has become so renowned that teachers use it all over the world.</P> <P style=\"MARGIN: 0px\"></P> <P style=\"MARGIN: 0px\"><B>James Beers</B> is Professor of Reading, Language, and Literacy in the School of Education at the College of William and Mary, Williamsburg, Virginia. He is also the Director of the Eastern Virginia Writing Project of the National Writing Project, which helps teachers help their students become better writers. He has a B.A. in Engl</div>', '\"Thomas F. Goldman\" is an attorney at law with a federal, state, and local practice. He graduated from Boston University with a major in Accounting and practiced accounting while pursuing a law degree from Temple University School of Law. He has lectured widely and has taught accounting, management, and paralegal courses. He is currently a Professor of Law and Management at Bucks County Community College, where he has been coordinator of Paralegal Studies.']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1388102400000,
        "asin": "0060915943",
        "title": "The Art of Loving",
        "overall": 4,
        "reviewText": "\"The Art of Loving\" is a masterful work by Erich Fromm. His broad-minded scope on the human condition is such a breath of fresh air, especially in today's society. I really enjoyed how he linked capitalism to the failure to love, which is extremely true. In fact, I would like to expound upon the notion that capitalism kills (and is currently killing) love.\n\nI've always been vehemently against polyamory and open relationships. After reading \"The Art of Loving,\" it suddenly dawned on me that those types of relationships are nothing but by-products of our capitalistic society. When you think about it, it makes total sense. If capitalism is all about the market economy and the accumulation of wealth/things/profit, then a similar analogy applies to the acquisition of multiple partners. I fully blame capitalism as the root for engaging in those types of relationship patterns. At the basic core of it all, your partner is simply not good enough for you because YOU have a pathological problem...\"more, more, more!\" Polyamory is like a dating attention deficit disorder. People engaging in that behavior have no sense of focus, concentration, and discipline (principles that Fromm described as requirements necessary in order to practice the art of loving). Scattering your energies too broadly like that are seriously detrimental to self-knowledge and to the capacity to fully love a human being. In addition, technology is just making it worse with all these online dating websites and apps. When you combine the effects of capitalism AND technology, you have a recipe for disaster on the love front. This is exactly why I have never been in a relationship at all thus far in my life (and I'm 30 years old).\n\nAside from all that, I gave the book 4 out of 5 stars (just shy of being perfect). Here's why:\n\n1) Quoting Fromm, \"It's not I need you because I love you...it's I love you because I need you.\"\n\nThis quote really got under my skin. You should not have to NEED anybody when you love someone. If love is an art, which requires knowledge and mastery of theory as well as practice (according to Fromm), then the act of loving is a CHOICE, as is who you love. Love is more of a desire (a WANT) than a need.\n\n2) Fromm made a parenthetical comment about homosexuality that REALLY upset me:\n\n\"The male-female polarity is also the basis for interpersonal creativity. This is obvious biologically in the fact that the union of sperm and ovum is the basis for the birth of a child. But in the purely psychic realm it is not different; in the love between man and woman, each of them is reborn. (The homosexual deviation is a failure to attain this polarized union, and thus the homosexual suffers from the pain of never-resolved separateness, a failure, however, which he shares with the average heterosexual who cannot love.)\"\n\nOK. Right off the bat, it's clear that Fromm's thinking of homosexuality was a product of the times (1950's). It really amazes me how such an intelligent, broad-minded thinker can be so narrow-minded on this topic. He really shot himself in the foot with this one, that's for sure.\n\nFirstly, it's not a deviation. Secondly, a polarized union is indeed attained among homosexuals if they're enlightened enough to realize it. Every male has both male and female energies ingrained into his being (just like every female). Because of this fact, it is VERY easy for two males to unite those polarities and achieve pure fusion. In fact, this is also related to the polarity of dominance and submission. Males are by nature dominant, while females are submissive (with exceptions. of course). Now, it is much easier to transition from dominant to submissive than it is to go from submissive to dominant (like it's easier to go from love to hate than hate to love....same polarity principle). That explains why there's such a greater preponderance of male homosexuality than female homosexuality in today's society. It really is a man's world, folks, and it's definitely not going to change in the foreseeable future.\n\nWith that said, male homosexual intercourse transcends the mere biological fusion of a sperm and egg to produce a child. The sex act itself is indeed polarized, with one partner adopting the penetrative (male) role while the other adopts the receptive (female) role. There's the male-female polarity superficially expressed, and superficially is where that type of polarity stays. Underneath it all, through the male-male sex act itself, is a much greater fusion occurring: fusion with The One, the well-spring of what each male is made of (masculinity, the Universal Substance, what-have-you). The insertive partner is drawing from the masculine Source of where he comes from and what he's made of (symbolically represented by the receptive partner). As a consequence of steady and rhythmic penetration, the insertive partner ultimately achieves orgasm inside his male mate. The ecstatic release achieved upon orgasm symbolizes a \"giving back\" to that well-spring of masculinity/The Source. Male homosexual intercourse is truly the most divine aspect of love anyone can achieve in this lifetime. It's both a shared give-and-take situation as well as an act of divine fusion.\n\nWhen it comes to homosexuality, Fromm really should have taken a few pages out of Plato's \"Symposium,\" which is by far my favorite work about the subject of love ever created. Aside from that major hiccup he made above, Fromm really hit home about the nature of love and the art of loving. This book should be required reading for every human being, especially those in the Western world.",
        "description": "['\"Erich Fromm is both a psychologist of penetration and a writer of ability. His book is one of dignity and candor, of practicality and precision.\" -- <i><i>--Chicago Tribune</i></i>', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1410998400000,
        "asin": "0007494416",
        "title": "Dataclysm: Who We are (When We Think No One's Looking)",
        "overall": 1,
        "reviewText": "Mr. Rudder's book is a compilation of some very interesting data and extrapolatory analyses, but that's as far as it gets.  The main point worth noting here is that you do not know if the data being analyzed for each specific individual can actually hold any truth to what their personality is like, how intelligent they are, etc.  How people portray themselves online can (and, in many respects, does) definitely contradict with how they are in real life.  Do you know how many times I've encountered hate speech from certain people online whom would not dare say such a thing to someone's face?  I don't even have enough fingers and toes to count exactly how many I personally know that are like that!  So unless Mr. Rudder individually met each person, performed a character analysis, what-have-you, his research analyses are moot.\n\nSpeaking of Mr. Rudder, please note that he's the co-founder of OKCupid, a very popular dating website.  He represents THE PROBLEM.....and the problem is that dating websites, apps, hookup sites, etc. are doing more harm than good to relationships and how people communicate with one another.  The ease of access with which these websites provide us can lead to jealousy, anger, cheating, and a whole host of \"dating A.D.D.\" issues.  Online dating sites, such as OKCupid, are slowly but surely eroding any sense of decency and etiquette left in the human race.  Frankly, what begins online, stays (or ends) online.  Stop looking for love because it will find you!  That's the best way to go about it.  The manner of initial contact is all important.\n\nBut I digress....  To sum it up for the book, don't waste your time and mental energy reading any single letter of it.  That is all.",
        "description": "['Dataclysm, an unprecedented deluge of digital information reshaping our view of the world. Christian Rudder maps and charts this data from out online wanderings resulting in a new way of looking at human behavior.']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1411776000000,
        "asin": "0980178258",
        "title": "PowerScore LSAT Logical Reasoning Bible",
        "overall": 1,
        "reviewText": "It's true.  This test has to GO, and all the test prep books and courses that go along with it.  Never in my life has a standardized test frustrated me so much as the LSAT.  And this comes from someone who has a 3.97 GPA in an undergraduate medical science program (science = great background for law, since the scientific method is all about deductive reasoning and investigation), as well as a (get this...) 3.97 GPA in an ABA-approved paralegal program.\n\nNow you tell me.....what on Earth is wrong here?  Could it be me?  I'll tell you what's wrong.  The LSAT is created by LSAC, the Law School Admission Council, who (on occasion) employs freelance writers (purportedly philosophy Ph. Ds) to draft the questions.  From what I heard, LSAC itself might also directly write these questions.  I'd love to know exactly how many people are involved with writing these horrendous LSAT questions.  A handful?  Two handfuls?  Gotta be 25 people or less, I'd imagine.  If that's the case, then it's a very small minority of people.  They can be equated to the 1% of the population in the United States who basically control the country (\"the corporate 1%\").  Are you really going to tell me that we have to abide by THEIR logic and THEIR line of reasoning???\n\nI'm sorry, but as I went through half of this book, I found myself getting an alarming number of questions incorrect.  And when I went to review some of the answer explanations, I just couldn't fathom why they reasoned the way they did.  It just didn't make sense to me.  Meanwhile, I still stick to my gut that my answer was correct.  Here's an example problem that caused me to throw in the towel on the LSAT.  I call it the infamous \"Diamond Question\":\n\n\"Advertisement:  At most jewelry stores, the person assessing the diamond is the person selling it so you can see why an assessor might say that a diamond is of higher quality than it really is.  But because all diamonds sold at Gem World are certified in writing, you're assured of a fair price when purchasing a diamond from Gem World.\"\n\nThe question asks you to pick the answer that most strengthens the argument.  I was torn between two:  \"B\" (The certifications of diamonds at Gem World are written by people with years of experience in appraising gems.) or \"E\" (The written certifications of diamonds at Gem World are provided by an independent company of gem specialists.).  I chose B.  The correct answer, according to PowerScore, is E.\n\nNow how can that be?  The book asserts that this question is about an \"accountability\" issue, whereby the person assessing the diamond has a personal stake in the outcome.  Therefore, the independent company of gem specialists is correct because they COULD be an \"outside\" company.  But hold on a second....does \"independent\" necessarily mean \"third party\"?  They could be an independent branch within Gem World for all we know.  In addition, \"people with years of experience in appraising gems\" and \"independent company of gem specialists\" could mean the same thing.  Another point: do the gem specialists really know what the fair price of diamonds is?  We don't know what aspect of gems they could be specializing in!  The conclusion of the argument above mentions written certifications AND pricing.  Answer B directly relates to the price element in the conclusion and ensures that those people with years of experience are confident in appraising them.  Therefore, answer B strengthens the argument.\n\nI've experienced questions like these scattered throughout the book, and my wheels start spinning endlessly when I find out that I'm incorrect, only to further discover that the explanations given for the correct answers are illogical to me.  You heard of ESP (extrasensory perception)?  Well, I have ERP:  extra-rational perception.  I can see hidden connections between ideas, concepts, and elements where most people are oblivious to them.  Again, I must repeat that the LSAT questions are biased according to the test makers line of reasoning.  Science has taught me to constantly question everything, and I proudly call into question what they (the test makers...the 1%) believe to be logical, rational, true, and/or valid.\n\nWith all that said, the LSAT really needs to be abolished.  As of this writing, the ABA held a meeting in August of this year to decide on whether the LSAT should be an absolute requirement for law school admissions.  From what I read, law schools might be able to admit up to 10% of their entering students without having taken the LSAT (provided that they have a certain GPA, apply to the same school as their undergrad program, and/or other requirements).  That's a much better route to take than have to be subject to this horrendous examination!\n\nUntil that stipulation goes into full effect, I just will not take the LSAT, and I therefore cannot apply to law school.  Period.  I'll take a legal assistant or paralegal position any day than have to go through that demeaning exam.",
        "description": "[\"The Logical Reasoning Bible helped me have the 'epiphany' I needed to conquer those sections of the LSAT, which ultimately enabled me to feel relaxed on test day. I recommend this book to EVERYONE who is preparing for the LSAT. --C. Kelleher<br /><br />The Logical Reasoning Bible has definitely changed my whole perception of the test and the questions. --M. Toomer<br /><br />If you are going to take the LSAT, and you plan on studying on your own without taking a course, you MUST, MUST, MUST purchase the PowerScore LSAT Logic Games Bible and the PowerScore LSAT Logical Reasoning Bible. Save yourself hundreds of dollars by NOT purchasing any study guides from Kaplan, Barron's, Princeton Review, etc. Save yourself time by getting these PowerScore books as soon as possible. You'll be glad you did, and you'll notice a big improvement on your LSAT abilities. --William Nones<br /><br />The Logical Reasoning Bible made things so much clearer to me, and I'm so much more confident now because I worked through the book. When I practice on LR sections now, I actually understand the questions and the types of correct and incorrect answers. I hear the statements from the LR Bible in the back of my head, and I'm like 'Oh yeah, I remember this point, and I saw this in that example problem in the book....' It's made things a lot more predictable, almost like clockwork. It makes sense now. --Carrie Gray\", \"Dave Killoran, a graduate of Duke University, is an expert in test preparation with over 20 years of teaching experience and a 99th percentile score on a Law Services-administered LSAT. In addition to having written PowerScore's legendary LSAT Bible Series, and many other popular publications, Dave has overseen the preparation of thousands of students and founded two national LSAT preparation companies.\"]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1415750400000,
        "asin": "0091900212",
        "title": "Think and Grow Rich",
        "overall": 4,
        "reviewText": "\"Fifty years ago, an old country doctor drove to town, hitched his horse, quietly slipped into a drug store by the back door, and began 'dickering' with the young drug clerk.\"\n\nNow, when you read sentence like this, you know you have a great book on your hands!  Slipping into back doors and \"dickering\"...that's the way you think and GROW rich!  All kidding aside, the book is very well written.  Nothing that I didn't already know about the laws of the Universe though.  I'm no rich person by any means, and my education has been thwarted for the past 8 years.  But after reading this book, I now have renewed determination to make things right again, and I am on my way to completing all my prerequisite courses so that I can apply to medical school.\n\nI had to take off one star for 3 reasons:  1) the author seems to be a staunch capitalist (making the object of your desire purely money, whereas this book is actually helpful for obtaining any object of your desire, not just money).  If you're not careful, you could potentially fall into the clutches of extreme avarice.  2)  He doesn't explain specifically how to formulate your own burning desire.  That would be helpful for people who have absolutely no clue what to do with their lives.  He clearly tells you what to do with that burning desire, but not how you can pinpoint the exact desire.  And lastly, 3) The author states that \"Man's greatest motivating force is his desire to please woman!\"  WRONG!  Not in this day and age, folks!  How do you account for gay men and lesbians?  The author clearly leaves them out of the picture, although he acknowledges Oscar Wilde and William Shakespeare as great examples of people who achieved success through the transmutation of sex.  Sexual desire period, for man or woman, when used for higher aims other than physical sex can lead to marvels of creation and achievement.  That's the point the author should be making, rather than adopting such a closed-minded man-woman view.\n\nOh, and you know how he constantly mentions how an idea can develop itself into something physical and real in the world?  Well, take a look at tarot cards when you get a chance.  The Magician card clearly encapsulates that exact principle.  Napoleon Hill is really describing magic in action.  The Fool symbolizes the burning desire (impulse), the Magician symbolizes the transmutation of the desire into something real, the High Priestess is all about the imagination and faith component, and then the Empress is the fruit of your desire made real (abundance, fertility).  Really, if you just look at those 4 tarot cards and meditate on them every day, you'll discover that the contents of this book is found within those 4 cards.\n\nIs your mind blown yet?  Mine is  :)",
        "description": "['BRAND NEW, Exactly same ISBN as listed, Please double check ISBN carefully before ordering.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1416009600000,
        "asin": "0030225086",
        "title": "College Physics, Vol. 2",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  I kid you not....  This textbook, for example, costs just as much as one college credit at a state school somewhere in the United States.  That's a fact.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['The main objectives of this introductory physics book are twofold: to provide the student with a clear and logical presentation of the basic concepts and principles of physics, and to strengthen an understanding of the concepts and principles through a broad range of interesting applications to the real world. In order to meet these objectives, emphasis is placed on sound physical arguments and discussions of everyday experiences and observations. At the same time, we motivate the student through practical examples that demonstrate the role of physics in other disciplines. The sixth edition features new pedagogy in keeping with the findings in physics education research. The rich new pedagogy has been integrated within the framework of an established and reliable text, facilitating its use by instructors.The full COLLEGE PHYSICS text, which covers the standard topics in classical physics and 20th century physics, is divided into six parts. COLLEGE PHYSICS, VOLUME 2 covers three of those six parts, including electricity and magnetism (Part IV); properties of light and the field of geometric and wave optics (Part V); and an introduction to special relativity, quantum physics, and atomic and nuclear physics (Part VI).', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1416009600000,
        "asin": "0840054440",
        "title": "Organic Chemistry",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  I kid you not....  This textbook, for example, costs just as much as one college credit at a state school somewhere in the United States.  That's a fact.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['', '<i>From the Publisher</i>', \"The most trusted and best-selling text for organic chemistry just got better! Updated with the latest developments, expanded with more end-of-chapter problems, and reorganized to cover stereochemistry earlier, the leading online homework and learning system for chemistry, John McMurry's <i>Organic Chemistry</i> continues to set the standard for the course. The eighth edition also retains McMurry's hallmark qualities: comprehensive, authoritative, and clear. McMurry has developed a reputation for crafting precise and accessible texts that speak to the needs of instructors and students. More than a million students worldwide from a full range of universities have mastered organic chemistry through his trademark style, while instructors at hundreds of colleges and universities have praised his approach time and time again.\", '<a href=\"http://www.amazon.com/Student-Solutions-McMurrys-Organic-Chemistry/dp/0840054459\" target=\"_blank\">Study Guide with Student Solutions Manual for McMurry\\'s Organic Chemistry, Eighth Edition</a>', '<a href=\"http://www.amazon.com/Small-Approach-Organic-Laboratory-Techniques/dp/1439049327\" target=\"_blank\">A Small Scale Approach to Organic Laboratory Techniques, Third Edition</a>', '<a href=\"http://www.amazon.com/Experimental-Organic-Chemistry-Microscale-Laboratory/dp/1439049149\" target=\"_blank\">Experimental Organic Chemistry: A Miniscale and Microscale Approach, Fifth Edition</a>', '', '\"I believe the text\\'s main strength is its strong connection to biology, biochemistry and pharmaceutical chemistry and that this is a direction I would like to move our course. Also, establishing relevance to the world of student\\'s is crucial and this text does a very good job in this area.\" - Stephen Godleski, The College at Brockport, SUNY<br /><br />\"McMurry is very clearly organized. Students find it readable, which is a remarkable accomplishment. The McMurry text has excellent problems and connects well to students interested in the biochemical and medicinal applications of organic chemistry. Although different from most other texts on the market, the introduction of alkene and alkyne reactions prior to substitution/elimination reactions is easily manageable, and in fact simpler, thus providing a smooth entry into organic reactions for new students. McMurry has excellent spectra and makes good use of color. Theelectrostatic potential maps are helpful at times.\"- Ernest G. Nolen, Colgage University', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1417046400000,
        "asin": "0136867588",
        "title": "Power of Positive Thinking for Young People",
        "overall": 2,
        "reviewText": "I understand the message that Norm is trying to put through in this book, but I just wish he wouldn't keep including the Bible in every chapter.  I mean, it figures he would do this because he's the son of a preacher, but he really should appeal to a more diverse audience rather than try to slam Bible verses down your throat.",
        "description": "['\\'Trust yourself. You cannot be successful or happy without confidence in your own powers and abilities. To succeed you need self-confidence ...this book will help you to believe in yourself and release your inner powers\\' - Norman Vincent Peale in chapter 1. Be who you want to be - and get the life you want to live. This book is a carefully adapted version of \"The Power of Positive Thinking\", one of the most inspiring bestsellers of all time. It aims to help young people to use the power of positive thinking to build successful lives. Dr Peale gets right to the heart of the most common problems faced by teenagers, and offers a series of practical steps for solving them. He provides young people with the positive approach needed to achieve the major goals in life, showing them how to maximise their talent and energies, to give them confidence when they need it most.', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1417046400000,
        "asin": "0716743396",
        "title": "Lehninger Principles of Biochemistry",
        "overall": 5,
        "reviewText": "Yes, folks!  The 5th edition of Lehninger's \"Principles of Biochemistry\" can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  I kid you not....  This textbook, for example, costs just as much as one college credit at a state school somewhere in the United States.  That's a fact.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "[]",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "0323266169",
        "title": "Robbins and Cotran Pathologic Basis of Disease Professional Edition (Robbins Pathology)",
        "overall": 5,
        "reviewText": "Yes, folks!  This exact edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['', '\"This book is even shorter than before. That isreally impressive. I cannot but admire this book, which I keep re-reading since I enteredPathology in 1966. Wow,it shows that even a first classbook can be improved  hard to believe but true.It is very readable and even funny in some places. The text is nicely laid out and the book looks less bulky than the previous edition. The illustrations are excellent. Even though the book is definitely for the new generations, I am sure that it will be welcomed by senior pathologists trying to keep up with the times  I doubt that I am theonly old timer eager tore-read it.\" - <i>Ivan Damjanov, MD, PhD, author of Pathology Secrets and Pathophysiology</i>', '\"Pathologic Basis of Disease continues to be the most appropriate text for all students of pathology, be they in medical or health curricula, studying medical sciences in the context of another field such as engineering or business, and for professionals requiring a rapid reference to common pathologic conditions and pathways. Anyone who interfaces with human illness should have a copy of this book.\" - <b><i>Michael A. Seidman, M.D., Ph.D.Department of Pathology, Brigham &amp; Womens Hospital, Boston, MA</i></b>', '', 'Vinay Kumar, MBBS, MD, FRCPath, Alice Hogge and Arthur A. Baer Distinguished Service Professor of Pathology, Biological Sciences Division and The Pritzker Medical School, University of Chicago, Chicago, Illinois', '', '']",
        "domain": "Books"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1418428800000,
        "asin": "1455748765",
        "title": "Robbins and Cotran Atlas of Pathology (Robbins Pathology)",
        "overall": 5,
        "reviewText": "Yes, folks!  The 2nd edition can be found floating around the Internet somewhere in the form of a free torrent file.  Every time a new college semester is breathing down my neck, the mere thought of buying textbooks fills me with a sense of impending doom.  Do you realize just how much college textbooks cost?  One textbook can easily cost just as much as the tuition of one college credit!  It's true.\n\nAnd because of that fact, it is apparent that the publishers of college textbooks are out to rape the (already empty) pockets of our poor students.  These publishers churn out edition after edition every 2 to 3 years just to capitalize on and pillage the future generations of our society, and this has to STOP!  Do we really need more editions of a textbook that portray the same basic, underlying theories and information but with differently arranged pictures, colors, and verbiage?  NO!  I am very proud and fortunate to have located a free torrent file of this textbook on the vast computerized sea called the Internet, and I encourage you all to conduct your own online research and do the same.\n\nKnowledge is power.....especially when it's free!",
        "description": "['', '<i>\"The vast majority of the photos are of excellent quality, and the few lines of description next to the pictures provide a high-yield summary of what you need to know about the basic histological features of the disease. The pairing of the book with website resources is a distinct advantage for users.\"</i>', '- Feras Ally, MD (University of Kansas Medical Center) for Doodys Review Service', '', '', '']",
        "domain": "Books"
    }
]