[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1332201600000,
        "asin": "B001FB55KI",
        "title": "Milk",
        "overall": 5,
        "reviewText": "\"Milk\" is one of those films that EVERY single human being should see.  The civil rights messages it clearly gets across are astoundingly powerful.  This isn't JUST a film about gay rights; it goes way beyond that sub-stratum of human society to include the basic, fundamental, inalienable rights endemic to the entire human race as a whole.\n\nThe only minor gripe I have about this film, which doesn't detract from my stellar 5-star rating, is the fact that it's rated R.  I think if they toned down the language a bit by getting rid of the F words, and also deleting the celebratory fellatio scene between the two campaign aides, I think this film would be even more accessible to the public.  I would have then recommended that everybody aged 10 and up should watch this.\n\nAs far as the acting is concerned, Sean Penn is brilliant.  Now I'm not normally a fan of Sean Penn at all.  In fact, I find him personally crude and a major sleazeball.  In this film, however, he deserved that Best Actor Academy Award...and then some.  His accurate portrayal of Harvey Milk is spot-on...right down to the looks!!  His resemblance to Harvey is strikingly eerie, and Penn seamlessly blends right into that role like it's his true nature.  Brilliant acting.  And who knows...maybe the fact that Harvey Milk looked like a sleazeball is exactly what made Sean Penn perfect for this role!  (I mean no offense to either men at all.)\n\nThe other actors also did a superb job.  James Franco (another actor I personally can't stand) played a great supporting role as Harvey's lover.  Josh Brolin was also great as Dan White.  The director, Gus van Sant, also put in a few cameo appearances of Harvey Milk's actual staff members!  That was a nice treat, as Ms. Silver is a very dear friend of mine.\n\nOut of all the movies out there about human rights, this one is the BEST.  Personally, Harvey Milk is one of the most underrated civil rights figures in American history.  He even outweighs Martin Luther King, Jr.  Yes, I firmly believe that.  Just as MLK, Jr. was mostly for blacks and their civil rights, Harvey takes it one step further: He's both a model for gay AND white civil rights!\n\nIf anybody asks me who my favorite civil rights activist and hero of all time is, I will proudly say, HARVEY MILK!",
        "description": "['His life changed history. His courage changed lives. Academy Award winner Sean Penn stars in this stirring celebration of Harvey Milk, a true man of the people. Based on the inspiring true story of the first openly gay man elected to major public office, this compelling film follows Milks powerful journey to inspire hope for equal rights during one of the least tolerant times in our nations history. With a stunning all-star cast, including Josh Brolin, Emile Hirsh, Diego Luna and James Franco, its the emotionally charged story that was proclaimed the Winner of The New York Film Critics Circle Best Picture Award!', \"When a famous person, like the nation's first openly gay male city supervisor, inspires an acclaimed book (<em>The Mayor of Castro Stree</em>t) and Oscar-winning documentary (<em>The Times of Harvey Milk</em>), a biopic can seem superfluous at best. Taking over from Oliver Stone and Bryan Singer, Gus Van Sant, whose previous picture was the more experimental <em>Paranoid Park</em>, directs with such grace, he renders the concern moot. Unlike Randy Shilts' biography, which begins at the beginning, Dustin Lance Black's script starts in 1972, just as Milk (Sean Penn, in a finely-wrought performance) and his boyfriend, Scott (James Franco, equally good), move from New York to San Francisco. Milk opens a camera shop on the Castro that becomes a safe haven for victims of discrimination, convincing him to enter politics. With each race he runs, Harvey's relationship with Scott unravels further. Finally, he wins, and the real battle begins as Milk takes on Proposition 6, which denies equal rights to homosexuals. He does what he can to rally politicians, like George Moscone (Victor Garber) and Dan White (Josh Brolin). While the mayor is willing, the conservative board member has reservations, and after Milk fails to back one of White&rsquo;s pet projects, the die is cast, leading to the murder of two beloved figures. If Van Sant&rsquo;s film captures Harvey in all his complexities (he was, for instance, a very funny man), <em>Milk</em> also serves as an enticement to grass-roots activism, showing how one regular guy elevated everyone around him, notably Cleve Jones (Emile Hirsch), the ex-street hustler who created the NAMES Project AIDS Memorial. Released in the wake of Proposition 8, California&rsquo;s anti-gay marriage amendment, <em>Milk</em> is inspirational in the best way: one person can and did make a difference, but the struggle is far from over. --<em>Kathleen C. Fennessy</em> <br /><br />\", '', '<span class=\"h1\"><strong>Get to Know the Cast From <em>Milk</em> </strong></span> <table border=\"0\" cellpadding=\"4\" cellspacing=\"4\" width=\"100%\"> <tbody> <tr align=\"center\" class=\"tiny\" valign=\"top\"> <td width=\"33%\"><a href=\"../s/ref=nb_ss_d?url=search-alias%3Ddvd&amp;field-keywords=kristen+bell&amp;x=0&amp;y=0\"> </a><br /><a href=\"http://www.amazon.com/b/ref=amb_link_0?ie=UTF8&amp;node=441142\" target=\"_blank\"><img height=\"185\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/Universal/Milk/Penn.jpg\" width=\"200\" /></a><br /><strong>Sean Penn (Harvey Milk)</strong><br /></td> <td width=\"33%\"><a href=\"../s/ref=nb_ss_d?url=search-alias%3Ddvd&amp;field-keywords=Jason+Segel&amp;x=0&amp;y=0\"> </a><br /><a href=\"http://www.amazon.com/b/ref=amb_link_0?ie=UTF8&amp;node=414470\" target=\"_blank\"><img height=\"185\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/Universal/Milk/Brolin.jpg\" width=\"200\" /></a><br /><strong>Josh Brolin (Dan White)</strong><br /></td> <td width=\"33%\"><a href=\"../s/ref=nb_ss_gw?url=search-alias%3Ddvd&amp;field-keywords=Mila+Kunis&amp;x=22&amp;y=15\"> </a><br /><a href=\"http://www.amazon.com/s/ref=nb_ss_d?url=search-alias%3Ddvd&amp;field-keywords=james+franco&amp;x=0&amp;y=0\" target=\"_blank\"><img height=\"185\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/dvd/Universal/Milk/franco.jpg\" width=\"200\" /></a><br /><strong>James Franco (Scott Smith)</strong><br /></td> </tr> </tbody> </table> <br /> <br />', '<span class=\"h1\"><strong>Beyond <em>Milk</em> on Blu-ray</strong></span> <table border=\"0\" cellpadding=\"4\" cellspacing=\"4\" style=\"height: 176px;\" width=\"989\"> <tbody> <tr align=\"center\" class=\"tiny\" valign=\"top\"> <td width=\"33%\"><a href=\"http://www.amazon.com/Milk-Sean-Penn/dp/B001QUF3SW\" target=\"_blank\"> <img height=\"115\" src=\"https://images-na.ssl-images-amazon.com/images/I/51SC9HMdNAL._SL160_AA115_.jpg\" width=\"115\" /><br /></a><br /><a href=\"http://www.amazon.com/Milk-Sean-Penn/dp/B001QUF3SW\" target=\"_blank\">Get in on DVD</a><br /></td> <td width=\"33%\"><a href=\"../dp/B001C0JCBK\"> </a><a href=\"http://www.amazon.com/Focus-Features-DVD-Movies/b/ref=amb_link_4545332_93?ie=UTF8&amp;node=350735011\" target=\"_blank\"><img height=\"115\" src=\"https://images-na.ssl-images-amazon.com/images/I/51E6hMWnVFL._SL160_AA115_.jpg\" width=\"115\" /></a><a href=\"../dp/B001C0JCBK\"><br /></a><br /><a href=\"http://www.amazon.com/Focus-Features-DVD-Movies/b/ref=amb_link_4545332_93?ie=UTF8&amp;node=350735011\" target=\"_blank\">More from Focus Features</a><br /></td> <td width=\"33%\"><a href=\"../b/ref=amb_link_21?ie=UTF8&amp;node=163375\"> </a><a href=\"http://www.amazon.com/gp/feature.html/ref=amb_link_83561451_4?ie=UTF8&amp;docId=1000267651\" target=\"_blank\"><img height=\"115\" src=\"https://images-na.ssl-images-amazon.com/images/I/51DQCQEN6NL._SL160_AA115_.jpg\" width=\"115\" /></a><br /><br /><a href=\"http://www.amazon.com/gp/feature.html/ref=amb_link_83561451_4?ie=UTF8&amp;docId=1000267651\" target=\"_blank\">Shop More Oscar Nominees &amp; Winners<br /></a></td> </tr> </tbody> </table>', '<br /><span class=\"h1\"><strong>Stills from <em>Milk </em>(Click for larger image)</strong></span> <table border=\"0\" cellpadding=\"4\" cellspacing=\"4\" width=\"100%\">', '', '', '', '', '', '', '']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1332720000000,
        "asin": "B002SVP9GO",
        "title": " Dorian Gray [Blu-ray]",
        "overall": 5,
        "reviewText": "Dorian Gray is an EXCELLENT film inspired by an even more excellent novel.  Don't believe any of the other one-star reviewers on here when they say that this movie isn't derived from Oscar Wilde's magnum opus.  They're just being unnecessarily picayune.  Even Wilde himself would be proud of this wonderful film!\n\nBen Barnes does a fantastic job as Dorian, and Colin Firth as Henry Wotton is Dorian's perfect foil. In any role he plays, Firth never ceases to amaze me!  Too bad this film was never released in American theatres (only in the UK).  It's such a gem!\n\nAs far as the Blu-ray goes, the sound is crystal-clear and the picture is beautifully done in 1080p high definition format.\n\nThe only thing missing from this film (which does not detract from my 5-star rating) is my favorite quote from the book:  \"In her dealings with man, Destiny never closed her accounts.\"  CLASSIC",
        "description": "['Audio: English 5.1 dtr HD Sub-titles: English for the Hard of Hearing.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1340236800000,
        "asin": "B001AVCFJM",
        "title": "Star Trek",
        "overall": 1,
        "reviewText": "*SPOILERS AHEAD!*\n\nSimply put, this is the worst Star Trek film to come out in recent history.  It makes Star Trek: Insurrection look like an Oscar winner!  The only thing going for this movie is a great cast of actors.  They played the parts extremely well (mega props to Zachary Quinto for playing a spot-on Spock).  However, the story and plot lines as a whole are just awful and bring complete disgrace to the Star Trek canon.\n\nFor one thing, the villain (Nero) was just awful.  That is NOT how a Romulan is supposed to act!  He acts way too human to be a Romulan.  The fact that both Romulus AND Vulcan were destroyed completely upsets the Star Trek canon forever.  That was an AWFUL move for the writers to make, and frankly, if Gene Roddenberry was alive during the making of this film, he would have made sure that it never got past the screenplay stage.  One look at the script, and he would have lit it on fire.\n\nAnother thing:  Spock and Uhura have a love tryst going on?  BLECH!  That's just downright awful.  Winona Ryder playing Spock's mother, Amanda?  Another bad call.  The fact that she was murdered?  Again, ANOTHER bad call.  Also, when Spock ejected Kirk onto the ice planet, what were the chances of him finding the elder Spock there also?  C'mon!  It's too much of a coincidence, and that's another display of terrible writing.  Lastly, how DARE they even use the original theme in the end credits!  Shame on them!\n\nI honestly don't know how they can even consider making a sequel to this decrepit film.  It's clearly a slap in the face to all that Star Trek is known for.  I'll make a bet that Leonard Nimoy stopped attending Star Trek conventions because he received too much flack for contributing to the destruction of the Star Trek canon in this film.  Pass this one up, folks, and stick with all the movies that came before it.  I feel so sorry for today's generation of youth.",
        "description": "[\"The incredible story of a young crew's maiden voyage on board the most advanced starship ever created: The USS Enterprise. In the midst of an incredible journey full of optimism, intrigue, comedy and cosmic peril, the new recruits must find a way to stop an evil being whose mission of vengeance threatens all of mankind.\", '<br />J.J. Abrams\\' 2009 feature film was billed as \"not your father\\'s <em>Star Trek</em>,\" but your father will probably love it anyway. And what\\'s not to love? It has enough action, emotional impact, humor, and sheer fun for any moviegoer, and Trekkers will enjoy plenty of insider references and a cast that seems ideally suited to portray the characters we know they\\'ll become later. Both a prequel and a reboot, <em>Star Trek</em> introduces us to James T. Kirk (Chris Pine of <em>The Princess Diaries 2</em>), a sharp but aimless young man who\\'s prodded by a Starfleet captain, Christopher Pike (Bruce Greenwood), to enlist and make a difference. At the Academy, Kirk runs afoul of a Vulcan commander named Spock (Zachary Quinto of <em>Heroes</em>), but their conflict has to take a back seat when Starfleet, including its new ship, the <em>Enterprise</em>, has to answer an emergency call from Vulcan. What follows is a stirring tale of genocide and revenge launched by a Romulan (Eric Bana) with a particular interest in Spock, and we get to see the familiar crew come together, including McCoy (Karl Urban), Uhura (Zoe Saldana), Sulu (John Cho), Chekhov (Anton Yelchin), and Scottie (Simon Pegg).', 'The action and visuals make for a spectacular Big-Screen Movie, though the plot by Abrams and his writers, Roberto Orci and Alex Kurtzman (who worked together on <em>Transformers</em> and with Abrams on <em>Alias</em> and <em>Mission Impossible III</em>), and his producers (fellow <em>Lost</em>ies Damon Lindeloff and Bryan Burk) can be a bit of a mind-bender (no surprise there for <em>Lost</em> fans). Hardcore fans with a bone to pick may find faults, but resistance is futile when you can watch Kirk take on the <em>Kobayashi Maru</em> scenario or hear McCoy bark, \"Damnit, man, I\\'m a doctor, not a physicist!\" An appearance by Leonard Nimoy and hearing the late Majel Barrett Roddenberry as the voice of the computer simply sweeten the pot. Now comes the hard part: waiting for some sequels to this terrific prequel. <em>--David Horiuchi</em>', '<ul><li>CommentaryBy director J.J. Abrams, writers Robert Orci and Alex Kurtzman, producer Damon Lindelof and executive producer Bryan Burk. <li>A New Vision J.J. Abrams vision was not only to create a Star Trek that was a bigger, more action-packed spectacle but also to make the spectacle feel real. Every aspect of productionfrom unique locations to the use of classic Hollywood camera trickswas guided by this overall objective. <li>Gag ReelBloopers featuring the entire principal cast.</ul> Disc 2:', '<ul><li>Digital Copy (Expires November 17, 2011) <li>Deleted Scenes with Optional Commentary <ul><li>Spock Birth <li>Klingons Take Over Narada <li>Young Kirk, Johnny and Uncle Frank <li>Amanda and Sarek Argue After Spock Fights <li>Prison Interrogation and Breakout <li>Sarek Gets Amanda <li>Dorm Room and Kobayashi Maru (original version) <li>Kirk Apologizes to the Green Girl <li>Sarek Sees Spock</ul></li> <li>To Boldly Go Taking on the worlds most beloved science fiction franchise was no small mission. Director J.J. Abrams, writers Roberto Orci and Alex Kurtzman, producer Damon Lindelof, and executive producer Bryan Burk talk about the many challenges they faced and their strategy for success. <li>Casting The producers knew their greatest task was finding the right cast to reprise these epic roles. The cast, for their part, talk about the experience of trying to capture the essence of these mythic characters. The piece concludes with a moving tribute to Leonard Nimoy. <li>Aliens Designers Neville Page and Joel Harlow talk about the hurdles they faced creating new alien species, recreating the Romulans and Vulcans, and designing the terrifying creatures on Delta Vega for the new Star Trek. <li>Score As a fan of the original series, composer Michael Giacchino embraced the challenge of creating new music for Star Trek while preserving the spirit of Alexander Courages celebrated theme. </ul> DVD-Rom', '<ul><li>STAR TREK D-A-C Free Trial Game for XBOX 360 <li>Weblink to the STAR TREK D-A-C Free Trial Game for PC <li>Weblink to the STAR TREK D-A-C Free Trial Game for PlayStation Network</ul></div>\\n  </div>\\n  <div id=\"expandSPF\" style=\"display:block;\">\\n<span class=\"swSprite s_expandChevron \" ></span>    <b><a class=\"onPageLink\" onclick=\"amz_expandPostBody(\\'SPF\\', objectsSPF); return false;\" href=\"#\">Read more</a></b>\\n  </div>\\n  <div id=\"collapseSPF\" style=\"display:none;\">\\n<span class=\"swSprite s_collapseChevron \" ></span>    <b><a class=\"onPageLink\" onclick=\"amz_collapsePostBody(\\'SPF\\', objectsSPF); return false;\" href=\"#\">Show less</a></b>\\n  </div>\\n  <script>\\n  <!--\\n    var objectsSPF = [];\\n\\n    function amz_expandPostBody(id, objects) {\\n      amznJQ.onReady(\\'jQuery\\', function() {\\n        var i;\\n        for (var i = 0; i < objects.length; i++) {\\n          jQuery(\"#\" + objects[i]).hide();\\n        }\\n        jQuery(\"#outer_postBody\" + id).animate({height: jQuery(\"#postBody\" + id).height()}, 500);\\n\\tjQuery(\"#expand\" +id).hide();\\n\\tjQuery(\"#collapse\" +id).show();\\n      });\\n    }\\n\\n    function amz_collapsePostBody(id, objects) {\\n      amznJQ.onReady(\\'jQuery\\',function (){\\n        var i;\\n        for (var i = 0; i < objects.length; i++) {\\n          jQuery(\"#\" + objects[i]).show();\\n        }\\n\\tlocation.replace(\"#post\" + id);\\n        jQuery(\"#outer_postBody\" + id).animate({height: 200}, 500);\\n\\tjQuery(\"#collapse\" +id).hide();\\n\\tjQuery(\"#expand\" +id).show();\\n      });\\n    }\\n   //-->\\n   </script>\\n\\n</div>\\n</div>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n    \\n  \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\t\\n\\t\\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<div id=\"detail-bullets\">\\n\\n\\n\\n\\n\\n\\n\\n<hr noshade=\"noshade\" size=\"1\" class=\"bucketDivider\" />\\n<table cellpadding=\"0\" cellspacing=\"0\" border=\"0\">\\n  <tr>\\n    <td class=\"bucket\">\\n      <h2>Product details</h2>\\n      <div class=\"content\">\\n\\n\\n\\n\\n\\n\\n<ul>\\n\\n\\n\\n\\n\\n<li> <b>Actors:</b> <a href=\"/s?ie=UTF8&amp;field-keywords=Chris%20Pine&amp;search-alias=dvd\">Chris Pine</a>, <a href=\"/s?ie=UTF8&amp;field-keywords=Zachary%20Quinto&amp;search-alias=dvd\">Zachary Quinto</a>, <a href=\"/s?ie=UTF8&amp;field-keywords=Karl%20Urban&amp;search-alias=dvd\">Karl Urban</a>, <a href=\"/s?ie=UTF8&amp;field-keywords=Zoe%20Saldana&amp;search-alias=dvd\">Zoe Saldana</a>, <a href=\"/s?ie=UTF8&amp;field-keywords=Simon%20Pegg&amp;search-alias=dvd\">Simon Pegg</a></li>\\n\\n\\n\\n\\n<li> <b>Directors:</b> <a href=\"/s?ie=UTF8&amp;field-keywords=J.J.%20Abrams&amp;search-alias=dvd\">J.J. Abrams</a></li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li> <b>Format:</b> Multiple Formats, AC-3, Color, Dolby, Dubbed, NTSC, Special Edition, Subtitled, Widescreen</li>\\n\\n\\n<li><b>Language:</b> English (Dolby Digital 5.1 ES Matrix), French (Dolby Digital 5.1 ES Matrix), Spanish (Dolby Digital 5.1 ES Matrix)</li>\\n\\n\\n\\n\\n<li><b>Subtitles:</b> English, French, Spanish</li>\\n\\n\\n\\n\\n<li><b>Dubbed:</b> French, Spanish</li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li> <b>Region:</b> Region 1 (<font color=#990000>U.S. and Canada only.</font> Read more about <a href=\"/gp/help/customer/display.html?ie=UTF8&amp;nodeId=3193231\">DVD formats.</a>)<br/></li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li> <b>Number of discs:</b> 2</li>\\n\\n\\n<li> <b>Rated: </b>        <div class=\"a-box a-box-thumbnail\"><div class=\"a-box-inner\">\\n            <span class=\"a-letter-space\"></span>\\n            <span class=\"a-size-small\">\\n                PG-13\\n            </span>\\n            <span class=\"a-letter-space\"></span>\\n        </div></div>\\n        Parents Strongly Cautioned </li>\\n\\n\\n\\n\\n\\n<li> <b>Studio:</b> Paramount</li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li> <b>DVD Release Date:</b> November 17, 2009</li>\\n\\n     \\n\\n\\n\\n\\n\\n\\n<li> <b>Run Time:</b> 127 minutes</li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n  \\n  \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li><b>Average Customer Review:</b> \\n\\n\\n\\n\\n<span class=\"dpProductDetailB001AVCFJM\">\\n  <span class=\"a-declarative\" data-action=\"a-popover\" data-a-popover=\"{&quot;closeButton&quot;:&quot;false&quot;,&quot;max-width&quot;:&quot;700&quot;,&quot;position&quot;:&quot;triggerBottom&quot;,&quot;url&quot;:&quot;/review/widgets/average-customer-review/popover/ref=acr_dpproductdetail_popover?ie=UTF8&amp;asin=B001AVCFJM&amp;contextId=dpProductDetail&amp;ref=acr_dpproductdetail_popover&quot;}\">\\n    <a href=\"javascript:void(0)\" class=\"a-popover-trigger a-declarative\">\\n      <a class=\"a-link-normal a-text-normal\" href=\"https://www.amazon.com/product-reviews/B001AVCFJM/ref=acr_dpproductdetail_text?ie=UTF8&showViewpoints=1\">\\n        <i class=\"a-icon a-icon-star a-star-4-5\"><span class=\"a-icon-alt\">4.7 out of 5 stars</span></i>\\n      </a>\\n    <i class=\"a-icon a-icon-popover\"></i></a>\\n  </span>\\n  <span class=\"a-letter-space\"></span>\\n  <span class=\"a-size-small\">\\n    <a class=\"a-link-normal\" href=\"https://www.amazon.com/product-reviews/B001AVCFJM/ref=acr_dpproductdetail_text?ie=UTF8&showViewpoints=1\">\\n      5,300 customer reviews\\n    </a>\\n  </span>\\n</span>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n</li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li><b>ASIN: </b>B001AVCFJM</li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<li id=\"SalesRank\">\\n<b>Amazon Best Sellers Rank:</b> \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n#35,108 in Movies & TV (<a href=\"https://www.amazon.com/best-sellers-movies-TV-DVD-Blu-ray/zgbs/movies-tv/ref=pd_dp_ts_movies-tv_1\">See Top 100 in Movies & TV</a>)\\n \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<style type=\"text/css\">\\n.zg_hrsr { margin: 0; padding: 0; list-style-type: none; }\\n.zg_hrsr_item { margin: 0 0 0 10px; }\\n.zg_hrsr_rank { display: inline-block; width: 80px; text-align: right; }\\n</style>\\n\\n<ul class=\"zg_hrsr\">\\n    <li class=\"zg_hrsr_item\">\\n    <span class=\"zg_hrsr_rank\">#1027</span>\\n    <span class=\"zg_hrsr_ladder\">in&nbsp;<a href=\"https://www.amazon.com/best-sellers-movies-TV-DVD-Blu-ray/zgbs/movies-tv/ref=pd_zg_hrsr_movies-tv_1_1\">Movies & TV</a> &gt; <a href=\"https://www.amazon.com/gp/bestsellers/movies-tv/2958934011/ref=pd_zg_hrsr_movies-tv_1_2\">DVD</a> &gt; <b><a href=\"https://www.amazon.com/gp/bestsellers/movies-tv/2959110011/ref=pd_zg_hrsr_movies-tv_1_3_last\">Science Fiction</a></b></span>\\n    </li>\\n    <li class=\"zg_hrsr_item\">\\n    <span class=\"zg_hrsr_rank\">#3833</span>\\n    <span class=\"zg_hrsr_ladder\">in&nbsp;<a href=\"https://www.amazon.com/best-sellers-movies-TV-DVD-Blu-ray/zgbs/movies-tv/ref=pd_zg_hrsr_movies-tv_2_1\">Movies & TV</a> &gt; <a href=\"https://www.amazon.com/gp/bestsellers/movies-tv/2958934011/ref=pd_zg_hrsr_movies-tv_2_2\">DVD</a> &gt; <b><a href=\"https://www.amazon.com/gp/bestsellers/movies-tv/2959099011/ref=pd_zg_hrsr_movies-tv_2_3_last\">Action & Adventure</a></b></span>\\n    </li>\\n    <li class=\"zg_hrsr_item\">\\n    <span class=\"zg_hrsr_rank\">#5002</span>\\n    <span class=\"zg_hrsr_ladder\">in&nbsp;<a href=\"https://www.amazon.com/best-sellers-movies-TV-DVD-Blu-ray/zgbs/movies-tv/ref=pd_zg_hrsr_movies-tv_3_1\">Movies & TV</a> &gt; <a href=\"https://www.amazon.com/gp/bestsellers/movies-tv/2958934011/ref=pd_zg_hrsr_movies-tv_3_2\">DVD</a> &gt; <b><a href=\"https://www.amazon.com/gp/bestsellers/movies-tv/2959101011/ref=pd_zg_hrsr_movies-tv_3_3_last\">Comedy</a></b></span>\\n    </li>\\n</ul>\\n\\n</li>\\n\\n\\n\\n\\n\\n\\t\\t\\n\\t\\n\\t\\t\\n\\t\\n\\t\\t\\n\\t\\n\\t\\t\\t\\n\\t\\t\\t\\n\\t\\t\\t\\n\\t\\t\\t\\n     \\t    \\n            \\n            \\n            \\n            \\n            \\n            <P><div class=\"bucket\">    <script>\\n    P.now(\"A\",\"tellMeMoreLinkData\").execute(function(A,tellMeMoreLinkData){\\n        if(typeof tellMeMoreLinkData !== \\'undefined\\'){\\n            A.state(\\'lowerPricePopoverData\\',{\"trigger\":\"ns_DP7B2QYG26833B7J318Y_34035_1_hmd_pricing_feedback_trigger_product-detail\",\"destination\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tvencodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"url\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tv\",\"nsPrefix\":\"ns_DP7B2QYG26833B7J318Y_34035_2_\",\"path\":\"encodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"title\":\"Tell Us About a Lower Price\"});\\n            return {\\n                   key:\"pricing-fbW\",\\n                   method: function(){\\n                                     return {\"trigger\":\"ns_DP7B2QYG26833B7J318Y_34035_1_hmd_pricing_feedback_trigger_product-detail\",\"destination\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tvencodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"url\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tv\",\"nsPrefix\":\"ns_DP7B2QYG26833B7J318Y_34035_2_\",\"path\":\"encodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"title\":\"Tell Us About a Lower Price\"};\\n                                     }\\n                   }\\n        }\\n        else{\\n                P.when(\"A\").register(\"tellMeMoreLinkData\",function(A){\\n                    A.state(\\'lowerPricePopoverData\\',{\"trigger\":\"ns_DP7B2QYG26833B7J318Y_34035_1_hmd_pricing_feedback_trigger_product-detail\",\"destination\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tvencodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"url\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tv\",\"nsPrefix\":\"ns_DP7B2QYG26833B7J318Y_34035_2_\",\"path\":\"encodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"title\":\"Tell Us About a Lower Price\"});\\n                    return {\\n                           key:\"pricing-fbW\",\\n                           method: function(){\\n                                             return {\"trigger\":\"ns_DP7B2QYG26833B7J318Y_34035_1_hmd_pricing_feedback_trigger_product-detail\",\"destination\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tvencodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"url\":\"/gp/pdp/pf/pricingFeedbackForm.html/ref=_pfdpb?ie=UTF8&ASIN=B001AVCFJM&PREFIX=ns_DP7B2QYG26833B7J318Y_34035_2_&WDG=dvd_display_on_website&dpRequestId=DP7B2QYG26833B7J318Y&from=product-detail&psc=1&storeID=movies-tv\",\"nsPrefix\":\"ns_DP7B2QYG26833B7J318Y_34035_2_\",\"path\":\"encodeURI(\\'&originalURI=\\' + window.location.pathname)\",\"title\":\"Tell Us About a Lower Price\"};\\n                                             }\\n                           }\\n\\t\\t\\t    });\\n            }\\n    });\\n    </script>\\nWould you like to <b><a href=\"#\" id=\"ns_DP7B2QYG26833B7J318Y_34035_1_hmd_pricing_feedback_trigger_product-detail\">tell us about a lower price</a></b>?<br>If you are a seller for this product, would you like to <b><a href=\"https://sellercentral.amazon.com/cu/contact-us?categoryId=30002&typeId=30005\">suggest updates through seller support</a></b>?</div></P>\\n\\n\\n\\n\\n\\n\\n\\n<li><b>Learn more about <a href=\"https://www.imdb.com/title/tt0796366/?_encoding=UTF8&amp;ref_=amzn_dp_dvd\">\"Star Trek (Two-Disc Edition)\" on IMDb</a></b></li></ul>\\n</div>\\n    </td>\\n  </tr>\\n</table>\\n</div>\\n\\n      \\n\\n    \\n    \\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<link rel=\"stylesheet\" href=\"https://images-na.ssl-images-amazon.com/images/I/41y8-mtcMgL.css?AUIClients/VSERelatedVideosClientAssets\"/><link rel=\"stylesheet\" href=\"https://images-na.ssl-images-amazon.com/images/I/516Hrm2RivL._RC|11tjO95dvNL.css,01ki+0GyU3L.css_.css?AUIClients/Brila\"/><div id=\"vse-related-videos\" class=\"a-section\"><div id=\"vse-rel-videos-carousel\" data-a-carousel-options=\"{&quot;minimum_gutter_width&quot;:15,&quot;show_partial_next&quot;:false,&quot;name&quot;:&quot;vse-rel-videos-carousel&quot;,&quot;first_item_flush_left&quot;:false}\" class=\"a-begin a-carousel-container a-carousel-static a-carousel-display-stretchyGoodness a-carousel-transition-slide vse-related-videos-container bucket\"><input autocomplete=\"on\" type=\"hidden\" class=\"a-carousel-firstvisibleitem\"><div class=\"a-row a-carousel-header-row a-size-large a-text-normal\"><div class=\"a-column a-span8\"><h2 class=\"a-carousel-heading\">Related Video Shorts</h2></div><div class=\"a-column a-span4 a-span-last a-text-right\"><span class=\"a-carousel-pagination a-size-base\"><span class=\"a-carousel-page-count\">Page <span class=\"a-carousel-page-current\">1</span> of <span class=\"a-carousel-page-max\">1</span></span><span class=\"a-carousel-restart-container\"><span class=\"a-text-separator\"></span><a class=\"a-carousel-restart\" href=\"#\">Start Over</a></span><span class=\"a-carousel-accessibility-page-info a-offscreen\" aria-live=\"polite\">Page 1 of 1</span></span></div></div><a aria-hidden=\"true\" class=\"a-size-base a-link-normal vse-upload-link aok-hidden\" title=\"UGC upload link\" tabindex=\"-1\" href=\"/creatorhub/video/upload?productASIN=B001AVCFJM&amp;referringURL=ZHAvQjAwMUFWQ0ZKTQ%3D%3D&amp;ref=RVSW\">Upload your video</a><div class=\"a-row a-carousel-controls a-carousel-row a-carousel-has-buttons\"><div class=\"a-carousel-row-inner\"><div class=\"a-carousel-col a-carousel-left\"><a class=\"a-button a-button-image a-carousel-button a-carousel-goto-prevpage\" tabindex=\"0\" href=\"#\"><span class=\"a-button-inner\"><i class=\"a-icon a-icon-previous\"><span class=\"a-icon-alt\">Previous page</span></i></span></a></div><div class=\"a-carousel-col a-carousel-center\"><div class=\"a-carousel-viewport\"><ol class=\"a-carousel\" role=\"list\"><li class=\"a-carousel-card\" role=\"listitem\" aria-setsize=\"10\" aria-posinset=\"1\"><div data-asin=\"B00K3VVXCU\" data-duration=\"2:42\" data-reference-title=\"\" data-reference-url=\"\" data-sponsored=\"false\" data-title=\"Star Trek V: The Final Frontier\" data-vendor-code=\"IVAMO\" data-vendor-name=\"Paramount Home Entertainment\" data-video-url=\"https://d1y6jrbzotnyjg.cloudfront.net/IVAMO/3fa7f9a9d39a42aa9e4a5a85632e9f98/V4/7991a21583884350b986859ded0d184b/ShortForm-Generic-480p-16-9-1409173089793-rpcbe5.mp4?Expires=1547191394&amp;Signature=d4haqNNqTGDazWYf1Qs39RJh0V2O4Xq~2LmlRALjE2vVA8ql7kH90VgJmsbVjJ5kH3s6DP1o9as7pYrTBsf2GqwAWUJcmMawqYzb3HJRrc38dxvImGJf7~BtVZbEHsHEH-qZBfxrlPiQjoZLmaw0Jxtd9u2~cMpFI9YnaKqZ50M_&amp;Key-Pair-Id=APKAJ62XWKZ35EOVO4XA\" class=\"a-section vse-video-item\"><a data-redirect-url=\"/dp/B00K3VVXCU\" aria-hidden=\"true\" class=\"a-link-normal vse-carousel-item\" title=\"Star Trek V: The Final Frontier\" tabindex=\"-1\" href=\"/dp/B00K3VVXCU\"><div class=\"vse-video-image \" data-img=\"https://images-na.ssl-images-amazon.com/images/I/61LIIEIfU3L.jpg_SR160,90_BG0,0,0_PKvse-overlay-play2.jpg\" id=\"\"><img alt=\"\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif\" class=\"a-lazy-loaded\" height=\"90px\" width=\"160px\" data-a-hires=\"https://images-na.ssl-images-amazon.com/images/I/61LIIEIfU3L.jpg_SR160,90_BG0,0,0_PKvse-overlay-play2.jpg\" data-src=\"https://images-na.ssl-images-amazon.com/images/I/61LIIEIfU3L.jpg_SR160,90_BG0,0,0_PKvse-overlay-play2.jpg\"><noscript><img alt=\"\" src=\"https://images-na.ssl-images-amazon.com/images/I/61LIIEIfU3L.jpg_SR160,90_BG0,0,0_PKvse-overlay-play2.jpg\" height=\"90px\" width=\"160px\"></noscript><p class=\"a-size-mini vse-video-duration\"> 2:42']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1340236800000,
        "asin": "B002ZG9774",
        "title": "Burlesque",
        "overall": 5,
        "reviewText": "Burlesque is just one of those movies that comes out of nowhere, doesn't get the press it deserves, and then becomes a sensational hit after the fact.  That's exactly how I feel about this movie.  Now I'm not a musical kind of guy, but I've only seen a handful of musicals, and this one ranks among the best.  It's up there with Rocky Horror and My Fair Lady (my other two favorite musical movies).\n\nThe only thing that annoys me is how some people claim that this is a \"chick flick.\"  It is by NO MEANS a chick flick!  This movie is great for both guys and girls.  For the girls, you can look at all the gorgeous women and appreciate them for their style.  You can also look at the very handsome lead actor, Jack, for some eye candy.  Maybe you view them as role models, perhaps (and maybe you fine lesbians can whet your whistle a bit!).  For the guys, well...you can look at all the gorgeous women too and get your male juices flowing.  For the gay men out there, of course there's lots to love!  You got your Broadway musical thing going on with your fabulous icon, Cher (and a musical track by your other icon, Madonna, interspersed in between scenes), and then there's Jack with a partial nudity scene.\n\nThere's something for everybody in this film!  The choreography is great, the actors are wonderful, and the dance numbers are super catchy and entertaining to watch.  It's a definite must-see.",
        "description": "['Please contact customer service with any issues around Digital codes: Phone: 800-860-2878 Email: consumer@sphecustomersupport.sony.com']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1340236800000,
        "asin": "B01DKLQMM0",
        "title": "Star Trek XI",
        "overall": 1,
        "reviewText": "*SPOILERS AHEAD!*\n\nSimply put, this is the worst Star Trek film to come out in recent history.  It makes Star Trek: Insurrection look like an Oscar winner!  The only thing going for this movie is a great cast of actors.  They played the parts extremely well (mega props to Zachary Quinto for playing a spot-on Spock).  However, the story and plot lines as a whole are just awful and bring complete disgrace to the Star Trek canon.\n\nFor one thing, the villain (Nero) was just awful.  That is NOT how a Romulan is supposed to act!  He acts way too human to be a Romulan.  The fact that both Romulus AND Vulcan were destroyed completely upsets the Star Trek canon forever.  That was an AWFUL move for the writers to make, and frankly, if Gene Roddenberry was alive during the making of this film, he would have made sure that it never got past the screenplay stage.  One look at the script, and he would have lit it on fire.\n\nAnother thing:  Spock and Uhura have a love tryst going on?  BLECH!  That's just downright awful.  Winona Ryder playing Spock's mother, Amanda?  Another bad call.  The fact that she was murdered?  Again, ANOTHER bad call.  Also, when Spock ejected Kirk onto the ice planet, what were the chances of him finding the elder Spock there also?  C'mon!  It's too much of a coincidence, and that's another display of terrible writing.  Lastly, how DARE they even use the original theme in the end credits!  Shame on them!\n\nI honestly don't know how they can even consider making a sequel to this decrepit film.  It's clearly a slap in the face to all that Star Trek is known for.  I'll make a bet that Leonard Nimoy stopped attending Star Trek conventions because he received too much flack for contributing to the destruction of the Star Trek canon in this film.  Pass this one up, folks, and stick with all the movies that came before it.  I feel so sorry for today's generation of youth.",
        "description": "[]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1377475200000,
        "asin": "6304209401",
        "title": "Star Trek - Deep Space Nine, Episode 7: Q-Less VHS",
        "overall": 3,
        "reviewText": "Simply put, this is my least favorite Star Trek series.  The main problem with it was the lack of a consistent storyline.\n\nSeasons 1 through 5 were full of lackluster to average episodes.  It was only until the finale of Season 5 that the series first started to pick up with the beginning of the Dominion War.  Then into the beginning of season 6, you have a few more episodes that pick up after the season 5 cliffhanger, but then it goes back downhill.\n\nAll throughout season 6 and half of season 7, you have these AWFUL episodes, and I mean AWFUL.  Do you think I really care about that stupid Vic Fontaine garbage, or those ludicrous Ferengi episodes?  Most of this series consists of filler garbage like that.  You would get like one pretty decent episode pertaining to the Dominion War, and then an episode (\"eppy\") bomb gets dropped.  The last 10 episodes of season 7 were pretty good, but I don't like how they abruptly ended the Dominion War.\n\nOne really well done plotline was the disease that affected the Changelings.  It's clear that the writers wanted to model the disease after HIV.  If you didn't notice the parallels to HIV, watch \"When It Rains\" again and you'll see.  I bet you that HIV exists due to a similar situation.\n\nIn summary, Star Trek DS9 is the worst in the bunch.  I haven't seen Voyager yet, but from what I've been hearing, it's really good.  I watched the first season of Enterprise so far, and I already like that season more than the entire DS9 series.\n\nIn my opinion, the best Star Trek series is TNG, then TOS, with DS9 in last place.",
        "description": "['Original airdate: 2-7-93. Stardate: 46531.2. While the premiere season of <I>DS9</I> was sharing airtime with the final season of <I>The Next Generation</I>, writers were encouraged to bridge the gap between the series, which resulted in lightly enjoyable episodes like \"Q-Less,\" in which Capt. Picard\\'s omnipotent nemesis (played with fey sarcasm by John de Lancie) gives equal time to Sisko and the crew of <I>DS9</I>. Also making the leap from the <I>NextGen</I> episode \"Qpid\" is Vash (Jennifer Hetrick), Picard\\'s paramour and intrepid archaeologist, rescued by Dax from the Gamma Quadrant and arriving on <I>DS9</I> with valuable artifacts that Quark is eager to auction off for profit. It all leads to the revelation of a mantalike alien life form, which is old hat for <I>Trek</I> fans, so this episode\\'s greatest asset is the banter between Q and Vash, in their one and only <I>DS9</I> crossover. <I>--Jeff Shannon</I>', \"After a two-year journey through the Gamma Quadrant, Vash (Jennifer Hetrick) arrives at <b>Deep Space Nine</b> loaded with treasures. Unfortunately, the mischievous Q (John de Lancie) has followed her, and once he's on board the trouble begins. First he starts a fight with Commander Sisko (Avery Brooks), then he makes the usual nuisance of himself trying to convince Vash to rejoin him on his travels.<P> Meanwhile, the station experiences a series of violent power outages. While Quark (Armin Shimerman) helps Vash auction off some of the mysterious treasures she has acquired, the crew struggles to find the cause of the power source before the station is torn apart. When Q is accused of causing the trouble, he only hints at where the true cause lies. One thing is clear-if the crew doesn't act fast, the station will be destroyed.\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1377475200000,
        "asin": "B009934S5M",
        "title": "Star Trek Into Darkness",
        "overall": 5,
        "reviewText": "I really have to admit that I hated J.J. Abrams' new take on the Star Trek franchise.  I couldn't stand the first film (and still can't), but this sequel is AMAZING.  Very well done, great storyline with edge-of-your-seat action, and great acting.\n\n*SPOILERS AHEAD!*\n\nNow to get to the nitty gritty stuff:\n\n1)  The storyline:  KHAN.  I found it really funny how this is the second movie of the new Trek cast, and Khan just happened to be introduced here (just like the second movie of the original cast).  How they revealed the \"Federation agent\" to be Khan was pretty well done.  In this film, you have Spock screaming \"KHANNN!!!!\" instead of Kirk (which was rather blahh in my opinion), and you have Kirk (instead of Spock) being trapped in the radiation chamber.  What would have been great is if Kirk actually died in this film, but alas, he doesn't.\n\n2) I felt that introducing the Klingons in this film was a wasted plot effort.  They really served no purpose here, and they looked AWFUL.  You can see the computer generated effects with the so-called makeup, and they look more reptilian than anything else (with parallels to the Cardassians).  Not a fan at all with how the new Klingons look.\n\n3)  Capt. Christopher's Pike death.  Too bad they killed him off.  I wish they would have paralleled the Chris Pike character from the original series by showing how he came to be in a motorized wheelchair.\n\nOther than the above points, I really enjoyed the film, and I'll definitely watch it again and again.  As much as I initially hated J.J. Abrams' re-imagining of the franchise, it's not bad when you view it in a certain way.  You can't see these movies as a complete destruction of the Trek canon or a cheap rip off.  You need to see them as an alternative history/timeline sort of thing.  When seen in this way (whether this is actually Abrams' philosophy or not), you gain a greater appreciation for these films.",
        "description": "['Directed by J.J. Abrams. Starring Zachary Quinto, Simon Pegg, Karl Urban.']",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1382918400000,
        "asin": "B0049P1ZZQ",
        "title": "The Walking Dead: Season 1",
        "overall": 1,
        "reviewText": "PLEASE NOTE:  This one-star rating is not for the show itself!  It's for the failure of Amazon to make the show free for Prime members.  As of this writing, the show is on its fourth season.  By now, you would at least expect Amazon to free up the first season for free.\n\nWhat's going on, Amazon?\n\nAddendum:  Once this show streams free for Prime members, I will upgrade the rating to 5 stars.",
        "description": "[\"After waking from a coma in an abandoned hospital, police officer Rick Grimes finds the world he knew gone - ravaged by a zombie epidemic of apocalyptic proportions. Nearby, on the outskirts of Atlanta, a small encampment struggles to survive as 'the dead' stalk them at every turn. Can Rick and the others hold onto their humanity as they fight to live in this terrifying new world? And, amidst dire conditions and personal rivalries, will they ultimately survive one another? AMCs The Walking Dead is an epic, survival adventure series from the director of The Shawshank Redemption and the producer of The Terminator and Aliens.\"]",
        "domain": "Movies_and_TV"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1411430400000,
        "asin": "630272256X",
        "title": "The Distinguished Gentleman VHS",
        "overall": 5,
        "reviewText": "The Distinguished Gentleman is a childhood favorite movie of mine, and it gave me inspiration to run for Congress when I was a little tyke.  This is up there with Beverly Hills Cop III as my favorite Eddie Murphy movie of all time.  Super funny stuff!",
        "description": "['\"Mr. Murphy Goes to Washington.\" As a sly con man from Florida, Thomas Jefferson Johnson (a name he enjoys reciting), Murphy seems just about perfectly cast. And the notion that a crook would be drawn to Capitol Hill like a fly to honey is a cheap, cynical idea that could be milked for a few belly laughs. The chief bad guy, a greedy lobbyist aptly named Dick Dodge (Lane Smith), is a perfect, smarmy target, but the movie loses its cool and turns earnest and patriotic, striking a high-minded attitude that it has scarcely earned. It may have seemed a clever idea hiring a Brit, Jonathan Lynn (<I>Clue</I>) to direct, but he doesn\\'t bring a fresh eye to the material. Sheryl Lee Ralph and Joe Don Baker bat cleanup. <I>--David Chute</I>']",
        "domain": "Movies_and_TV"
    }
]