[
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1331856000000,
        "asin": "B000OLXX86",
        "title": "Mass Effect - Xbox 360",
        "overall": 4,
        "reviewText": "Mass Effect is one of the greatest (if not, THE greatest) sci-fi RPGs ever made.  It's chock-full of player-driven choices and exquisite cinematic cutscenes with a fairly decent story to boot.  Unfortunately, it's the story that has led me to give this game 4 stars rather than 5.\n\nYou see, the story is entirely unoriginal.  The developers at Bioware clearly \"borrowed\" (almost to the point of downright stealing) storyline elements from Star Trek and Stargate.  All they basically did was create great characters with cool-sounding names and intricate personalities.  I mean, the whole mass effect relay system is just like the wormhole from Star Trek Deep Space 9 or the actual stargates in the Stargate series.  Also, the ENTIRE overarching plot with the Reapers is ALL based on the Borg from Star Trek (and don't deny that fact!).  \"Indoctrination\" is the same thing as \"assimilation\".  Sorry Bioware, but the idea behind that is completely copyrighted by Gene Roddenberry and Rick Berman!!!\n\nAside from the storyline hiccup (which is a borderline burp), Mass Effect is great fun to play.  Make sure to play this game at least twice in its entirety (once using all Paragon choices, and the other playthrough using Renegade choices...just to see the difference in Shepard's character).\n\nAs of this writing, I'm playing through Mass Effect 2.  So far, it's not as good as the original Mass Effect, and I'm not sure if I want to play Mass Effect 3.  From what I've heard, the ending to ME 3 is terrible.  Since that seems to be the general consensus, I'm going to forego buying and playing ME 3 (and I suggest you all do the same).  If you only play the first and second games, you should be fine.  In fact, if you can completely block out the \"Reapers are coming!\" possibility in the first game, that should be all you need.",
        "description": "['The galaxy is trapped in an endless cycle of extinction. Every 50,000 years, an ancient machine race invades the galaxy. With ruthless efficiency, the machines wipe out all advanced organic civilization. They leave behind only the scattered ruins of technology, destroying all evidence of their own existence.Few believe this ancient legend. You, however, know it to be true. The fight to stop this extinction event has become the most important mission in the galaxy.\"You must act without remorse, without hesitation, and outside the limits of the law.\"It is your mission. As Commander Shepard of the SS Normandy, you will take your elite recon squad across a galaxy in turmoil, in a desperate race to stop the return of an enemy without mercy. To stop this enemy, you must act without remorse, without hesitation, and outside the limits of the law. Your only imperative is to preserve the safety of civilized life in the galaxy - at any cost. You must become the tip of the spear of humanity, for you alone know the full extent of what is at stake if you should fail.Science-fiction Role-playing: PerfectedMass Effect allows you to create your own customizable version of Commander Shepard (or jump in and use the pre-created character) and plunge yourself into the center of an epic science-fiction story. Choose your squad-mates, your weapons, skills and abilities, and customize your vehicles, armor and appearance - you are in complete control over your experience.In the course of your mission to stop the machine invasion, you may choose to follow the path of the soldier, the tech-specialist, or the biotics-specialisteach of which brings an arsenal of unique yet equally powerful abilities to use against the enemy. Wield a multitude of weapon types with precision accuracyutilize your technical skill to turn enemy war machines against their creatorsor unleash the full power of Dark Energy against your foe with devastating effects. CAN ONLY BE EXCHANGED FOR SAME ITEM IF DEFECTIVE']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1350691200000,
        "asin": "B0010AYJXI",
        "title": "Alan Wake - Xbox 360",
        "overall": 2,
        "reviewText": "Alan Wake for the 360 markets itself as a cinematic survival horror game, which it is, but it really falls short of greatness.  Don't expect survival horror a la early Resident Evil.  That's nowhere to be found in this game.  Instead, what you have is a very bland horror story mixed with sub-par gameplay.\n\nFirst, the story.  The cutscenes look great, but the whole premise of a writer who lost his manuscript pages and is trying to find his supposedly dead wife is really BORING.  There were not enough thrills, chills, and gore in this game for me to really enjoy it and classify it as horror.  At best, it's like an Are You Afraid of the Dark? episode from Nickelodeon.\n\nThe enemies in this game are very poorly conceived, and the weaponry is lacking in variety and modifications.  The game is fairly long, so you're getting your money's worth in terms of time played, but the ending is a real let-down.  I didn't even bother with the two extra DLC episodes either.  They're not worth your time or money.  It's a one-star game, but I gave it an extra star for the awesome soundtrack (which you can play all the songs in the Extras section of the main menu).",
        "description": "['When the wife of the best-selling writer Alan Wake disappears on their vacation, his search turns up pages from a thriller he doesn&#x2019;t even remember writing. A dark presence stalks the small town of Bright Falls, Washington pushing Wake to the brink of sanity in his fight to unravel the mystery and save the woman he loves.  With the body of an action game and the mind of a psychological thriller, Alan Wake is a pulse-pounding thrill ride.', 'Alan Wake, developed by Remedy Entertainment for the Xbox 360, is psychological action thriller that incorporates the elements of a TV show with the interactivity of a video game for a uniquely immersive experience. A suspenseful story told in successive episodes, this release will treat players to top-notch graphics that give the game a stunning cinematic look.', '<style type=\"text/css\"> .caption { font-family: Verdana, Helvetica neue, Arial, serif; font-size: 10px; font-weight: bold; font-style: italic; } ul.indent { list-style: inside disc; text-indent: -15px; } table.callout { font-family: verdana; font-size: 11px; line-height: 1. 3em; } td.vgoverview { height: 125px; background: #9DC4D8 url(https://images-na.ssl-images-amazon.com/images/G/01/electronics/detail-page/callout-bg.png) repeat-x; border-left: 1px solid #999999; border-right: 1px solid #999999; padding-left: 20px; padding-right: 20px; padding-bottom: 10px; width: 250px; font-family: verdana; font-size: 12px; } img.withlink {border:1px #777777 solid;} </style> <table align=left width=250 cellpadding=15 cellspacing=15> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-1-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page//B000FKBEXW-1-sm.jpg\" border=\"1\" class=\"withlink\" align=top></a><br><br><span class=\"caption\">Search for clues to figure out the mystery. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-1-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-2-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page//B000FKBEXW-2-sm.jpg\" border=\"1\" class=\"withlink\" align=top></a><br><br><span class=\"caption\">Alan Wake slowly realizes that his nightmares are coming true. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-2-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> </table> <table align=right width=250 cellpadding=15 cellspacing=15> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-3-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page//B000FKBEXW-3-sm.jpg\" border=\"1\" class=\"withlink\" align=top></a><br><br><span class=\"caption\">You\\'ll be able to freely roam the town of Bright Falls. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-3-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> <tr> <td> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-4-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\"><img src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page//B000FKBEXW-4-sm.jpg\" border=\"1\" class=\"withlink\" align=top></a><br><br><span class=\"caption\">High definition graphics and lighting effects make for a spectacular looking game. <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/B000FKBEXW-4-lg.jpg\" onclick=\"window.open(this.href,null,\\'width=820,height=470\\'); return false;\">View larger</a>. </span> </td> </tr> </table> <b>A Nightmare Turns to Life</b><br> Alan Wake is a bestselling horror novelist who moved to the small town of Bright Falls, Washington after suffering from insomnia and depression. Wake is able to sleep again, but after he meets a mysterious woman, he begins to have terrible nightmares. As he puts these nightmares on paper for a new book, he soon notices that all the things that happen in his book are coming true right before his eyes.', \"Using cinematic effects and technology such as real-time lighting, shadows and reflections, you'll be treated to a game that is oozing with atmosphere and able to invoke an emotional response from the player. The realistic environment features real-time weather and light changes that effect the game play for a remarkably immersive experience.\", '<b>Explore an Entire Town</b><br> The town of Bright Falls is 100 square kilometers, and players will be able to roam through this incredibly detailed area any way they like, roaming the town or wandering out to the lakes, forest, satellite towns, and more. The game gives the player goals, but how he chooses to go about completing them is up to him. Clues are scattered throughout the town, and solving mysteries will require players to pay close attention to the little details.', \"<b>Intense Combat</b><br> In addition to solving puzzles and exploration, the game also pushes players into serious action and combat; when night comes, creatures will take their best shots at Alan, and you'll have to be quick with strategy as well as weapons to beat them back.\", 'Alan Wake presents an unusual and new gaming experience that features a riveting, multi-layered story while giving the player the ability to freely roam a giant environment. It supports Dolby Digital sound. <br clear=\"all\">']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1352419200000,
        "asin": "B001REZLY8",
        "title": "Fallout 3: Game of the Year Edition",
        "overall": 1,
        "reviewText": "The glitches in this game literally make it entirely unplayable.  Every 10 minutes of playing, the whole game would freeze, and my Xbox would make these weird noises, like something is flicking back and forth in my system.  After waiting to see if the screen would unfreeze, it then says \"disc unreadable.\"  UNBELIEVABLE.  I gave the game 5 stars for the fun factor because in the duration of the game when it doesn't freeze, it's actually great, but I'm not the type to save my game every da*n second.  It's a waste of time.\n\nYou would think that Bethesda would make a quality game.  How DARE they put an unfinished game on the market?  They really should be sued for this.  No joke.",
        "description": "[\"Vault 101 Jewel of the Wastes. For 200 years, Vault 101 has faithfully served the surviving residents of Washington DC and its environs, now known as the Capital Wasteland. Though the global atomic war of 2077 left the US all but destroyed, the residents of Vault 101 enjoy a life free from the constant stress of the outside world. Giant Insects, Raiders, Slavers, and yes, even Super Mutants are all no match for superior Vault-Tec(R) engineering. Yet one fateful morning, you awake to find that your father has defied the Overseer and left the comfort and security afforded by Vault 101 for reasons unknown. Leaving the only home you've ever known, you emerge from the Vault into the harsh Wasteland sun to search for your father, and the truth.\", '<table width=1024 height=384> <tr><td colspan=2>Vault-Tec engineers have worked around the clock on an interactive reproduction of Wasteland life for you to enjoy from the comfort of your own vault. Included is an expansive world, unique combat, shockingly realistic visuals, tons of player choice, and an incredible cast of dynamic characters. Every minute is a fight for survival against the terrors of the outside world &ndash; radiation, Super Mutants, and hostile mutated creatures. From Vault-Tec, America&rsquo;s First Choice in Post Nuclear Simulation. </td></tr> <tr><td><img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/fo3_logo_goty.jpg\" alt=\"Fallout Game of the Year\" width=\"216\" height=\"92\"> <br> <sub>', 'PUBLISHER: Bethesda Softworks </br> DEVELOPER: Bethesda Game Studios</br> RELEASE DATE: 10/13/2009</br> PLATFORM: Xbox 360&trade; / PLAYSTATION&reg;3 systems, Games for Windows</br> GENRE: Post Nuclear Role-Playing</sub><br> </td> <td >', 'With Fallout 3 Game of the Year edition, experience the most acclaimed game of 2008 like never before. Create a character of your choosing and descend into an awe inspiring, post-apocalyptic world where every minute is a fight for survival. Fallout 3 Game of the Year Edition includes the original game as well as all five of the Fallout 3 Game Add-on Packs:</br><br>&nbsp<br> <b>Awards:</b><br> <img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/FO3_goty_awards.png\" alt=\"Awards!\" width=\"490\" height=\"103\" > </td></tr> </table> <table width=1024 height=384> <tr><td> <b>Included Add-on Packs:</b><br> </td></tr> <tr><td width=203> <b>Operation Anchorage </b><br> Enter a military simulation and fight in the liberation of Anchorage, Alaska from its Chinese Communist invaders.</br><br>&nbsp<br> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/788Anchorage_water.jpg\" target=\"_blank\"><img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/Anchorage_water.jpg\" alt=\"Operation Anchorage\" width=\"216\" height=\"135\" align=\"right\"></a> </td> <td width=203> <b>The Pitt </b><br> Travel to the post-apocalyptic remains of Pittsburgh and become embroiled in a conflict between slaves and their Raider masters.</br><br> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/459PittSlave.jpg\" target=\"_blank\"><img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/PittSlave.jpg\" alt=\"The Pitt\" width=\"216\" height=\"135\" align=\"right\"></a> </td> <td width=203> <b>Broken Steel</b><br> Increase your level cap to 30, and finish the fight against the Enclave remnants alongside Liberty Prime.</br>&nbsp<br>&nbsp<br> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/747Broken_Steel_hellfire.jpg\" target=\"_blank\"><img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/Broken_Steel_hellfire.jpg\" alt=\"Broken Steel\" width=\"216\" height=\"135\" align=\"right\"></a> </td> <td width=203> <b>Point Lookout </b><br> Embark on a mysterious and open-ended adventure in a huge, murky swampland along the coast of Maryland.</br><br>&nbsp<br> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/770Point_Lookout_lighthouse01.jpg\" target=\"_blank\"><img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/Point_Lookout_lighthouse01.jpg\" alt=\"Point Lookout\" width=\"216\" height=\"135\" align=\"right\"></a> </td> <td width=203> <b>Mothership Zeta </b><br> Defy hostile alien abductors and fight your way off of the alien mothership, orbiting miles above the Capital Wasteland. </br><br>&nbsp<br> <a href=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/743MothershipZeta_Deathray.jpg\" target=\"_blank\"><img border=\"0\" src=\"https://images-na.ssl-images-amazon.com/images/G/01/videogames/detail-page/MothershipZeta_Deathray.jpg\" alt=\"Mothership Zeta\" width=\"216\" height=\"135\" align=\"right\"></a> </td></tr> <tr><td colspan=5 align=\"right\"><font size=1>images and screenshots &copy; 2009 Bethesda Softworks LLC. All Rights Reserved.</font></td></tr> <tr><td colspan=5> <font size=1><b>About Bethesda Softworks</b><br> Bethesda Softworks, part of the ZeniMax Media Inc. family of companies, is a premier developer and worldwide publisher of interactive entertainment software. Titles from two of the world&rsquo;s top development studios &ndash; Bethesda Game Studios and id Software &ndash; are featured under the Bethesda Softworks label and include such blockbuster franchises as DOOM&reg;, QUAKE&reg;, The Elder Scrolls&reg;, Fallout&reg;, Wolfenstein&trade; and RAGE&trade;. <br>For more information on Bethesda Softworks&rsquo; products, visit www.bethsoft.com. <br> Fallout and Fallout: New Vegas are trademarks or registered trademarks of Bethesda Softworks LLC in the U.S. and/or other countries. All Rights Reserved.<br> </td></tr> </table>']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1352505600000,
        "asin": "B0085L2T14",
        "title": "WWE '13",
        "overall": 3,
        "reviewText": "I don't understand why people are saying that WWE '13 is the greatest WWE title to date.  It's not.  Now, I haven't played WWE '12, and a lot of people are saying that '13 is an improvement over that game, but I just can't agree that it's an exceptional wrestling title.\n\nFor one thing, what's up with the roster?  Where are the real legends like Hulk Hogan, Andre the Giant, Sgt. Slaughter, Mr. Perfect, etc.?  There are some really notable exclusions from the game.  The Attitude Era campaign is fairly decent, as it brings back great memories from when I really used to watching wrestling (throughout the 1990's).  My only gripe with the campaign is that some of those historical objectives are next to impossible to complete (i.e. hitting the ref with a title belt in time before he wakes up).  Completing those objectives are critical to unlocking extra features (wrestlers, matches, arenas, etc.).  When you can't accomplish those objectives, things get uber frustrating.  I guess it's a good thing that the WWE Shop has a fan axxess pass that you can purchase to unlock all the wrestlers, but still...you gotta pay money for that.  Not too swift, THQ.  Then when you're done with the Attitude Campaign, what else is left?  I wish you can play through a whole campaign season mode that changes constantly with new cutscenes, stories, etc.  That's nowhere to be found in this game.\n\nAs for the online multiplayer component, I haven't tried that since I'm more interested in the single player aspect of the game.\n\nI'm also not interested in the create-a-wrestler/story/arena feature either, which is a huge component of the game.  For those of you who like to create stuff to your heart's content, you'll have orgasms over that mode!  Not for me.\n\nAnd what's with WWE Universe?  I don't quite understand that mode at all.  You're given a bunch of pre-set scheduled events (which you can modify yourself however you please), but what's the point?  I feel like that this Universe Mode is there in case you want to see CPU opponents battle it out.  You can simulate the matches, too (which doesn't help).  And where are the story cutscenes that are supposed to occur in Universe?  I never saw one.  I was literally watching every match for a whole month's worth of events and nothing spectacular happened.  From what I gathered, Universe Mode is completely pointless.\n\nOverall, you should rent this game first rather than purchase it.  It's a great rental, that's for sure.  Gone are the days of WCW vs. NWO World Tour and the great N64 wrestling titles.  WWE '13 is most likely the last wrestling game I'll ever play.\n\nPERSONAL NOTE:  Looking back at my reviews, I haven't given a five-star review for a video game since I reviewed Sonic Generations in January of this year (2012).  What's going on?  I guess this year just isn't a good one as far as video games go (so far).",
        "description": "['It takes blood, sweat, and tears to become the best in the world.  And if you want to rise to the top on your terms, you better bring the Attitude, and ignite a revolution. Last summer, one man revolutionized the sports entertainment industry.  In a legendary moment at the end of Monday Night Raw, CM Punk shook up WWE and a hero was born.  Fifteen years ago, the legendary &#x201C;Stone Cold&#x201D; Steve Austin revolutionized entertainment, sparking a new generation of supporters with his relentless Attitude.  Now, a new crusade is upon us, and it doesn&#x2019;t start with an iconic WWE Superstar on television, online, or at a live event.  WWE &#x2019;13 is imminent, and it&#x2019;s time to Live the Revolution.  The WWE videogame franchise returns to provide the most authentic, seamless and passionate experience to date, presented with a grittier Attitude.  WWE &#x2019;13 will transform WWE gameplay through the introduction of WWE Live, completely changing the videogame&#x2019;s audio and presentation elements.  Predator Technology returns to further implement critical gameplay improvements, while fan favorites in WWE Universe Mode and the franchise&#x2019;s renowned Creation Suite are poised to offer the utmost in player freedom.  Furthermore, WWE &#x2019;13 will introduce a groundbreaking, single-player campaign based on the highly influential Attitude Era.  Complete with a robust roster &#x2013; the largest to date in the franchise &#x2013; along with a host of additional features, WWE &#x2019;13 is ready to live a revolution all its own.', '<div class=\"singlecolumnminwidth\">    <div class=\"aplus\" >', 'LIVE THE REVOLUTION. It takes blood, sweat, and tears to become the best in the world. And if you want to rise to the top on your terms, you better bring the Attitude, and ignite a revolution.', 'Bring the atmosphere, spectacle, and fervor of a raucous WWE Live event into your living room with awe-inspiring Spectacular Moments and a new audio system that delivers the most authentic and dynamic commentary, sound effects and crowd participation ever in a WWE game.<br />                               It was a time when Stone Cold Steve Austin battled for supremacy against his maniacal boss, Mr. McMahon. An era where The Rock told opponents to &ldquo;know your role, and shut your mouth&rdquo;, where the Undertaker threw Mankind off the top of the Hell in a Cell, and D-Generation X broke all the rules. Now, for the first time, relive this groundbreaking era in an all-new single player campaign mode that will make you experience the Monday Night Wars like never before.<br />                               The fan-favorite WWE Universe mode returns, giving you more control over WWE than ever before. Your choices determine your destiny as you dynamically shape your schedules, television shows, and rosters, and form alliances and make enemies on your way to the top.<br />                             With new animations, transitions, and modified controls built on the Predator Technology&trade; game engine, WWE &rsquo;13 will deliver strategic, fluid, and fun WWE action that plays more smoothly than any prior WWE game.', '&nbsp;']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1358035200000,
        "asin": "B007WQOIGW",
        "title": "The Walking Dead - Xbox 360",
        "overall": 5,
        "reviewText": "Yes, that's the end of the game, folks!  So now that you know the ending, you might as well completely bypass this game.  KIDDING!  You might as well play through the entire game to see how the bang happens, IF there's a bang at all, that is.  The Walking Dead is quite an amazing game, full of crafty storytelling and edge-of-your-seat decision making.  It's like a hybrid of PS3's Heavy Rain when it comes to story and Mass Effect with its decision making all rolled into one.  The combination works wonders, especially when the whole premise involves zombies.  Great stuff!\n\nI don't know why other reviewers complained about glitches in the Xbox version of the game.  The only one I encountered (and I have a 4 GB system) was a slight freeze during the loading of Episode 2.  After about a minute or two, the episode started normally.  Besides that, this game is a perfect 5 stars and definite must-own.  I played through the entire game with Lee playing the moral good guy.  I can't wait to play him as a bad-a** and make all the decisions that I never made on my first play-through.  It will be an entirely new experience, which enhances the replay value of the game.\n\nThere will definitely be a Season 2 of The Walking Dead, so be sure to never delete your original save!  I bet you that they will import it into the future release with Clementine playing the lead role this time instead of Lee.  The decisions you made as Lee will be imprinted into Clementine's psyche, so any future choices you make as her will cause her to reflect on certain past situations.  Mark my words here because I already have TellTale Games nailed down!\n\nEnjoy the Zombiepocalypse!",
        "description": "[\"The Walking Dead is an award-winning vision of Robert Kirkman's global hit comic book series. Experience the true horror and emotional impact of being a survivor of the undead apocalypse in a zombie game unlike any other. You will meet people and experience events that will impact the story of Deputy Sheriff Rick Grimes, and you will be forced to make decisions that are not only tough, but that will have a direct effect on the story that you experience. The undead are everywhere, but they're not your only problem. Starvation, betrayal, heartbreak and more will challenge you as you attempt to survive in the world of The Walking Dead.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1375142400000,
        "asin": "B001B5U80K",
        "title": "Torchlight",
        "overall": 5,
        "reviewText": "I finally beat this game today, and it's great.  If you like Diablo, you'll love this!  I got this game absolutely free off GOG when they were having a summer special.  They were literally giving it away, so I snatched it up and it's the GREATEST freebie I've gotten in a long while.  Simply fantastic.\n\nYou can read other reviews on here about what the game's all about.  Be advised that there is high replayability here, as there's an endless number of dungeons.  I consider the game \"beat\" when you defeat the Ordrak (the main quest).  I've read reports where it usually takes between 5 and 8 hours to beat him.  I beat him in about a half hour (level 31, Wizard).  After you finish the main game, however, there's still a lot to do.  The Shadow Vault opens up, and then there's the Necropolis side quest....  so much!  I'll be playing this off and on in the future, but for now, I really must move on to a different game lol.",
        "description": "['This hack-and-slash adventure is set in the mining settlement of Torchlight, a town founded on the discovery of a rare and mysterious ore called Ember. This valuable ore has the power to enchant and corrupt but its value is such that many are willing to risk their lives for it. Now, miners have uncovered Torchlights buried past: a dangerous labyrinth of caverns, monsters, and ruined civilizations beneath the ground that have been corrupted by Embers dark influence. As Evil threatens to overrun the town, a Champion is needed. Players will have the opportunity to save the town of Torchlight, battling through rock and fire, through lost cities, and across ancient tombs on a perilous journey to cleanse the mines. As one of three Character Classes, Players will explore randomly generated dungeon levels, battle a huge variety of monsters, and pursue endless variations of fame and fortune.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1380412800000,
        "asin": "B004J6I0YO",
        "title": "Prince of Persia Trilogy HD - Playstation 3",
        "overall": 1,
        "reviewText": "Whatever you do, do NOT buy this game!  The elevator battle towards the end of the Sands of Time is the most poorly designed video game aspect in recent memory.  After more than 20 tries, I just couldn't beat it.  Whenever that happens, you know that a game is fatally flawed.\n\nLet's break it down, shall we?  You encounter this elevator battle about 80% into the game, and you're stuck in it with Farah trying to slay hordes of monsters.  You not only have to stay alive yourself, but you also have to make sure that Farah doesn't die (an impossible feat).  If you don't die, she does; and if she doesn't die, you eventually do.  It's a lose-lose situation, especially within the confines of such small a space.\n\nThere are fountains on either side of the raised area within the elevator, but do you think you can use them to restore your life during the battle?  NO!  That's flaw number one.  Number two:  the camera angles are AWFUL.  Every single time at some point(s) in the battle, the camera would move behind a curtain, thereby obstructing your view and leaving you open to needless attack.  Three:  this game has HORRIBLE jumping mechanics.  Where you want the prince to jump, he jumps the other way.  Performing precise wall-run attacks during this battle is near impossible to execute on point each time.  Then, vaulting over enemies doesn't work all the time either.  Four:  you can't change the difficulty level in game.  I was playing on normal, and I was hoping to switch to easy to make this battle less difficult, but you can't do that unless you start a whole new game on that difficulty level.  HORRIBLE.  Because of these facts, this game is poorly designed and fatally flawed.\n\nIt's a shame how this happened in the first title I played on this trilogy because I have absolutely no interest in playing the other 2 games.  Sands of Time completely soured my opinion of the entire Prince of Persia franchise, and I am proudly going to trade this in to Amazon this week.\n\nDO NOT BUY!",
        "description": "['Now re-mastered in High Definition are three classic Prince Of Persia titles, exclusively for the PS3. Digitally enhanced HD and 3D graphics heighten the experience of adventure and improve overall gameplay. Included are Prince of Persia: The Sands Of Time, Prince of Persia: Warrior Within and Prince of Persia: The Two Thrones all in HD.', '<div class=\"singlecolumnminwidth\"> <div class=\"aplus\" >', 'Return to a compelling world filled with peril and adventure &mdash; more deeply, more richly and more fluidly than ever before &mdash; as three classic Prince of Persia games come to life in stunning high definition. Every sword-slashing battle and every perilous obstacle bursts out of your screen and pulls you into the action, with exploding new stereoscopic 3D graphics optimized for your 3D TV. Are you ready to assume the role of the famed prince and embark on an epic journey that will redefine your sense of time? Summon your courage as you confront deadly enemies and engage in incredible battles in your quest to save your kingdom once and for all from the forces that would tear it asunder.', \"Prepare for daring action, astonishing acrobatics and challenging missions as you dive into the excitement of the Prince of Persia Trilogy. Totally remastered for your PlayStation 3, the classic The Sands of Time, Warrior Within and The Two Thrones titles return with smoother, more spotless gameplay than ever at 60 frames per second, and immerse you in the action with the vibrancy of a full 1080p resolution. Become the master of your own dark powers as you venture into cursed palace chambers, aided by a seductive princess along the way. Ensure your safety and that of your kingdom by evading Dahaka, facing mankind's greatest fears and engaging in intense combat with your enemies. Will you have the strength of body and mind it will take to restore peace to your homeland?\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1380412800000,
        "asin": "B00009ZVHY",
        "title": "Prince of Persia: The Sands of Time - PlayStation 2",
        "overall": 1,
        "reviewText": "Whatever you do, do NOT buy this game!  The elevator battle towards the end of the game is the most poorly designed aspect in recent memory.  After more than 20 tries, I just couldn't beat it.  Whenever that happens, you know that a game is fatally flawed.\n\nLet's break it down, shall we?  You encounter this elevator battle about 80% into the game, and you're stuck in it with Farah trying to slay hordes of monsters.  You not only have to stay alive yourself, but you also have to make sure that Farah doesn't die (an impossible feat).  If you don't die, she does; and if she doesn't die, you eventually do.  It's a lose-lose situation, especially within the confines of such small a space.\n\nThere are fountains on either side of the raised area within the elevator, but do you think you can use them to restore your life during the battle?  NO!  That's flaw number one.  Number two:  the camera angles are AWFUL.  Every single time at some point(s) in the battle, the camera would move behind a curtain, thereby obstructing your view and leaving you open to needless attack.  Three:  this game has HORRIBLE jumping mechanics.  Where you want the prince to jump, he jumps the other way.  Performing precise wall-run attacks during this battle is near impossible to execute on point each time.  Then, vaulting over enemies doesn't work all the time either.  Because of these facts, this game is poorly designed and fatally flawed.\n\nDO NOT BUY!",
        "description": "[\"An unmatch hero wielding powers of mythic proportions, the prince returns to action adventure gaming with gravity-defying acrobatics, ferocious fighting skills and the ability to bend time to fulfill his destiny. Ubisoft's montreal studio presents the Sands of time, a technological breakthrough that will change the face of action adventure gaming forever.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1383609600000,
        "asin": "B00CMC6HCY",
        "title": "WWE 2K14 - Playstation 3",
        "overall": 1,
        "reviewText": "I really was excited about this game, with all the great legends I grew up with and loved.  However, as I was playing through the Wrestlemania story mode, problems ensued.\n\nFor one thing, the computer AI got increasingly more difficult.  Not that this is a bad thing, but the game has a fatal flaw to it.  Even when the difficulty is set to EASY, and you decrease all the AI Reversals to MINIMUM, the computer is STILL too difficult, and you can't achieve the historical objectives.  In later matches, the computer opponents reverse like crazy!  WHY is this happening when the options have been tweaked to the easiest of settings?  Illogical.\n\nTherefore, it is reasonable to conclude that this is a deliberate attempt on behalf of the developers to get more money out of the public.  How?  With the Accelerator Pack DLC for $1.99 that unlocks everything in the game.  You can't unlock everything and get all of the superstars (except for one) without completing the 30 Years of Wrestlemania mode.  2K and Yukes are making it clear that you have to pay an extra $2 to do that.\n\nThis devious tactic will NOT be tolerated.  In addition, why do you think this particular DLC is priced so low?  I would imagine that it would be priced really high, like future DLC packs, since it gives you everything.  It's priced at $2 so that people would be able to afford it due to the massive inconsistencies present in the Wrestlemania story mode.\n\nSave your money and do NOT buy this game!  I just revealed the developers' hidden agenda for all to see.  I'll be writing to them shortly about this as well.",
        "description": "['<div class=\"aplus\"> <div class=\"leftImage\" style=\"width: 350px;\"> <div id=\"image0\"><a href=\"https://images-na.ssl-images-amazon.com/images/I/616OSqAdZiL.jpg\" target=\"\"><img src=\"https://images-na.ssl-images-amazon.com/images/I/41BmCvpEUWL.jpg\" alt=\"\"></a><div class=\"imageCaption\"><a href=\"https://images-na.ssl-images-amazon.com/images/I/616OSqAdZiL.jpg\" target=\"\">View larger</a></div></div> </div> <h5><div id=\"header0\">BECOME IMMORTAL</div></h5> <div id=\"text0\" class=\"a-spacing-small\">', \"2K Sports' line-up of premier simulation titles expands with the company's first release in the flagship WWE videogame franchise, WWE 2K14. The most electrifying, authentic and comprehensive WWE video game experience to date.\", 'Relive the greatest matches and moments from three decades of the greatest spectacle in all of entertainment. Play through more than 45 prolific matches in an unprecedented single-player campaign celebrating 30 years of WrestleMania. Complete objectives to unlock playable characters, additional gear, historical WWE footage, and bonus content on the road to immortality.', 'Compete with the single greatest WWE roster ever assembled, including WWE Legends and present-day Superstars and Divas, such as The Rock, John Cena, Undertaker, Macho Man Randy Savage, Stone Cold Steve Austin, Shawn Michaels, Ryback and Dolph Ziggler.', 'Break Undertakers undefeated WrestleMania record or defend his legacy in an all-new Streak Mode. Upload results online and compare your dominance with others in the WWE Universe!', 'Experience the smoothest, most authentic and engaging WWE gameplay to date, including all-new player navigation, an improved reversal system, catapult finishers, new OMG moments and hundreds of new moves.', 'Explore the franchises renowned creation and customization tools to develop Superstars, entrances, arenas, finishing moves and much more. New Superstar Heads allows the user to fully customize select WWE Superstars body and attire.', 'Control the virtual WWE experience from a career-driven point of view, with individual decisions dynamically affecting alliances, rivalries, matches and unpredictable moments along the path toward WWE Championship glory.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1391990400000,
        "asin": "B00CH923NE",
        "title": "Mario and Luigi: Dream Team",
        "overall": 4,
        "reviewText": "Mario & Luigi: Dream Team is a great addition to the Mario RPG series.  This is my 2nd Mario RPG I've ever played (the first one being Legend of the Seven Stars for SNES way back in the day).  Everything about this game is great EXCEPT for the fact that it's so LONG!  I used a walkthrough for the entire game, and even while using that, the total game time came out to over 43 hours at Level 42.  I can just imagine how long this game would be if a walkthrough wasn't used!\n\nI had to deduct one star from the review just for its length.  It really didn't have to be that long, and the battles got really repetitive as the game wore on.  Some enemies got in really cheap hits, too.  Aside from all that, the game deserves 4 stars.",
        "description": "['Mario and Luigi embark on the adventure of their dreams in a hilarious action RPG that combines the real world with the wild landscapes of Luigis imagination. In Luigis dreams, anything is possible - legions of Luigis morph into forms like a bouncy tower or a wrecking ball. You can even poke a sleeping Luigi to alter events in his dream world.', '<div class=\"aplus\"> <div class=\"third-col\"> <div class=\\'centerImage\\'> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CH923NE_sleeping_lg.jpg\\'> <img src=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CH923NE_sleeping.jpg\\' alt=\\'\\' width=\\'285\\' height=\\'342\\'/> </a> <div class=\\'imageCaption\\'>Interact with a sleeping Luigi to change the dream world<br> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CH923NE_sleeping_lg.jpg\\' target=\\'\\'>view larger</a> </div> </div> <div class=\\'centerImage\\'> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CH923NE_battles_lg.jpg\\'> <img src=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CH923NE_battles.jpg\\' alt=\\'\\' width=\\'285\\' height=\\'342\\'/> </a> <div class=\\'imageCaption\\'>Mario & Luigi Team Up to take on enemies<br> <a href=\\'https://images-na.ssl-images-amazon.com/images/G/01/aplus/detail-page/B00CH923NE_battles_lg.jpg\\' target=\\'\\'>view larger</a> </div> </div> </div> <div class=\"third-col\">', \"Mario and Luigi embark on the adventure of their dreams in a hilarious action RPG that combines the real world with the wild landscapes of Luigi's imagination. In Luigi's dreams, anything is possiblelegions of Luigis morph into forms like a bouncy tower or a wrecking ball. You can even poke a sleeping Luigi to alter events in his dream world.\", \"While on vacation on Pi'illo Island, the bros. discover that Luigi's sleeping mind can open portals to the dream world. In the real world, control both bros. at once, but in the dream world Mario partners with Dreamy Luigi and hundreds of Luiginoids. In battle, timing is key to pulling off the best moves to attack or defend. Mario & Luigi can team up for supercharged Bros. Attacks. In the dream world, Mario can use Luiginary Attacks to assemble a hoard of Luigis into attack formations. Adventure with Mario & Luigi to not only rescue Peach, but to help Prince Dreambert free fellow Pi'illo folk from the bat-king Antasama's petrifying spell.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1397865600000,
        "asin": "B00FQPQGSY",
        "title": "Brothers - A Tale of Two Sons [Online Game Code]",
        "overall": 1,
        "reviewText": "I was enjoying this game until I got to Chapter 3.  Towards the end of that chapter, you cross a crumbling bridge and proceed to an area where there's a troll locked in a cave.  You have to then squeeze through the bars with Little Brother and attempt to pilfer a key from the guard troll.\n\nWell...YOU CAN'T GET IT!  The little idiot just keeps walking and walking near the gate as you hold down the Interact button!\n\nI conducted an online search to see if there was a glitch, and sure enough, there is!  This is a known glitch in the game, and the only way for you to correct it is to restart the chapter alllll over again.  Not the checkpoint or even shutting down the game and restarting it from your last save....the CHAPTER.  Do you really think I have time or the patience to play through all those obstacles that I just beat?  NO!\n\nIt would really help if developers and designers could put out a clean, finished product because this is inexcusable.  Luckily for me, this game was available free for PlayStation Plus members, so I can just delete it from the system.  If I actually bought this game, I don't know how I'd react, but I'm sure that this world's population would be lessened by a certain amount.",
        "description": "['<div>Guide two brothers on an epic fairy tale journey from visionary Swedish film director, Josef Fares and top-tier developer Starbreeze Studios. <br /><br /><br /> Control both brothers at once as you experience co-op play in single player mode, like never before. <br /><br /><br /> Solve puzzles, explore the varied locations and fight boss battles, controlling one brother with each thumbstick. <br /><br /><br /> A man, clinging to life. His two sons, desperate to cure their ailing father, are left with but one option. They must set out upon a journey to find and bring back the \"Water of Life\" as they come to rely on one another to survive. One must be strong where the other is weak, brave where the other is fearful, they must be... Brothers. <br /><br /><br /> This is one journey you will never forget.<br /><br /><strong>System Requirements:</strong> <ul> <li>Supported OS:&nbsp;Windows XP or higher&nbsp; <br /></li> <li>Processor: 2.4 GHz Dual Core Processor</li> <li>RAM: 2 GB</li> <li>Hard Disk: 2 GB</li> <li>Video Card: NVIDIA GeForce 8600 /ATI Radeon HD 2600</li> <li>Additional Requirements: DirectX 9.0<br /> Initial installation requires one-time internet connection for Steam authentication; software installations required (included with the game) include Steam Client, DirectX 9, Microsoft .NET 4 Framework, Visual C++ Redistributable 2010, and AMD CPU Drivers (XP Only/AMD Only) </li> </ul>', '<br /><strong>Notice:</strong> Brothers - A Tale of Two Sons requires a controller to play', '<strong><em>Steam</em></strong> account required for game activation and installation']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1407024000000,
        "asin": "B00C3MKCF6",
        "title": "Final Fantasy X X-2 HD Remaster  Standard Edition - PlayStation 3",
        "overall": 1,
        "reviewText": "I can't stand the Final Fantasy franchise.  It's as simple as that.  The game is boringly repetitive to me, and you have to constantly grind, and grind.....and GRIND.  Can't STAND that!\n\nThis game is also excessively long.  I got up to the Spectral Keeper boss and just threw in the towel.  Walkthroughs wouldn't help either, and I absolutely refuse to waste my time doing hundreds of other battles in order to build up my stats.  That's not my style of video gaming, and when you play a video game, it is not meant to be a chore.  It is meant to be entertaining, visually appealing, have a great storyline, and be of medium/average difficulty.\n\nIt's pathetic how it took me over 20 years to play my first Final Fantasy game, and clearly, there was a reason for the long wait.  I should have never even made the attempt to play it in the first place.  Final Fantasy X was my first, and last, Final Fantasy game.  This one is on the top of my trade-in list.",
        "description": "['FINAL FANTASY X/X 2 HD Remaster celebrates two of the most cherished and beloved entries to the world renowned franchise that has sold over 100 million units over the past twenty five years. FINAL FANTASY X introduced players to the world of Spira, and left a legendary impression on the industry with its stunning visuals, heart wrenching story, and fully voiced characters - a first in a FINAL FANTASY title. FINAL FANTASY X 2 marked the first ever direct sequel to a FINAL FANTASY title, and returned players to Spira with an even more addictive and fast paced combat system. Now completely remastered in gorgeous HD, FINAL FANTASY X/X 2 HD Remaster brings this timeless classic forward to the current generation of fans, old and new alike. FINAL FANTASY X tells the story of Tidus, a star blitzball player who journeys with a young and beautiful summoner named Yuna on her quest to save the world of Spira from an endless cycle of destruction wrought by the colossal menace known as \"Sin\". FINAL FANTASY X 2 returns to the world of Spira where High Summoner Yuna travels with her companions Rikku and Paine to unravel the mysteries of the messages hidden in the spheres she hunts, not knowing that the answers she seeks may change everything.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1410134400000,
        "asin": "B0050SWUTQ",
        "title": "Dead Space 3 Limited Edition",
        "overall": 1,
        "reviewText": "Dead Space 3 has a really terrible save/load system.  They give you 3 options to load your game:  continue from last save, continue story, or chapter select.  Whenever I select ANY of those options and load up my game, it never brings me to the point where I last saved my game!  It always takes me to at least 5 to 10 minutes before my last save.  \"Continue from last save\"?  That's a blatant lie, and EA should be sued for this.\n\nThis is extremely atrocious.  I don't want to replay the last 5 minutes of a chapter, especially when it took me a few lives to beat all those necromorphs!!!  EA really messed up royally with this one.  Thankfully, I downloaded this game for free as a PSPlus member.  If I actually bought this game, thereby giving EA some of my money, I would have been at their corporate headquarters the next day.\n\nNever again will I buy or play any future Dead Space titles, and I strongly suggest you do the same.",
        "description": "['Dead Space 3 brings Isaac Clarke and merciless soldier John Carver on a journey across space to discover the source of the Necromorph outbreak. Crash-landed on the frozen planet of Tau Volantis, Isaac must comb the harsh environment for raw materials and scavenged parts. He will then put his engineering skills to the ultimate test to create and customize weapons and survival tools. The ice planet holds the key to ending the Necromorph plague forever, but first Isaac must overcome avalanches, treacherous ice-climbs, and the violent wilderness. Facing deadlier evolved enemies and the brutal elements, Isaac can choose to team up, not only for his own survival, but for that of mankinds. Play together with a friend or go it alone as Isaac Clarke using the seamless new drop in, drop out co-op functionality. Each mode offers unique story elements and gameplay.', '<div class=\"aplus\">', '<i>Dead Space 3</i> is a Third-Person Shooter with Survival-Horror gameplay elements that challenges players to work singly, or with a friend to stop the viral/monster Necromorph outbreak. The game features the return of franchise hero, Isaac Clarke and the necessity of his weapons making abilities and precision skill in using them against in order to defeat enemies. Other game features include, drop-in/out co-op support, the additional character John Carver, evolved Necromorph enemies, a new cover system, side missions, and more.', 'Prepare yourself to scavenge the violent wilderness, build devastating weapons, and take down the terror together.', '<i>Dead Space 3</i> brings Isaac Clarke and merciless soldier, John Carver, on a journey across space to discover the source of the Necromorph outbreak. Crash-landed on the frozen planet of Tau Volantis, the pair must comb the harsh environment for raw materials and scavenged parts. Isaac will then put his engineering skills to the ultimate test to create and customize weapons and survival tools. The ice planet holds the key to ending the Necromorph plague forever, but first the team must overcome avalanches, treacherous ice-climbs, and the violent wilderness. Facing deadlier evolved enemies and the brutal elements, the unlikely pair must work together to save mankind from the impending apocalypse.']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1411430400000,
        "asin": "B0050SXU3Q",
        "title": "Sly Cooper: Thieves in Time - Playstation 3",
        "overall": 5,
        "reviewText": "Sly Cooper: Thieves in Time (TiT) is the fourth installment in a truly outstanding video game series.  I never played the previous 3 titles (currently working on the Sly Collection as of this writing), so TiT was my first Sly adventure and I LOVED it!  Great platforming action, easy to learn controls, cheeky fun cutscenes, and a decent story.  I'm surprised this didn't become a Greatest Hits title yet!\n\nA must own for any PlayStation3 library.  Pick it up now!",
        "description": "['Sly Cooper: Thieves in Time - Playstation 3']",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1416873600000,
        "asin": "B0006B0O9U",
        "title": "Super Mario 64 DS",
        "overall": 1,
        "reviewText": "There's absolutely no way to get all 150 stars in this game.  No way at all....unless you want to spend 150 hours in trying to get them all.  The controls are so haphazard that it's not even funny.  Quite a few one-star reviewers mention this fact, and I'm proud to be among them. This game was NOT made to be played on the Nintendo 3DS.\n\nLet's start with the analog stick.  Compared to the N64's analog stick, the 3DS's just plain sucks.  The slightly depressed center provides no traction whatsoever (unlike the concentric circles found on the N64's analog stick).  I'm positive that anyone reading this who has also played the original Super Mario 64 will agree that the controls on the N64 were far superior to the controls on the DS/3DS.\n\nWhen you move Mario in this game, his running speed is not consistent.  Normally, Mario would either walk at a steady pace when you press Forward, or he would run when you press Forward and hold down a button.  In the DS version, the longer you hold down the Forward button, the faster he walks.  Why??  This was not the case in the N64 version!!!  Mario did not run faster the longer I held down the analog stick in the forward direction, so why does he do that here?  That's what Forward + Y button is for!  This control mechanism has slipped me up on numerous occasions and cost me countless lives unnecessarily.\n\nAnd let's not even mention using the touch screen to move!  That's just instant death and should be avoided at all costs.  The game developers made no graphical improvements in this version either.  Some of the landscape blocks and other obstacles zoom right into the screen and get in your way at certain angles when you need to fight enemies or make crucial jumps.\n\nSpeaking of angles.....the CAMERA!  Oh, the camera.....forget that one, too.  You press the L button to center the camera in the direction Mario is facing, and oftentimes, it just keeps going around in circles.  Having to face Mario in the direction you want the camera to go in, and then attempting to move the camera with L, is frightening.\n\nDefinitely a one-star game.  Pass this one up and treasure the N64 version if you still have it.",
        "description": "[\"Nintendo 64's highly acclaimed 3D platform hit Super Mario 64 arrives on the Nintendo DS with all-new features that take full advantage of the new portable system's dual screens, touch screen and wireless multiplayer capability. New characters, stages and puzzles await players. In addition to Mario, players are able to play as Yoshi, Luigi and even Wario, each of whom has different abilities integral to collecting every last one of the 150 Power Stars hidden in the castle and grounds. Play through Adventure mode, engage in tons of new touch-sensitive mini-games or battle up to three friends in Wireless Versus mode, which you can play with only one DS Game Card. The top screen displays most of the principal action, while the bottom screen is used for mini-challenges, control functionality (such as analog stick emulation), and a map/radar screen for battles.\"]",
        "domain": "Video_Games"
    },
    {
        "reviewerID": "A2BRZDMSGCYIKN",
        "reviewerName": "Dr. D",
        "reviewTime": 1416873600000,
        "asin": "B00I4C2EKA",
        "title": "Sid Meier's Civilization V: The Complete Edition [Online Game Code]",
        "overall": 1,
        "reviewText": "Civilization 5 is the last game I ever purchase that uses Steam as a game client.  Whenever I load a saved game (whether an auto-save, cloud save, or regular save) the game crashes to my desktop due to a \"runtime error that caused the game to crash in an unusual way.\"  I've tried everything to fix the problem....2K's support site, Steam community forums, the Internet.....NADA.  No help at all.  I think the latest patch to the game broke it, so good luck with 2K/Firaxis coming out with a new patch anytime soon!  I have now switched to console games permanently, and if I need to play a game on my laptop, I will buy the disc version instead.",
        "description": "['<div>', '<i>Sid Meier&#x2019;s Civilization V: The Complete Edition</i> is the definitive Civilization V collection for PC gamers who have yet to experience the famous &#x201c;just-one-more-turn&#x201d; addictive gameplay that has made Civilization one of the greatest game series of all time. The Complete Edition includes the original 2010 Game of the Year award-winning strategy game Sid Meier&#x2019;s Civilization V, plus the two critically-acclaimed expansion packs (Gods & Kings, and Brave New World) and all of the released add-on content in one complete package for an amazing value.', '<b>Features:\\t</b></br><ul><li><b>Complete Edition Contents Include: </b></br>\\t<ul>\\t<li>Sid Meier&#x2019;s Civilization V\\t</li>\\t<li>Sid Meier&#x2019;s Civilization V: Gods & Kings</li>\\t<li>Sid Meier&#x2019;s Civilization V: Brave New World\\t</li>\\t<li>Civilization Pack: Babylon (Nebuchadnezzar II)\\t</li>\\t<li>Civilization and Scenario Pack: Denmark &#x2013; The Vikings\\t</li>\\t<li>Double Civilization and Scenario Pack: Spain and Inca\\t</li>\\t<li>Cradle of Civilization &#x2013; Mediterranean map</li>\\t<li>Cradle of Civilization &#x2013; Americas map </li>\\t<li>Explorer&#x2019;s Map Pack\\t</li>\\t<li>Civilization and Scenario Pack: Polynesia</li>\\t<li>Civilization and Scenario Pack: Korea</li>\\t<li>Wonders of the Ancient World Scenario Pack</li>\\t<li>Cradle of Civilization &#x2013; Asia map</li>\\t<li>Cradle of Civilization &#x2013; Mesopotamia map</li>\\t<li>Scrambled Continents Map Pack</li>\\t<li>Scrambled Nations Map Pack</li>\\t<li>Conquest of the New World Deluxe Scenario</li>\\t</ul>\\t</li><li><b>ENDLESS REPLAYABILITY:</b> Play as one of 43 historical leaders and wage war by land, sea, and air, conduct diplomacy & espionage, establish religious beliefs, and discover new technologies in your quest to build the most powerful empire the world has ever known.</li><li><b>HUGE BATTLES:</b> Wars between empires spread across land and sea. Ranged bombardment challenges you to develop clever strategies to guarantee victory on the battlefield.</li><li><b>DIPLOMACY:</b> Negotiate with some of history&#x2019;s most cunning rulers, each with a well-crafted plan for victory. City-states present a diplomatic battleground on which the major powers of the world will vie for supremacy. </li><li><b>RELIGION:</b> Cultivate Great Prophets and create a religion you can customize and enhance.</li><li><b>ESPIONAGE:</b> Send your spies into foreign cities for surveillance, to steal advanced technologies from your competitors, or to interfere with city-state alliances.</li><li><b>INTERNATIONAL TRADE:</b> Build your cities into hubs of international trade by land and sea, creating great wealth and prosperity for your people.   </li><li><b>MULTIPLAYER:</b> Challenge other players to become ruler of the world.</li></ul>', \"<small>Steam account required for game activation and installation.</br>2007-2010 Take-Two Interactive Software and its subsidiaries. Developed by Firaxis Games. Sid Meier's Civilization V, Civilization, 2K Games, Firaxis Games, Take-Two Interactive Software and their respective logos are all trademarks and/or registered trademarks of Take-Two Interactive Software, Inc. The ratings icon is a trademark of the Entertainment Software Association. All rights reserved.</small>\"]",
        "domain": "Video_Games"
    }
]